[
  {
    "id": "https://www.njit.edu/",
    "title": "New Jersey Institute of Technology |",
    "url": "https://www.njit.edu/",
    "source": "www.njit.edu",
    "description": "New Jersey Institute of Technology is the state's public polytechnic university and a leader in STEM education, research, economic development, and service.",
    "published": null,
    "tags": [],
    "text": "Admissions Undergraduate Admissions Freshmen Transfers Admission Requirements High School Counselors How to Apply Admitted Students Graduate Admissions How to Apply Graduate FAQs Admitted Graduate Students International Students How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Visiting/Non-Matriculated Students Dates and Deadlines Apply Now Contact Admissions Undergraduate Admissions Freshmen Transfers Admission Requirements High School Counselors How to Apply Admitted Students Freshmen Transfers Admission Requirements High School Counselors How to Apply Admitted Students Graduate Admissions How to Apply Graduate FAQs Admitted Graduate Students How to Apply Graduate FAQs Admitted Graduate Students International Students How to Apply Applying for a Visa How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Tuition & Costs Financial Aid Visiting/Non-Matriculated Students Dates and Deadlines Apply Now Contact Admissions Academics Degree Programs Undergraduate Studies Academic Support & Advising Graduate Studies Office of Graduate Studies Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional Development and Executive Education Pre-College Programs Degree Programs Undergraduate Studies Academic Support & Advising Academic Support & Advising Graduate Studies Office of Graduate Studies Online Graduate Studies Office of Graduate Studies Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional Development and Executive Education Pre-College Programs Research Office of the Senior Vice Provost for Research About Us Faculty Research Committees NJIT Strategic Research Plan Research Data and Publications For Researchers Courtesy Appointments Funding Opportunities Proposal Preparation Forms and Guide Pre-Award Services Post-Award and Closing Requirements Grant Management Research Compliance Grant and Contract Accounting For Students K-12 Resources For Industry and Collaborators Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPTLO FAQs Commercial Enterprise Development Contact IPTLO Undergraduate Research and Innovation Program NJIT Research Centers and Laboratories Research News Research FAQs Proposal Preparation and Submission FAQs Grant and Contract Award Set Up FAQs Subcontractor/Consulting Agreement FAQs Grant and Contract Accounting FAQs Purchase Requisition FAQs Personnel Requisition FAQs Research Compliance FAQ Responsible Conduct FAQs Institutional Review Board FAQs Institutional Biosafety Committee (IBC) FAQs Institutional Animal Care and Use FAQs Export Control FAQs Conflict of Interest/Financial Conflict of Interest FAQs Streamlyne FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Office of the Senior Vice Provost for Research About Us Faculty Research Committees NJIT Strategic Research Plan Research Data and Publications About Us Faculty Research Committees NJIT Strategic Research Plan Research Data and Publications For Researchers Courtesy Appointments Funding Opportunities Proposal Preparation Forms and Guide Pre-Award Services Post-Award and Closing Requirements Grant Management Research Compliance Grant and Contract Accounting Courtesy Appointments Funding Opportunities Proposal Preparation Forms and Guide Pre-Award Services Post-Award and Closing Requirements Grant Management Research Compliance Grant and Contract Accounting For Students K-12 Resources K-12 Resources For Industry and Collaborators Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPTLO FAQs Commercial Enterprise Development Contact IPTLO Available Technologies For Inventors For Industry IPTLO FAQs Commercial Enterprise Development Contact IPTLO Undergraduate Research and Innovation Program NJIT Research Centers and Laboratories Research News Research FAQs Proposal Preparation and Submission FAQs Grant and Contract Award Set Up FAQs Subcontractor/Consulting Agreement FAQs Grant and Contract Accounting FAQs Purchase Requisition FAQs Personnel Requisition FAQs Research Compliance FAQ Responsible Conduct FAQs Institutional Review Board FAQs Institutional Biosafety Committee (IBC) FAQs Institutional Animal Care and Use FAQs Export Control FAQs Conflict of Interest/Financial Conflict of Interest FAQs Streamlyne FAQs Proposal Preparation and Submission FAQs Grant and Contract Award Set Up FAQs Subcontractor/Consulting Agreement FAQs Grant and Contract Accounting FAQs Purchase Requisition FAQs Personnel Requisition FAQs Research Compliance FAQ Responsible Conduct FAQs Institutional Review Board FAQs Institutional Biosafety Committee (IBC) FAQs Institutional Animal Care and Use FAQs Export Control FAQs Conflict of Interest/Financial Conflict of Interest FAQs Streamlyne FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Research Staff Assignments Feedback/Comments Research/Technology Inquiries About NJIT Key Facts Rankings and Recognition Administration Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Visiting NJIT Campus & Parking Maps Maps & Directions Virtual Tour Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Key Facts Rankings and Recognition Rankings and Recognition Administration Senior Administration Administrative Departments Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Our Mission and Values Alma Maters Visiting NJIT Campus & Parking Maps Maps & Directions Virtual Tour Public Transportation to Campus Local Accommodations About Newark and New York City Campus & Parking Maps Maps & Directions Virtual Tour Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Life at NJIT Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Office of Student Life Health & Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Office of Student Life Health & Safety Student Health Services Counseling and Psychological Services Public Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Athletics NJIT Highlanders NJIT Highlanders Apply now Undergraduate Students Transfer Students Graduate Students Continuing Education Undergraduate Students Transfer Students Graduate Students Continuing Education Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Canvas Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Canvas Jobs @ NJIT Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Canvas Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Canvas Jobs @ NJIT Admissions Academics Research About Life at NJIT Athletics I am a... Apply now The only 5-star (top rating) public university in New Jersey. Public National University Public University for Alumni Earnings, Economic Mobility, and Academic Profile Public University for Alumni Earnings, Economic Mobility, and Academic Profile Public National University NATIONALLY for Entrepreneurial Programs Public National University Public University for Alumni Earnings, Economic Mobility, and Academic Profile Public National University Public University for Alumni Earnings, Economic Mobility, and Academic Profile Public National University Public University for Alumni Earnings, Economic Mobility, and Academic Profile Public National University Public University for Alumni Earnings, Economic Mobility, and Academic Profile Public National University Sagar Solank, Class of 2019 Catrina Alexandre, Class of 2019 Carla Jones, Class of 1994 Albina Gode, Class of 2015 Alexandra DePalo Victoria Lynn Birritteri Angela Vitaletti, Class of 2018 Chandani Patel, Class of 2019 Zhe He, Class of 2014 Margaret Christian, Class of 2014 Jeremy Bedient, Class of 2021 Bodhi Chaudhuri, Class of 2000 Victor Pujades, Class of 2020 Michelle Saeia, Class of 2016 Waydon Destin, Class of 2015 Helene Brochon, Class of 2020 Ines Nzameyo, Class of 2019 Daniel Newton, Class of 2020 Anousha Raina, Class of 2023 Travis Forbes, Class of 2024 Divya Tekani, Class of 2023"
  },
  {
    "id": "https://njit.campuslabs.com/engage/events",
    "title": "- Highlander Hub",
    "url": "https://njit.campuslabs.com/engage/events",
    "source": "njit.campuslabs.com",
    "description": "Discover unique opportunities at Highlander Hub! Find and attend events, browse and join organizations, and showcase your involvement.",
    "published": null,
    "tags": [],
    "text": ""
  },
  {
    "id": "https://www.njit.edu/financialaid/merit-based-scholarships",
    "title": "Merit-Based Scholarships | Financial Aid",
    "url": "https://www.njit.edu/financialaid/merit-based-scholarships",
    "source": "www.njit.edu",
    "description": "Home Apply for Aid New Admitted First-Year Students Undergraduate Graduate Matriculated Graduate Students Graduate Certificate Students International Transfer Students New Jersey Dreamers Study Abroad Checklist Dates and Deadlines Forms New Admitted First-Year Students Undergraduate Graduate Matricu",
    "published": null,
    "tags": [],
    "text": "Home Apply for Aid New Admitted First-Year Students Undergraduate Graduate Matriculated Graduate Students Graduate Certificate Students International Transfer Students New Jersey Dreamers Study Abroad Checklist Dates and Deadlines Forms New Admitted First-Year Students Undergraduate Graduate Matriculated Graduate Students Graduate Certificate Students Matriculated Graduate Students Graduate Certificate Students International Transfer Students New Jersey Dreamers Study Abroad Checklist Dates and Deadlines Forms Types of Aid Grants Loans Federal Direct Loans Federal Direct PLUS Loans Private Loans Scholarships Merit-Based Scholarships Scholarship Policies Scholarship Universe Dual Degree Scholarship Policies Student Employment Federal College Work-Study Institutional Work-Study Work-Study Policies Apply for a Job Military Benefits Summer/Winter Aid Emergency Aid Garden State Guarantee Grants Loans Federal Direct Loans Federal Direct PLUS Loans Private Loans Federal Direct Loans Federal Direct PLUS Loans Private Loans Scholarships Merit-Based Scholarships Scholarship Policies Scholarship Universe Dual Degree Scholarship Policies Merit-Based Scholarships Scholarship Policies Scholarship Universe Dual Degree Scholarship Policies Student Employment Federal College Work-Study Institutional Work-Study Work-Study Policies Apply for a Job Federal College Work-Study Institutional Work-Study Work-Study Policies Apply for a Job Military Benefits Summer/Winter Aid Emergency Aid Garden State Guarantee Affordability Cost of Attendance Financial Literacy Net Price Calculator Cost of Attendance Financial Literacy Net Price Calculator Eligibility Attendance Verification Dependency Status Disbursements and Adjustments Eligibility Requirements Enrollment Financial Aid Appeals Financial Aid Offer Loan Limits Retaking Coursework Satisfactory Academic Progress SAP Appeal Process Understanding Your SAP Letter Scholarship Eligibility Verification Withdrawals Attendance Verification Dependency Status Disbursements and Adjustments Eligibility Requirements Enrollment Financial Aid Appeals Financial Aid Offer Loan Limits Retaking Coursework Satisfactory Academic Progress SAP Appeal Process Understanding Your SAP Letter SAP Appeal Process Understanding Your SAP Letter Scholarship Eligibility Verification Withdrawals Resources & References COVID-19 Updates Consumer Information Financial Aid Calendar Frequently Asked Questions Glossary of Financial Aid Terms Graduating Students Student Loan Checklist for Graduating Students Helpful Links Loan Counseling & MPN Entrance Counseling Master Promissory Note Exit Counseling Parents Guide Student Loan Code of Conduct Student Handbook Student’s Rights and Responsibilities State Services for Students Unemployment Tuition Waiver COVID-19 Updates Consumer Information Financial Aid Calendar Frequently Asked Questions Glossary of Financial Aid Terms Graduating Students Student Loan Checklist for Graduating Students Student Loan Checklist for Graduating Students Helpful Links Loan Counseling & MPN Entrance Counseling Master Promissory Note Exit Counseling Entrance Counseling Master Promissory Note Exit Counseling Parents Guide Student Loan Code of Conduct Student Handbook Student’s Rights and Responsibilities State Services for Students Unemployment Tuition Waiver About Contact Us File Your FAFSA Events FA Awareness Month Schedule an Appointment Open House Contact Us File Your FAFSA Events FA Awareness Month FA Awareness Month Schedule an Appointment Open House Home Types of Aid Scholarships Merit-Based Scholarships Home Apply for Aid Types of Aid Grants Loans Scholarships Merit-Based Scholarships Scholarship Policies Scholarship Universe Dual Degree Scholarship Policies Student Employment Military Benefits Summer/Winter Aid Emergency Aid Garden State Guarantee Grants Loans Scholarships Merit-Based Scholarships Scholarship Policies Scholarship Universe Dual Degree Scholarship Policies Merit-Based Scholarships Scholarship Policies Scholarship Universe Dual Degree Scholarship Policies Student Employment Military Benefits Summer/Winter Aid Emergency Aid Garden State Guarantee Affordability Eligibility Resources & References About It's time for your hard work to start paying off your school bills. As an NJIT student, you'll be eligible for dozens—or even hundreds—of merit-based scholarships from the university, the state of New Jersey, and other sources such as corporations and private donors. Plus, we make it easy on you by automatically considering you for all awards for which you are eligible. Each year, your academic records will be reviewed to determine your eligibility. Most merit-based scholarship programs require that you be enrolled full time and maintain a minimum GPA of 3.0. Freshmen who are offered scholarships must acknowledge acceptance by submitting their tuition deposits by May 1. If you continue to meet the criteria for your scholarships, you will get a renewable award letter beginning in June. Please be advised that your scholarships may be reduced if total grants and scholarships exceed actual charges on your student bill. Student bills are delivered early August for the upcoming Fall semester. New Jersey Residents Out-of-State Residents All Students Outside Scholarships Scholarship Profile Template can be found here . Governor's Urban Scholarship ($1,000) The New Jersey Higher Education Student Assistance Authority awards this scholarship to high-achieving students who reside in high-need communities. You must be a New Jersey resident to be eligible. Contact Student Financial Aid Services at finaid@njit.edu or the New Jersey Higher Education Assistance Authority at 609-584-4480. New Jersey World Trade Center Scholarship The New Jersey Higher Education Student Assistance Authority awards this scholarship to dependent children and surviving spouses of New Jersey residents who were killed in or who died as a result of the terrorist attacks against the United States on September 11, 2001 or who died as a result of illness caused by exposure to the attack sites. Contact Student Financial Aid Services at finaid@njit.edu or the New Jersey Higher Education Assistance Authority at 609-584-4480. Law Enforcement Officer Memorial Scholarship The New Jersey Higher Education Student Assistance Authority awards this scholarship to dependent children of New Jersey law enforcement officers killed in the line of duty. Contact Student Financial Aid Services at finaid@njit.edu or the New Jersey Higher Education Assistance Authority at 609-584-4480. NJIT awards are available to academically talented non–New Jersey residents who enter the university as freshmen. You must be a U.S. citizen or a permanent resident to be eligible. Contact Student Financial Aid Services at finaid@njit.edu or Admissions at admissions@njit.edu . The AFCEA Educational Foundation offers academic support to U.S. military personnel through merit-based scholarships of varying amounts. These include the AFCEA Afghanistan and Iraq War Veterans Scholarship and the Disabled War Veterans Scholarship. The scholarships are open to active-duty uniformed military service members; honorably discharged U.S. military veterans, including reservists and National Guardsmen; and disabled veterans. Applicants must be U.S. citizens and sophomores or juniors enrolled in an eligible degree program and have at least a 3.0 GPA.\" To apply go to: https://www.afcea.org/war-veterans National Merit Scholarship ( tuition & fees ) This is a four-year scholarship awarded to students who have been selected by the National Merit Scholarship Corporation (NMSC) as finalists in the National Merit Scholarship Academic Program, an academic competition for recognition and scholarships. To enter the competition, a student must be either a U.S. citizen or a U.S. lawful permanent resident (intending to become a U.S. citizen at the earliest opportunity allowed by law); take the PSAT/NMSQT® in the specified year of the high-school program; and be enrolled full time in high school and planning to enroll full time in college immediately upon graduation. To maintain eligibility, you must be enrolled full time and maintain a minimum GPA of 3.0. The purpose of this scholarship is to cover tuition and fees minus other tuition based awards.. Contact Student Financial Aid Services at finaid@njit.edu or Admissions at admissions@njit.edu . Honors Merit Awards ( up to tuition & fees ) You must be accepted into the Albert Dorman Honors College to be eligible for this award. Contact the Albert Dorman Honors College at honors@njit.edu . Honors Residential Scholarship ( from $500 up to full housing & food ) You must be accepted into the Albert Dorman Honors College and reside on campus to be eligible for this award. Contact the Albert Dorman Honors College at honors@njit.edu . Faculty Scholarships (up to tuition minus other tuition-based award) These are NJIT scholarships awarded to freshmen on behalf of the NJIT faculty. You must apply for Admission to be considered for this scholarship. To remain eligible for this scholarship, you must be continuously enrolled as a full-time student, earn a minimum GPA of 3.0 (3.2 for Honors students), and be making Satisfactory Academic Progress (SAP). This award is a four 4 year scholarship (three-year for accelerated students; five-year for Architecture students) to fund your first undergraduate degree. Please be advised that, in the future, this scholarship may be replaced with funds of equal value from an NJIT scholarship donor or reduced by other sources of aid. When a combination of your scholarships and other awards exceed your charges on your student bill the package may be reduced to correct an over award. Bills will be released early August for the Fall semester and December for the Spring semester. Dean's Scholarship (fund a prescribed amount of tuition and fees) The Dean's Scholarship has been awarded to you based upon your academic achievements. To remain eligible for this scholarship, you must maintain continuous full time enrollment, have a minimum GPA of 3.0, maintain Satisfactory Academic Progress (SAP), and adhere to University Code on Academic Integrity. You are also required to complete a Free Application for Federal Student Aid (FAFSA). This award is a four-year scholarship. Please be advised that, in the future, this scholarship may be replaced with funds of equal value from an NJIT scholarship donor or reduced by other sources of aid when applicable. The purpose of this award is to help reduce tuition and fee costs. If you do not meet the scholarship criteria for renewal, you will only have one chance to appeal. Athletics Scholarships ( variable ) These scholarships are awarded to qualified students who participate in NJIT's intercollegiate sports. You can obtain information about athletic scholarships by contacting the NJIT Athletic Department at 973-596-5730. Academic Department Scholarships ( variable ) These scholarships are awarded by departmental scholarship committees to students with outstanding academic records. Contact Student Financial Aid Services at finaid@njit.edu . Architecture Design Competition Scholarships ( half- to full-tuition awards ) This is a five-year scholarship for freshmen, sponsored by the New Jersey School of Architecture . Annual Scholarships from Other Sources ( variable ) Several dozen of private scholarships have been made available to students on an annual basis by companies and individuals. Eligibility varies according to the donor's wishes, and not all scholarships are renewable. To find out more about these scholarships, contact Student Financial Aid Services at finaid@njit.edu . Merit Awards from Other Sources ( variable ) Endowed by NJIT alumni, these scholarships provide financial assistance on the basis of academic performance, leadership, choice of major, or other specific criteria determined by the donor. To find out more about these scholarships, contact Student Financial Aid Services at finaid@njit.edu . Endowments & Memorial Scholarships from Other Sources ( variable ) Hundreds of grants and scholarships have been endowed by a company or individual or are awarded in memory of a family member. Eligibility varies according to each donor's wishes. To find out more about these scholarships, contact Student Financial Aid Services at finaid@njit.edu . NJ Chapter of Professional Women in Construction Scholarship DEADLINE TO APPLY: THURSDAY, MARCH 23, 2023 The purpose of this scholarship is to support the next generation of women pursuing degrees in STEM, architecture, engineering, and construction-related industries., and who meet the below qualifications: Applicant must be a female high school senior or a full-time college or trade school student. College student eligibility requirement: one completed semester at an accredited college. Applicant must be enrolled to earn a degree or certificate in a STEM, architecture, engineering, or construction-related field. Applicant must be a New Jersey resident or be sponsored by a PWCNJ member or member firm. To apply complete the application click here PWC-NJ Scholarship Application or view their flyer . Harold B. and Dorothy A. Snyder Foundation Scholarship DEADLINE TO APPLY: Friday, March 14th, 2025 The purpose of this scholarship is to provide financial assistance to undergraduate students in their junior or senior year who are majoring in Construction Management Technology or Construction Engineering Technology, or graduate students who are pursuing a Master’s Degree in Civil Engineering or Architecture with a specialization in Construction Engineering, and who meet the below qualifications: Must be a full-time junior or senior majoring in CMT, CET, CE, or a graduate student pursuing a masters in either Civil Engineering or Architecture with a specialization in Construction Engineering. Must demonstrate financial need Must be an exceptional student, maintaining a minimum GPA of 3.0 Preference given to students who are likely to reciprocate and give back once they have established successful careers Must be a United States citizen or the holder of a visa or green card who can demonstrate their plan to eventually attain U.S. citizenship Must be a person of exemplary character, honesty, integrity, and possess a serious sense of purpose and a sense of personal accountability and responsibility to others. To apply complete the application click here Snyder Foundation Scholarship Application Once you complete the application, forward a completed application plus accompanying materials to Pat Zappone, Donor Relations Coordinator, at pat.zappone@njit.edu William S Guttenberg '44 Endowed Scholarship Purpose: To provide a $2500 scholarship to be used toward tuition, books, course materials, supplies, & equipment, fees and/or housing for each qualified student. The scholarship will be renewable for 4 years as long as the student meets the academic requirements of the scholarship. Qualifications Pertaining to Recipients: The primary recipients of the scholarships should be students from New Jersey who are physically challenged. Secondary recipients are to be from Paterson New Jersey, preferably from Eastside or Kennedy High School or another inner-city high school. Tertiary recipients are students who lost a parent in the September 11 terrorist attack. If no eligible student is found who meets the first three initial requirements, students from inner-city high schools who participate in the Educational Opportunity Program or the Honor's College may be considered. How to apply: Contact the EOP or Honor's College department and indicate your interest in the scholarship. Construction Roundtable Annual Scholarship Qualifications: Enrolled at a County or Community College or other college and accepted as a first-semester junior standing or equivalent credit hours in a New Jersey four-year college or university OR already attending a four-year college or university in New Jersey as a rising junior. Pursuing a degree in a construction-related field (engineering, architecture, construction management, and/or design). Possess a minimum 3.00 cumulative grade point average on a 4.0 scale. Be enrolled as a full-time student. Be interested in pursuing a career in the construction industry. U.S. citizen or eligible to work in the U.S. Scholarship recipients will be required to submit progress reports at the end of each academic year indicating that their grades have been maintained. Requirements: Submit to : Pat Zappone, Donor Relations Coordinator Application Form : Construction Roundtable Annual Scholarship Application Application Deadline: June 30, 2025 Please note that for your application to be considered complete, you must include the following materials: Application form Candidate statement (250 words or less) Recommendation letter from a faculty member Transcripts (unofficial transcripts are acceptable) Resume or summary of work history (1 page) NOTE: Pat Zappone's Email address is: pat.zappone@njit.edu ; Phone number: (973) 596 - 2660 NEW JERSEY ASSOCIATION OF CONSERVATION DISTRICTS MEMORIAL CONSERVATION SCHOLARSHIP Purpose of Scholarship: To encourage and support qualified students to pursue a career in a field related to the conservation and management of natural resources. Qualifications Pertaining to Recipient(s): Must be a New Jersey Resident Must be a full time student in good standing at an accredited college (not necessarily in NJ) Must have successfully completed, or will complete by the scholarship award date, at least four full semesters of study Must be an undergraduate enrolled in a curriculum major of agriculture or natural resource conservation, including agronomy, soil science, plant science, forestry, geography, agricultural education, environmental science, wildlife or fisheries management, environmental engineering, agricultural/resource economics or other major related to conservation. Application Form: NJACD Memorial Conservation Scholarship Deadline: May 6, 2019 The Peter A. Jensen Endowed Memorial Scholarship Purpose of Scholarship: To provide financial assistance (tuition and fees) to two students who are active in Greek Life and campus activities. Qualifications Pertaining to Recipient(s): Must be active in Greek Life. Must be active in additional campus activities. Financial need will be taken into consideration. Understandings Pertaining to the Administration of Scholarship (for internal control and administration use): The recipient will be selected by a committee of Pi Kappa Phi Alumni selected by the Chapter. The Director of Financial Aid must concur. Qualified candidates may submit an email of interest with attached resume to: Kkline@njit.edu Port Authority Hispanic Society 2022 Book Award Application​ Scholarship Purpose of Scholarship: 2022 Elizabeth Reyes - Book Award Scholarship is to help students pay for college textbooks Qualifications Pertaining to Recipient(s): Enrollment in a full-time accredited university or college for the 2022-2023 academic year. Demonstrate outstanding academic performance by submitting a copy of an unofficial transcript with a GPA average of a B or 3.0 (on a 4.0 scale). Theme Essay- Please submit an essay (up to 250 words) about someone you admire and why. Personal Essay- Please submit an essay (500 words) about your professional aspirations and goals, such as where you would expect to be in five years, how your degree(s) can impact your future, and/or what your dream job is. Provide two professional letters of recommendation from an academic, employment and/or volunteer reference. Resume Signed Agreement Application Form: Port Authority Hispanic Society 2022 Book Award Application​ Deadline: August 31, 2022 SOCIETY OF AMERICAN MILITARY ENGINEERS: NJ SAME Scholarship Opportunity Purpose of Scholarship: To encourage and support qualified students to pursue a career in a field related to the conservation and management of natural resources. Qualifications Pertaining to Recipient(s): Must be a New Jersey Resident Must be a U.S Citizen Must be a full time student in good standing Must be an undergraduate enrolled in a major associated with STEM Must have a minimum 2.50 cumulative grade point average on a 4.0 scale Must be a sophomore or higher Application Form: NJ SAME Scholarship Opportunity Deadline: March 14, 2025 William S Guttenberg '44 Endowed Scholarship Purpose: To provide a $2500 scholarship to be used toward tuition, books, course materials, supplies, & equipment, fees and/or housing for each qualified student. The scholarship will be renewable for 4 years as long as the student meets the academic requirements of the scholarship. Scholarship Criteria: NJ Students who are physically handicapped between the ages of 16-20 years old. How to apply: Please complete the Guttenberg Scholarship Application and submit to the Admissions Office. William S Guttenberg /44 Endowed Scholarship Purpose: To provide a $2500 scholarship to be used toward tuition, books, course materials, supplies, & equipment, fees and/or housing for each qualified student. The scholarship will be renewable for 4 years as long as the student meets the academic requirements of the scholarship. Scholarship Criteria: Student who lost a parent on the September 11, 2011 terrorist attack. How to apply: Please complete the Undergraduate Scholarship Application and submit it to the Financial Aid Office. Levendusky Alumni Scholarship: How to apply: Complete the application here We encourage all of our students to seek additional outside scholarship opportunities to finance there education at NJIT. To search for outside scholarship opportunities, you can look to your community organizations and foundations or access these search engines for additional scholarship resources: Bestcolleges.com (Hispanics and Latino/a Students) CareerOneStop.org CBCF.org CollegeBoard.org CollegeExpress.com CollegeNet.com CollegeScholarships.org Federal Employee Education & Assistance Fund FastWeb.com FinAid.org HSF.net LatinoCollegeDollars.org Scholarships.com StudentScholarshipSearch.com SuperCollege.com UNCF.org​"
  },
  {
    "id": "https://www.njit.edu/financialaid/scholarship-universe-njit",
    "title": "Scholarship Universe | Financial Aid",
    "url": "https://www.njit.edu/financialaid/scholarship-universe-njit",
    "source": "www.njit.edu",
    "description": "All Scholarship opportunities in one place!",
    "published": null,
    "tags": [],
    "text": "Home Apply for Aid New Admitted First-Year Students Undergraduate Graduate Matriculated Graduate Students Graduate Certificate Students International Transfer Students New Jersey Dreamers Study Abroad Checklist Dates and Deadlines Forms New Admitted First-Year Students Undergraduate Graduate Matriculated Graduate Students Graduate Certificate Students Matriculated Graduate Students Graduate Certificate Students International Transfer Students New Jersey Dreamers Study Abroad Checklist Dates and Deadlines Forms Types of Aid Grants Loans Federal Direct Loans Federal Direct PLUS Loans Private Loans Scholarships Merit-Based Scholarships Scholarship Policies Scholarship Universe Dual Degree Scholarship Policies Student Employment Federal College Work-Study Institutional Work-Study Work-Study Policies Apply for a Job Military Benefits Summer/Winter Aid Emergency Aid Garden State Guarantee Grants Loans Federal Direct Loans Federal Direct PLUS Loans Private Loans Federal Direct Loans Federal Direct PLUS Loans Private Loans Scholarships Merit-Based Scholarships Scholarship Policies Scholarship Universe Dual Degree Scholarship Policies Merit-Based Scholarships Scholarship Policies Scholarship Universe Dual Degree Scholarship Policies Student Employment Federal College Work-Study Institutional Work-Study Work-Study Policies Apply for a Job Federal College Work-Study Institutional Work-Study Work-Study Policies Apply for a Job Military Benefits Summer/Winter Aid Emergency Aid Garden State Guarantee Affordability Cost of Attendance Financial Literacy Net Price Calculator Cost of Attendance Financial Literacy Net Price Calculator Eligibility Attendance Verification Dependency Status Disbursements and Adjustments Eligibility Requirements Enrollment Financial Aid Appeals Financial Aid Offer Loan Limits Retaking Coursework Satisfactory Academic Progress SAP Appeal Process Understanding Your SAP Letter Scholarship Eligibility Verification Withdrawals Attendance Verification Dependency Status Disbursements and Adjustments Eligibility Requirements Enrollment Financial Aid Appeals Financial Aid Offer Loan Limits Retaking Coursework Satisfactory Academic Progress SAP Appeal Process Understanding Your SAP Letter SAP Appeal Process Understanding Your SAP Letter Scholarship Eligibility Verification Withdrawals Resources & References COVID-19 Updates Consumer Information Financial Aid Calendar Frequently Asked Questions Glossary of Financial Aid Terms Graduating Students Student Loan Checklist for Graduating Students Helpful Links Loan Counseling & MPN Entrance Counseling Master Promissory Note Exit Counseling Parents Guide Student Loan Code of Conduct Student Handbook Student’s Rights and Responsibilities State Services for Students Unemployment Tuition Waiver COVID-19 Updates Consumer Information Financial Aid Calendar Frequently Asked Questions Glossary of Financial Aid Terms Graduating Students Student Loan Checklist for Graduating Students Student Loan Checklist for Graduating Students Helpful Links Loan Counseling & MPN Entrance Counseling Master Promissory Note Exit Counseling Entrance Counseling Master Promissory Note Exit Counseling Parents Guide Student Loan Code of Conduct Student Handbook Student’s Rights and Responsibilities State Services for Students Unemployment Tuition Waiver About Contact Us File Your FAFSA Events FA Awareness Month Schedule an Appointment Open House Contact Us File Your FAFSA Events FA Awareness Month FA Awareness Month Schedule an Appointment Open House Home Types of Aid Scholarships Scholarship Universe All Scholarship opportunities in one place! Home Apply for Aid Types of Aid Grants Loans Scholarships Merit-Based Scholarships Scholarship Policies Scholarship Universe Dual Degree Scholarship Policies Student Employment Military Benefits Summer/Winter Aid Emergency Aid Garden State Guarantee Grants Loans Scholarships Merit-Based Scholarships Scholarship Policies Scholarship Universe Dual Degree Scholarship Policies Merit-Based Scholarships Scholarship Policies Scholarship Universe Dual Degree Scholarship Policies Student Employment Military Benefits Summer/Winter Aid Emergency Aid Garden State Guarantee Affordability Eligibility Resources & References About In an effort to improve educational accessibility and affordability, Student Financial Aid Services began the process of providing relevant, trusted external scholarship opportunities to you using new software, Scholarship Universe. This is an initiative that will allow you to maximize your scholarship award opportunities while allowing you to continue your goal of achieving an NJIT degree. Scholarship Universe is an online portal intended to reduce “scholarship search fatigue” by bridging students to vetted scholarship opportunities through an adaptive matching engine, which identifies relevant scholarships based on individual student's personal information, needs, and eligibility. Based on information submitted to build the student's personalized Scholarship Universe profile, students will be able to review a customized list of scholarship opportunities that they qualify for, learn the dollar value of matched opportunities, and directly connect and submit online applications with organizations offering those scholarships. Steps to apply for External Scholarships: Log in to the platform from this link: https://njit.scholarshipuniverse.com (Use UCID and Password to log in to the system. If you have not already claimed your UCID, we urge you to create your University Computing Identification (UCID) as soon as possible so that you will be able to access NJIT's Scholarship Universe portal. For details on how to set up your UCID, please go to: http://ist.njit.edu/ucid ) Upon answering some profile questions at the dashboard, the system will match your profile with the criteria from the external scholarship opportunities. Review the vetted list of external scholarship opportunities and total dollar value for each scholarship opportunity. Go to the Scholarship Tile from the options on the left of the screen View Eligible Scholarships to apply in the Matches section Click on Apply to begin the Scholarship application process You will be directed to the specific external scholarship page to apply for the scholarship External scholarship agency will contact you directly if selected Students should take care of the following: Be sure to update your profile frequently (such as GPA, Major, etc.) to get matched to all the eligible scholarships in a better way. Be sure to answer ALL the questions in order to build your profile which would match you to the most relevant scholarships. Make sure to complete the outstanding tasks to be considered without any delays. If you still have any questions, please go through our FAQs or contact Student Financial Aid Services at finaid@njit.edu or 973-596-3479."
  },
  {
    "id": "https://research.njit.edu/research",
    "title": "Research | Research",
    "url": "https://research.njit.edu/research",
    "source": "research.njit.edu",
    "description": "Research at NJIT is at the very center of university life. It is integrated into everything we do, from recruitment of new faculty to proliferation of research opportunities for our students.",
    "published": null,
    "tags": [],
    "text": "Admissions Undergraduate Admissions How We Evaluate Applicants How to Apply Admitted Students Graduate Admissions How to Apply Admitted Graduate Students Graduate FAQs International Students How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Apply Now Contact Admissions Undergraduate Admissions How We Evaluate Applicants How to Apply Admitted Students How We Evaluate Applicants How to Apply Admitted Students Graduate Admissions How to Apply Admitted Graduate Students Graduate FAQs How to Apply Admitted Graduate Students Graduate FAQs International Students How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Apply Now Contact Admissions Academics Degree Programs Undergraduate Studies Majors and Minors Academic Support & Advising Graduate Studies Graduate Degree Programs Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional & Corporate Education Pre-College Programs Degree Programs Undergraduate Studies Majors and Minors Academic Support & Advising Graduate Studies Graduate Degree Programs Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional & Corporate Education Pre-College Programs Research Office of the Senior Vice Provost for Research NJIT Strategic Research Plan Research Data and Publications About Us Centers and Laboratories For Researchers Funding Opportunities Active Programs and Grants Proposal Preparation Forms and Guide Policies Pre-Award Services Grant Management Guide Grant and Contract Accounting Post-Award and Closing Requirements Grant Management Software System Research Compliance Responsible Conduct of Research Institutional Review Board Institutional Biosafety Committee Laboratory Safety, Training and Compliance Animal Care and Use (IACUC) Export Control CITI Software OMB Uniform Guidance Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPP FAQs Intellectual Property (IP) Committee Members Commercial Enterprise Development Contact DIPP Educational Grant Support Resource Educational Programs Support and Centers Academic Achievement Program Agreements Funding Resources and Opportunities Proposal and IRB Templates For Students Undergraduate Research and Innovation Program For Industry and Collaborators Courtesy Appointments Distinguished Research Panels/Seminars Research News Research FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Office of the Senior Vice Provost for Research NJIT Strategic Research Plan Research Data and Publications About Us NJIT Strategic Research Plan Research Data and Publications About Us Centers and Laboratories For Researchers Funding Opportunities Active Programs and Grants Proposal Preparation Forms and Guide Policies Pre-Award Services Grant Management Guide Grant and Contract Accounting Post-Award and Closing Requirements Funding Opportunities Active Programs and Grants Proposal Preparation Forms and Guide Policies Pre-Award Services Grant Management Guide Grant and Contract Accounting Post-Award and Closing Requirements Grant Management Software System Research Compliance Responsible Conduct of Research Institutional Review Board Institutional Biosafety Committee Laboratory Safety, Training and Compliance Animal Care and Use (IACUC) Export Control CITI Software Responsible Conduct of Research Institutional Review Board Institutional Biosafety Committee Laboratory Safety, Training and Compliance Animal Care and Use (IACUC) Export Control CITI Software OMB Uniform Guidance Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPP FAQs Intellectual Property (IP) Committee Members Commercial Enterprise Development Contact DIPP Available Technologies For Inventors For Industry IPP FAQs Intellectual Property (IP) Committee Members Commercial Enterprise Development Contact DIPP Educational Grant Support Resource Educational Programs Support and Centers Academic Achievement Program Agreements Funding Resources and Opportunities Proposal and IRB Templates Educational Programs Support and Centers Academic Achievement Program Agreements Funding Resources and Opportunities Proposal and IRB Templates For Students Undergraduate Research and Innovation Program Undergraduate Research and Innovation Program For Industry and Collaborators Courtesy Appointments Distinguished Research Panels/Seminars Research News Research FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Research Staff Assignments Feedback/Comments Research/Technology Inquiries About Key Facts Rankings and Recognition Administration Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Visiting NJIT Maps and Directions Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Key Facts Rankings and Recognition Administration Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Visiting NJIT Maps and Directions Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Life at NJIT Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Health & Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Health & Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Athletics NJIT Highlanders NJIT Highlanders Apply now Undergraduate Students Transfer Students Graduate Students Continuing Education Undergraduate Students Transfer Students Graduate Students Continuing Education Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Admissions Academics Research About Life at NJIT Athletics I am a... Apply now Institutional Response on the Implementation of Recent Federal Executive Orders with Updates on Federally Funded Research Grants and Contracts The Office of Research provides institutional support and services, as well as fosters new opportunities to enhance NJIT research and scholarship enterprise engaging faculty, staff, students, external collaborators and partners for developing strong leadership and synergy. We are committed to providing interdisciplinary research and scholarship with the utmost professional integrity. The Excellence in Research Prize and Medal is awarded in recognition of a sustained record of contributions that have enhanced the reputation of NJIT. The NJIT Foundation Board of Directors is proud to award Bharat Biswal , distinguished professor of biomedical engineering. Previous Prize and Medal Recipients NJIT Earns Highest Research Rating (R1) total research expenditures in FY2023 Funding Opportunities For Researchers Intellectual Property & Commercialization York Center for Environmental Engineering and Science Center for Translational Research Office of the Senior Vice Provost for Research Research Compliance Research Policies Undergraduate Research and Innovation Faculty Awards Initiative Research Funding Opportunity: Pivot-RP Contacts An overview of our growing materials science and engineering cluster, where engineers, physicists, mathematicians and chemists collaborate on projects that blur the borders of all of these disciplines. Read the magazine | View our research publications | Research News Research is an integral part of a strong academic experience and a critical priority in NJIT’s 2025 Strategic Plan. The university aims for national and international prominence in research through new discoveries in areas ranging from medical sensors and devices to robotics, to nanotechnology, to cybersecurity, to next-generation materials, among other topics of vital importance in basic, applied and translational research. Our research enterprise is comprised of core and transdisciplinary basic, applied and translational research interests through five research clusters: Bioscience and Bioengineering Data Science and Management Environment and Sustainability Material Science and Engineering Robotics and Machine Intelligence National Academy of Inventors Chapter at NJIT celebrates the outstanding innovation and invention contributions of faculty, staff, and students. To quote NAI President Dr. Paul Sanberg, “NAI is proud to have NJIT, a true innovation powerhouse, as part of our membership. [NJIT has] created an environment where research and innovation flourish in such diverse fields as bioengineering, chemistry, medicine, computer science, and much more.” As a Member Institution of the NAI, NJIT has the exclusive opportunity to recognize active researchers and faculty with success in patents, licensing and commercialization at the national level through the Fellows and Senior Members Program. Research with NJIT is a collaborative effort by the New Jersey Economic Development Authority (NJEDA) and the Office of the Secretary of Higher Education (OSHE) to forge stronger connections between New Jersey’s research universities and industry. Madhusan Duwadi Class of 2022 Carmel Rafalowsky Class of 2020 Tinghan Zhao"
  },
  {
    "id": "https://research.njit.edu/bioscience-and-bioengineering",
    "title": "Bioscience and Bioengineering | Research",
    "url": "https://research.njit.edu/bioscience-and-bioengineering",
    "source": "research.njit.edu",
    "description": "This research cluster includes multidisciplinary research in the areas of biomedical devices, sensors and instrumentation, brain health & neuroscience, tissue engineering, biological sciences & behavior, molecular biology, evolutionary sciences, and gene therapy and phenotype related research.",
    "published": null,
    "tags": [],
    "text": "Admissions Undergraduate Admissions How We Evaluate Applicants How to Apply Admitted Students Graduate Admissions How to Apply Admitted Graduate Students Graduate FAQs International Students How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Apply Now Contact Admissions Undergraduate Admissions How We Evaluate Applicants How to Apply Admitted Students How We Evaluate Applicants How to Apply Admitted Students Graduate Admissions How to Apply Admitted Graduate Students Graduate FAQs How to Apply Admitted Graduate Students Graduate FAQs International Students How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Apply Now Contact Admissions Academics Degree Programs Undergraduate Studies Majors and Minors Academic Support & Advising Graduate Studies Graduate Degree Programs Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional & Corporate Education Pre-College Programs Degree Programs Undergraduate Studies Majors and Minors Academic Support & Advising Graduate Studies Graduate Degree Programs Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional & Corporate Education Pre-College Programs Research Office of the Senior Vice Provost for Research NJIT Strategic Research Plan Research Data and Publications About Us Centers and Laboratories For Researchers Funding Opportunities Active Programs and Grants Proposal Preparation Forms and Guide Policies Pre-Award Services Grant Management Guide Grant and Contract Accounting Post-Award and Closing Requirements Grant Management Software System Research Compliance Responsible Conduct of Research Institutional Review Board Institutional Biosafety Committee Laboratory Safety, Training and Compliance Animal Care and Use (IACUC) Export Control CITI Software OMB Uniform Guidance Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPP FAQs Intellectual Property (IP) Committee Members Commercial Enterprise Development Contact DIPP Educational Grant Support Resource Educational Programs Support and Centers Academic Achievement Program Agreements Funding Resources and Opportunities Proposal and IRB Templates For Students Undergraduate Research and Innovation Program For Industry and Collaborators Courtesy Appointments Distinguished Research Panels/Seminars Research News Research FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Office of the Senior Vice Provost for Research NJIT Strategic Research Plan Research Data and Publications About Us NJIT Strategic Research Plan Research Data and Publications About Us Centers and Laboratories For Researchers Funding Opportunities Active Programs and Grants Proposal Preparation Forms and Guide Policies Pre-Award Services Grant Management Guide Grant and Contract Accounting Post-Award and Closing Requirements Funding Opportunities Active Programs and Grants Proposal Preparation Forms and Guide Policies Pre-Award Services Grant Management Guide Grant and Contract Accounting Post-Award and Closing Requirements Grant Management Software System Research Compliance Responsible Conduct of Research Institutional Review Board Institutional Biosafety Committee Laboratory Safety, Training and Compliance Animal Care and Use (IACUC) Export Control CITI Software Responsible Conduct of Research Institutional Review Board Institutional Biosafety Committee Laboratory Safety, Training and Compliance Animal Care and Use (IACUC) Export Control CITI Software OMB Uniform Guidance Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPP FAQs Intellectual Property (IP) Committee Members Commercial Enterprise Development Contact DIPP Available Technologies For Inventors For Industry IPP FAQs Intellectual Property (IP) Committee Members Commercial Enterprise Development Contact DIPP Educational Grant Support Resource Educational Programs Support and Centers Academic Achievement Program Agreements Funding Resources and Opportunities Proposal and IRB Templates Educational Programs Support and Centers Academic Achievement Program Agreements Funding Resources and Opportunities Proposal and IRB Templates For Students Undergraduate Research and Innovation Program Undergraduate Research and Innovation Program For Industry and Collaborators Courtesy Appointments Distinguished Research Panels/Seminars Research News Research FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Research Staff Assignments Feedback/Comments Research/Technology Inquiries About Key Facts Rankings and Recognition Administration Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Visiting NJIT Maps and Directions Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Key Facts Rankings and Recognition Administration Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Visiting NJIT Maps and Directions Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Life at NJIT Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Health & Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Health & Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Athletics NJIT Highlanders NJIT Highlanders Apply now Undergraduate Students Transfer Students Graduate Students Continuing Education Undergraduate Students Transfer Students Graduate Students Continuing Education Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Admissions Academics Research About Life at NJIT Athletics I am a... Apply now Institutional Response on the Implementation of Recent Federal Executive Orders with Updates on Federally Funded Research Grants and Contracts Home Bioscience and Bioengineering This research cluster includes multidisciplinary research in the areas of biomedical devices, sensors and instrumentation, brain health & neuroscience, tissue engineering, biological sciences & behavior, molecular biology, evolutionary sciences, and gene therapy and phenotype related research. Home Office of the Senior Vice Provost for Research For Researchers For Students Undergraduate Research and Innovation Program For Industry and Collaborators Intellectual Property and Commercialization NJIT Research Centers and Laboratories Faculty Awards Initiative National Academy of Inventors - NJIT Research FAQs Research News Contact Us Researchers at NJIT are advancing our understanding of the functions of the brain and spinal cord under normal, injured and diseased states at molecular, cellular and functional levels through experimental, theoretical and computational methods. Imaging experts, computer scientists and biomedical engineers are working together, for example, to devise therapies and devices that will improve motor, cognitive and organ functions. To this end, our tissue engineers focus on replacing dysfunctional cells with regenerating cells and tissues. The Bioscience and Bioengineering cluster intersects with other research clusters including Material Science and Engineering, Robotics and Machine Intelligence and Data Science and Management in developing healthcare technologies and systems such as point-of-care medical sensors, devices and rehabilitation systems as well as healthcare information systems and management involving primary care, hospitals and emergency care resources and protocols. The scope of the proposed cluster includes areas that are aligned with the NSF’s 10 Big Ideas, and the National Academy of Engineering (NAE) and the National Academy of Sciences (NAS) Grand Challenges in “Reverse Engineering of the Brain,” “Tools for Scientific Discovery,” “Understanding the Rules of Life: Predicting Phenotype” and “Engineering Better Medicine.” 1 of 7 next ›"
  },
  {
    "id": "https://research.njit.edu/data-science-and-management",
    "title": "Data Science and Management | Research",
    "url": "https://research.njit.edu/data-science-and-management",
    "source": "research.njit.edu",
    "description": "This research cluster includes the study and practice of data science and analytics, and extracting information and knowledge from data that can be used for medical, financial, business management scientific and engineering applications. These groups conduct research on bioinformatics, medical informatics, image processing, data mining, solar-terrestrial physics,",
    "published": null,
    "tags": [],
    "text": "Admissions Undergraduate Admissions How We Evaluate Applicants How to Apply Admitted Students Graduate Admissions How to Apply Admitted Graduate Students Graduate FAQs International Students How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Apply Now Contact Admissions Undergraduate Admissions How We Evaluate Applicants How to Apply Admitted Students How We Evaluate Applicants How to Apply Admitted Students Graduate Admissions How to Apply Admitted Graduate Students Graduate FAQs How to Apply Admitted Graduate Students Graduate FAQs International Students How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Apply Now Contact Admissions Academics Degree Programs Undergraduate Studies Majors and Minors Academic Support & Advising Graduate Studies Graduate Degree Programs Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional & Corporate Education Pre-College Programs Degree Programs Undergraduate Studies Majors and Minors Academic Support & Advising Graduate Studies Graduate Degree Programs Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional & Corporate Education Pre-College Programs Research Office of the Senior Vice Provost for Research NJIT Strategic Research Plan Research Data and Publications About Us Centers and Laboratories For Researchers Funding Opportunities Active Programs and Grants Proposal Preparation Forms and Guide Policies Pre-Award Services Grant Management Guide Grant and Contract Accounting Post-Award and Closing Requirements Grant Management Software System Research Compliance Responsible Conduct of Research Institutional Review Board Institutional Biosafety Committee Laboratory Safety, Training and Compliance Animal Care and Use (IACUC) Export Control CITI Software OMB Uniform Guidance Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPP FAQs Intellectual Property (IP) Committee Members Commercial Enterprise Development Contact DIPP Educational Grant Support Resource Educational Programs Support and Centers Academic Achievement Program Agreements Funding Resources and Opportunities Proposal and IRB Templates For Students Undergraduate Research and Innovation Program For Industry and Collaborators Courtesy Appointments Distinguished Research Panels/Seminars Research News Research FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Office of the Senior Vice Provost for Research NJIT Strategic Research Plan Research Data and Publications About Us NJIT Strategic Research Plan Research Data and Publications About Us Centers and Laboratories For Researchers Funding Opportunities Active Programs and Grants Proposal Preparation Forms and Guide Policies Pre-Award Services Grant Management Guide Grant and Contract Accounting Post-Award and Closing Requirements Funding Opportunities Active Programs and Grants Proposal Preparation Forms and Guide Policies Pre-Award Services Grant Management Guide Grant and Contract Accounting Post-Award and Closing Requirements Grant Management Software System Research Compliance Responsible Conduct of Research Institutional Review Board Institutional Biosafety Committee Laboratory Safety, Training and Compliance Animal Care and Use (IACUC) Export Control CITI Software Responsible Conduct of Research Institutional Review Board Institutional Biosafety Committee Laboratory Safety, Training and Compliance Animal Care and Use (IACUC) Export Control CITI Software OMB Uniform Guidance Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPP FAQs Intellectual Property (IP) Committee Members Commercial Enterprise Development Contact DIPP Available Technologies For Inventors For Industry IPP FAQs Intellectual Property (IP) Committee Members Commercial Enterprise Development Contact DIPP Educational Grant Support Resource Educational Programs Support and Centers Academic Achievement Program Agreements Funding Resources and Opportunities Proposal and IRB Templates Educational Programs Support and Centers Academic Achievement Program Agreements Funding Resources and Opportunities Proposal and IRB Templates For Students Undergraduate Research and Innovation Program Undergraduate Research and Innovation Program For Industry and Collaborators Courtesy Appointments Distinguished Research Panels/Seminars Research News Research FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Research Staff Assignments Feedback/Comments Research/Technology Inquiries About Key Facts Rankings and Recognition Administration Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Visiting NJIT Maps and Directions Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Key Facts Rankings and Recognition Administration Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Visiting NJIT Maps and Directions Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Life at NJIT Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Health & Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Health & Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Athletics NJIT Highlanders NJIT Highlanders Apply now Undergraduate Students Transfer Students Graduate Students Continuing Education Undergraduate Students Transfer Students Graduate Students Continuing Education Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Admissions Academics Research About Life at NJIT Athletics I am a... Apply now Institutional Response on the Implementation of Recent Federal Executive Orders with Updates on Federally Funded Research Grants and Contracts Home Data Science and Management This research cluster includes the study and practice of data science and analytics, and extracting information and knowledge from data that can be used for medical, financial, business management scientific and engineering applications. These groups conduct research on bioinformatics, medical informatics, image processing, data mining, solar-terrestrial physics, transportation, financial management, business administration and management, life sciences and healthcare. Home Office of the Senior Vice Provost for Research For Researchers For Students Undergraduate Research and Innovation Program For Industry and Collaborators Intellectual Property and Commercialization NJIT Research Centers and Laboratories Faculty Awards Initiative National Academy of Inventors - NJIT Research FAQs Research News Contact Us The cybersecurity group designs secure cyber systems and improves cyber information and communications technology (ICT). ICT is shaping many aspects of society as the economy evolves rapidly, providing access to unprecedented amounts of information, anytime and anywhere, from any type of device. By 2025, the number of global IoT (internet of Things) connections will increase from 12 billion in 2020 to more than 30 billion according to an estimate by IoT Analytics. Global spending on security hardware, software and services is estimated to almost reaching $175 billion by 2024, according to Statista. This cluster with a broader transdisciplinary scope with diverse applications also includes multidisciplinary research centers focused on mathematical sciences, transportation systems, additive manufacturing and wireless communications technology and industry and business management, as well as on the societal impacts of science and technology. The Data Science and Management cluster spans over all other research clusters including Bioscience and Bioengineering, Environment and Sustainability, Material Science and Engineering and Robotics and Machine Intelligence for developing data driven approaches in almost all applications from healthcare information systems to industry automation, and to finance and business management. NAE and NAS Grand Challenges and NSF Big Ideas within the scope of this cluster include “Secure Cyberspace”, “Advance Personalized Learning”, “Enhance Virtual Reality” “Restore and Improve Urban Infrastructure”, “Engineer the Tools of Scientific Discovery”, and “The Future of Work at the Human-Technology Frontier”, “Harnessing the Data Revolution”, “Growing Convergence Research” and “The Quantum Leap: Leading the Next Quantum Revolution”. 1 of 2 next › 1 of 5 next ›"
  },
  {
    "id": "https://research.njit.edu/environment-and-sustainability",
    "title": "Environment and Sustainability | Research",
    "url": "https://research.njit.edu/environment-and-sustainability",
    "source": "research.njit.edu",
    "description": "The Environment and Sustainability cluster intersects with other research clusters including Material Science and Engineering, Robotics and Machine Intelligence and Data Science and Management in developing smart and green buildings and sustainable communities, understanding space weather and climate changes.",
    "published": null,
    "tags": [],
    "text": "Admissions Undergraduate Admissions How We Evaluate Applicants How to Apply Admitted Students Graduate Admissions How to Apply Admitted Graduate Students Graduate FAQs International Students How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Apply Now Contact Admissions Undergraduate Admissions How We Evaluate Applicants How to Apply Admitted Students How We Evaluate Applicants How to Apply Admitted Students Graduate Admissions How to Apply Admitted Graduate Students Graduate FAQs How to Apply Admitted Graduate Students Graduate FAQs International Students How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Apply Now Contact Admissions Academics Degree Programs Undergraduate Studies Majors and Minors Academic Support & Advising Graduate Studies Graduate Degree Programs Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional & Corporate Education Pre-College Programs Degree Programs Undergraduate Studies Majors and Minors Academic Support & Advising Graduate Studies Graduate Degree Programs Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional & Corporate Education Pre-College Programs Research Office of the Senior Vice Provost for Research NJIT Strategic Research Plan Research Data and Publications About Us Centers and Laboratories For Researchers Funding Opportunities Active Programs and Grants Proposal Preparation Forms and Guide Policies Pre-Award Services Grant Management Guide Grant and Contract Accounting Post-Award and Closing Requirements Grant Management Software System Research Compliance Responsible Conduct of Research Institutional Review Board Institutional Biosafety Committee Laboratory Safety, Training and Compliance Animal Care and Use (IACUC) Export Control CITI Software OMB Uniform Guidance Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPP FAQs Intellectual Property (IP) Committee Members Commercial Enterprise Development Contact DIPP Educational Grant Support Resource Educational Programs Support and Centers Academic Achievement Program Agreements Funding Resources and Opportunities Proposal and IRB Templates For Students Undergraduate Research and Innovation Program For Industry and Collaborators Courtesy Appointments Distinguished Research Panels/Seminars Research News Research FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Office of the Senior Vice Provost for Research NJIT Strategic Research Plan Research Data and Publications About Us NJIT Strategic Research Plan Research Data and Publications About Us Centers and Laboratories For Researchers Funding Opportunities Active Programs and Grants Proposal Preparation Forms and Guide Policies Pre-Award Services Grant Management Guide Grant and Contract Accounting Post-Award and Closing Requirements Funding Opportunities Active Programs and Grants Proposal Preparation Forms and Guide Policies Pre-Award Services Grant Management Guide Grant and Contract Accounting Post-Award and Closing Requirements Grant Management Software System Research Compliance Responsible Conduct of Research Institutional Review Board Institutional Biosafety Committee Laboratory Safety, Training and Compliance Animal Care and Use (IACUC) Export Control CITI Software Responsible Conduct of Research Institutional Review Board Institutional Biosafety Committee Laboratory Safety, Training and Compliance Animal Care and Use (IACUC) Export Control CITI Software OMB Uniform Guidance Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPP FAQs Intellectual Property (IP) Committee Members Commercial Enterprise Development Contact DIPP Available Technologies For Inventors For Industry IPP FAQs Intellectual Property (IP) Committee Members Commercial Enterprise Development Contact DIPP Educational Grant Support Resource Educational Programs Support and Centers Academic Achievement Program Agreements Funding Resources and Opportunities Proposal and IRB Templates Educational Programs Support and Centers Academic Achievement Program Agreements Funding Resources and Opportunities Proposal and IRB Templates For Students Undergraduate Research and Innovation Program Undergraduate Research and Innovation Program For Industry and Collaborators Courtesy Appointments Distinguished Research Panels/Seminars Research News Research FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Research Staff Assignments Feedback/Comments Research/Technology Inquiries About Key Facts Rankings and Recognition Administration Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Visiting NJIT Maps and Directions Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Key Facts Rankings and Recognition Administration Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Visiting NJIT Maps and Directions Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Life at NJIT Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Health & Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Health & Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Athletics NJIT Highlanders NJIT Highlanders Apply now Undergraduate Students Transfer Students Graduate Students Continuing Education Undergraduate Students Transfer Students Graduate Students Continuing Education Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Admissions Academics Research About Life at NJIT Athletics I am a... Apply now Institutional Response on the Implementation of Recent Federal Executive Orders with Updates on Federally Funded Research Grants and Contracts Home Environment and Sustainability The Environment and Sustainability cluster intersects with other research clusters including Material Science and Engineering, Robotics and Machine Intelligence and Data Science and Management in developing smart and green buildings and sustainable communities, understanding space weather and climate changes. Home Office of the Senior Vice Provost for Research For Researchers For Students Undergraduate Research and Innovation Program For Industry and Collaborators Intellectual Property and Commercialization NJIT Research Centers and Laboratories Faculty Awards Initiative National Academy of Inventors - NJIT Research FAQs Research News Contact Us This cluster represents interdisciplinary research areas in urban ecology, space weather, solar terrestrial, environmental sensors, sustainable infrastructure, intelligent transportation systems, global climate change, biodiversity and conservation, clean water, waste management, renewable energy, and smart grid systems. The urban ecology and sustainability area emphasizes sustainable infrastructure, smart transportation, ecological communities, and urban modeling and simulation. Space weather sciences and impact of evolutionary changes in the solar system impacts directly our environmental ecosystem and global climate changes. This area also focuses on the water-energy nexus and the impact of ocean levels on the environment, as well as the development of technologies to clean water and to provide green energy, such as biofuel cells and powerful, long-lasting batteries. The Environment and Sustainability cluster intersects with other research clusters including Material Science and Engineering, Robotics and Machine Intelligence and Data Science and Management in developing smart and green buildings and sustainable communities, understanding space weather and climate changes. NAE and NAS Grand Challenges and NSF Big Ideas within the scope of this cluster include “Solar Energy”, “Restore and Improve Urban Infrastructure”, “Access to Clean Water”, “Provide Energy from Fusion”, “Develop Carbon Sequestration Methods”, and “The Future of Work at the Human-Technology Frontier”, “Navigating the New Arctic” and “Windows on the Universe”. 1 of 2 next › 1 of 4 next ›"
  },
  {
    "id": "https://research.njit.edu/environment-and-sustainability",
    "title": "Environment and Sustainability | Research",
    "url": "https://research.njit.edu/environment-and-sustainability",
    "source": "research.njit.edu",
    "description": "The Environment and Sustainability cluster intersects with other research clusters including Material Science and Engineering, Robotics and Machine Intelligence and Data Science and Management in developing smart and green buildings and sustainable communities, understanding space weather and climate changes.",
    "published": null,
    "tags": [],
    "text": "Admissions Undergraduate Admissions How We Evaluate Applicants How to Apply Admitted Students Graduate Admissions How to Apply Admitted Graduate Students Graduate FAQs International Students How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Apply Now Contact Admissions Undergraduate Admissions How We Evaluate Applicants How to Apply Admitted Students How We Evaluate Applicants How to Apply Admitted Students Graduate Admissions How to Apply Admitted Graduate Students Graduate FAQs How to Apply Admitted Graduate Students Graduate FAQs International Students How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Apply Now Contact Admissions Academics Degree Programs Undergraduate Studies Majors and Minors Academic Support & Advising Graduate Studies Graduate Degree Programs Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional & Corporate Education Pre-College Programs Degree Programs Undergraduate Studies Majors and Minors Academic Support & Advising Graduate Studies Graduate Degree Programs Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional & Corporate Education Pre-College Programs Research Office of the Senior Vice Provost for Research NJIT Strategic Research Plan Research Data and Publications About Us Centers and Laboratories For Researchers Funding Opportunities Active Programs and Grants Proposal Preparation Forms and Guide Policies Pre-Award Services Grant Management Guide Grant and Contract Accounting Post-Award and Closing Requirements Grant Management Software System Research Compliance Responsible Conduct of Research Institutional Review Board Institutional Biosafety Committee Laboratory Safety, Training and Compliance Animal Care and Use (IACUC) Export Control CITI Software OMB Uniform Guidance Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPP FAQs Intellectual Property (IP) Committee Members Commercial Enterprise Development Contact DIPP Educational Grant Support Resource Educational Programs Support and Centers Academic Achievement Program Agreements Funding Resources and Opportunities Proposal and IRB Templates For Students Undergraduate Research and Innovation Program For Industry and Collaborators Courtesy Appointments Distinguished Research Panels/Seminars Research News Research FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Office of the Senior Vice Provost for Research NJIT Strategic Research Plan Research Data and Publications About Us NJIT Strategic Research Plan Research Data and Publications About Us Centers and Laboratories For Researchers Funding Opportunities Active Programs and Grants Proposal Preparation Forms and Guide Policies Pre-Award Services Grant Management Guide Grant and Contract Accounting Post-Award and Closing Requirements Funding Opportunities Active Programs and Grants Proposal Preparation Forms and Guide Policies Pre-Award Services Grant Management Guide Grant and Contract Accounting Post-Award and Closing Requirements Grant Management Software System Research Compliance Responsible Conduct of Research Institutional Review Board Institutional Biosafety Committee Laboratory Safety, Training and Compliance Animal Care and Use (IACUC) Export Control CITI Software Responsible Conduct of Research Institutional Review Board Institutional Biosafety Committee Laboratory Safety, Training and Compliance Animal Care and Use (IACUC) Export Control CITI Software OMB Uniform Guidance Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPP FAQs Intellectual Property (IP) Committee Members Commercial Enterprise Development Contact DIPP Available Technologies For Inventors For Industry IPP FAQs Intellectual Property (IP) Committee Members Commercial Enterprise Development Contact DIPP Educational Grant Support Resource Educational Programs Support and Centers Academic Achievement Program Agreements Funding Resources and Opportunities Proposal and IRB Templates Educational Programs Support and Centers Academic Achievement Program Agreements Funding Resources and Opportunities Proposal and IRB Templates For Students Undergraduate Research and Innovation Program Undergraduate Research and Innovation Program For Industry and Collaborators Courtesy Appointments Distinguished Research Panels/Seminars Research News Research FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Research Staff Assignments Feedback/Comments Research/Technology Inquiries About Key Facts Rankings and Recognition Administration Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Visiting NJIT Maps and Directions Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Key Facts Rankings and Recognition Administration Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Visiting NJIT Maps and Directions Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Life at NJIT Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Health & Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Health & Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Athletics NJIT Highlanders NJIT Highlanders Apply now Undergraduate Students Transfer Students Graduate Students Continuing Education Undergraduate Students Transfer Students Graduate Students Continuing Education Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Admissions Academics Research About Life at NJIT Athletics I am a... Apply now Institutional Response on the Implementation of Recent Federal Executive Orders with Updates on Federally Funded Research Grants and Contracts Home Environment and Sustainability The Environment and Sustainability cluster intersects with other research clusters including Material Science and Engineering, Robotics and Machine Intelligence and Data Science and Management in developing smart and green buildings and sustainable communities, understanding space weather and climate changes. Home Office of the Senior Vice Provost for Research For Researchers For Students Undergraduate Research and Innovation Program For Industry and Collaborators Intellectual Property and Commercialization NJIT Research Centers and Laboratories Faculty Awards Initiative National Academy of Inventors - NJIT Research FAQs Research News Contact Us This cluster represents interdisciplinary research areas in urban ecology, space weather, solar terrestrial, environmental sensors, sustainable infrastructure, intelligent transportation systems, global climate change, biodiversity and conservation, clean water, waste management, renewable energy, and smart grid systems. The urban ecology and sustainability area emphasizes sustainable infrastructure, smart transportation, ecological communities, and urban modeling and simulation. Space weather sciences and impact of evolutionary changes in the solar system impacts directly our environmental ecosystem and global climate changes. This area also focuses on the water-energy nexus and the impact of ocean levels on the environment, as well as the development of technologies to clean water and to provide green energy, such as biofuel cells and powerful, long-lasting batteries. The Environment and Sustainability cluster intersects with other research clusters including Material Science and Engineering, Robotics and Machine Intelligence and Data Science and Management in developing smart and green buildings and sustainable communities, understanding space weather and climate changes. NAE and NAS Grand Challenges and NSF Big Ideas within the scope of this cluster include “Solar Energy”, “Restore and Improve Urban Infrastructure”, “Access to Clean Water”, “Provide Energy from Fusion”, “Develop Carbon Sequestration Methods”, and “The Future of Work at the Human-Technology Frontier”, “Navigating the New Arctic” and “Windows on the Universe”. 1 of 2 next › 1 of 4 next ›"
  },
  {
    "id": "https://research.njit.edu/robotics-and-machine-intelligence",
    "title": "Robotics and Machine Intelligence | Research",
    "url": "https://research.njit.edu/robotics-and-machine-intelligence",
    "source": "research.njit.edu",
    "description": "This research cluster includes human machine interface, cyber-human systems, robotics: bioinspired, medical, social and industrial autonomous systems, intelligent infrastructure, artificial intelligence, machine learning, and augmented and virtual reality. Robotics and bioinspired autonomous systems are making a significant impact in the society in many areas including",
    "published": null,
    "tags": [],
    "text": "Admissions Undergraduate Admissions How We Evaluate Applicants How to Apply Admitted Students Graduate Admissions How to Apply Admitted Graduate Students Graduate FAQs International Students How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Apply Now Contact Admissions Undergraduate Admissions How We Evaluate Applicants How to Apply Admitted Students How We Evaluate Applicants How to Apply Admitted Students Graduate Admissions How to Apply Admitted Graduate Students Graduate FAQs How to Apply Admitted Graduate Students Graduate FAQs International Students How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Apply Now Contact Admissions Academics Degree Programs Undergraduate Studies Majors and Minors Academic Support & Advising Graduate Studies Graduate Degree Programs Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional & Corporate Education Pre-College Programs Degree Programs Undergraduate Studies Majors and Minors Academic Support & Advising Graduate Studies Graduate Degree Programs Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional & Corporate Education Pre-College Programs Research Office of the Senior Vice Provost for Research NJIT Strategic Research Plan Research Data and Publications About Us Centers and Laboratories For Researchers Funding Opportunities Active Programs and Grants Proposal Preparation Forms and Guide Policies Pre-Award Services Grant Management Guide Grant and Contract Accounting Post-Award and Closing Requirements Grant Management Software System Research Compliance Responsible Conduct of Research Institutional Review Board Institutional Biosafety Committee Laboratory Safety, Training and Compliance Animal Care and Use (IACUC) Export Control CITI Software OMB Uniform Guidance Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPP FAQs Intellectual Property (IP) Committee Members Commercial Enterprise Development Contact DIPP Educational Grant Support Resource Educational Programs Support and Centers Academic Achievement Program Agreements Funding Resources and Opportunities Proposal and IRB Templates For Students Undergraduate Research and Innovation Program For Industry and Collaborators Courtesy Appointments Distinguished Research Panels/Seminars Research News Research FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Office of the Senior Vice Provost for Research NJIT Strategic Research Plan Research Data and Publications About Us NJIT Strategic Research Plan Research Data and Publications About Us Centers and Laboratories For Researchers Funding Opportunities Active Programs and Grants Proposal Preparation Forms and Guide Policies Pre-Award Services Grant Management Guide Grant and Contract Accounting Post-Award and Closing Requirements Funding Opportunities Active Programs and Grants Proposal Preparation Forms and Guide Policies Pre-Award Services Grant Management Guide Grant and Contract Accounting Post-Award and Closing Requirements Grant Management Software System Research Compliance Responsible Conduct of Research Institutional Review Board Institutional Biosafety Committee Laboratory Safety, Training and Compliance Animal Care and Use (IACUC) Export Control CITI Software Responsible Conduct of Research Institutional Review Board Institutional Biosafety Committee Laboratory Safety, Training and Compliance Animal Care and Use (IACUC) Export Control CITI Software OMB Uniform Guidance Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPP FAQs Intellectual Property (IP) Committee Members Commercial Enterprise Development Contact DIPP Available Technologies For Inventors For Industry IPP FAQs Intellectual Property (IP) Committee Members Commercial Enterprise Development Contact DIPP Educational Grant Support Resource Educational Programs Support and Centers Academic Achievement Program Agreements Funding Resources and Opportunities Proposal and IRB Templates Educational Programs Support and Centers Academic Achievement Program Agreements Funding Resources and Opportunities Proposal and IRB Templates For Students Undergraduate Research and Innovation Program Undergraduate Research and Innovation Program For Industry and Collaborators Courtesy Appointments Distinguished Research Panels/Seminars Research News Research FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Research Staff Assignments Feedback/Comments Research/Technology Inquiries About Key Facts Rankings and Recognition Administration Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Visiting NJIT Maps and Directions Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Key Facts Rankings and Recognition Administration Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Visiting NJIT Maps and Directions Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Life at NJIT Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Health & Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Health & Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Athletics NJIT Highlanders NJIT Highlanders Apply now Undergraduate Students Transfer Students Graduate Students Continuing Education Undergraduate Students Transfer Students Graduate Students Continuing Education Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Moodle Jobs @ NJIT Admissions Academics Research About Life at NJIT Athletics I am a... Apply now Institutional Response on the Implementation of Recent Federal Executive Orders with Updates on Federally Funded Research Grants and Contracts Home Robotics and Machine Intelligence This research cluster includes human machine interface, cyber-human systems, robotics: bioinspired, medical, social and industrial autonomous systems, intelligent infrastructure, artificial intelligence, machine learning, and augmented and virtual reality. Robotics and bioinspired autonomous systems are making a significant impact in the society in many areas including rehabilitation, manufacturing, navigation and transportation, and medical and home-based care. Home Office of the Senior Vice Provost for Research For Researchers For Students Undergraduate Research and Innovation Program For Industry and Collaborators Intellectual Property and Commercialization NJIT Research Centers and Laboratories Faculty Awards Initiative National Academy of Inventors - NJIT Research FAQs Research News Contact Us The artificial intelligence and augmented/virtual reality applications have been evolving rapidly with the futuristic vision for new modes of automation, discoveries, social networking and even co-evolution of machine and human intelligence making important decisions in our daily life from finance to healthcare. The Robotics and Machine Intelligence cluster also interacts with other research clusters including Bioscience and Bioengineering, Environment and Sustainability, Material Science and Engineering and Data Science and Management in developing smart automation and navigation systems, smart healthcare information systems, intelligent adaptative and data-driven automations in additive manufacturing systems, and intelligent systems for almost every application from education and learning to smart cities and living-assist systems. NAE and NAS Grand Challenges and NSF Big Ideas within the scope of this cluster include “Advance Personalized Learning”, “Enhance Virtual Reality” “Restore and Improve Urban Infrastructure”, “Engineer the Tools of Scientific Discovery”, and “The Future of Work at the Human-Technology Frontier”, “Harnessing the Data Revolution”, “Growing Convergence Research” and “The Quantum Leap: Leading the Next Quantum Revolution”. 1 of 4 next ›"
  },
  {
    "id": "https://research.njit.edu/uri/undergraduate-research-and-innovation-uri-program",
    "title": "Undergraduate Research and Innovation (URI) Program | Undergraduate Research and Innovation",
    "url": "https://research.njit.edu/uri/undergraduate-research-and-innovation-uri-program",
    "source": "research.njit.edu",
    "description": "We encourage all undergraduate students to review various URI programs and opportunities to enhance their skills to become the future innovative leaders in our global society.",
    "published": null,
    "tags": [],
    "text": "Home Advisory Board Programs Student Seed Programs Archive - Seed Programs Summer Research Programs Archive - Summer Research Program Innovation Acceleration Student Seed Programs Archive - Seed Programs Archive - Seed Programs Summer Research Programs Archive - Summer Research Program Archive - Summer Research Program Innovation Acceleration Events & Resources News Donate Contact Us URI Phase-1 Student Seed Grants: $500 per project URI Phase-2 Student Seed Grants: $3,000 per project URI Student Seed Grant Program Tracks: Track-1 Technology/Product Development and Innovation Track-2: Application Based Research Information Session Hosted by URI External Advisory Board Members (Information Session on Proposal Writing, Review Criterion and Submission) September 24, 2025; 2.30 PM to 4.00 PM; Campus Center Ballroom A (Light refreshments will be served) RSVP Here Proposal Online Submission Deadline: October 22, 2025 Apply here: https://njit.infoready4.com/#research (Please log in using NJIT UCID) NJIT 2030 Strategic Plan emphasizes providing undergraduate students an outstanding education integrated with research and innovation experience to enable them to succeed and take leadership roles in the society. The Undergraduate Research and Innovation (URI) program has evolved as a significant part of the education and research experience at NJIT. The URI website http://centers.njit.edu/uri/ summarizes undergraduate research and innovation opportunities with information about resources and competitions. We are pleased to announce the Undergraduate Research and Innovation (URI) Student Seed Grant program. URI Phase-1 Student Seed Grants provide $500 per project to pursue preliminary research or demonstrate an initial proof-of-concept/prototypes. URI Phase-2 Student Seed Grants provide up to $3,000 per project to further pursue application-based research or develop a complete technology development prototype. Phase-2 proposals may be submitted by former Phase-1 Student Seed Grant winners who have completed Phase-1 work, as well as new students who have a research or product idea that has shown the preliminary proof of concept, market assessment or application-based research to establish the need, significance and basic approach. The student should prepare URI Student Phase-1 or Phase-2 Seed Grant proposals following the templates with format and guidelines. Funds can only be used to order project supplies and prototyping. They cannot be combined with any other indices. There will be a deadline to order. Any items not received and approved by the deadline will not be purchased. Shipping costs must be included in the total amount. All orders must be received by February 15, 2026. Any order not received by then will be canceled. All project proposals must be submitted by October 22, 2025. Awardees will have access to funds to start the project as early as early December and will formally present a progress report at the subsequent URI workshops. Each student team awardee is required to take a lab safety training (and a biosafety training, if applicable) if awarded a seed grant, you will be asked to upload documentation before receiving funds. Proposal Submission Deadlines Students working with an NJIT tenure / tenure track faculty member may submit Track-1 Technology/Product Development and Innovation or Track-2: Application Based Research proposals in the required format by October 22, 2025. Proposal Format Guidelines information are here and on the URI website. Submit the application via InfoReady using the link above by October 22, 2025. You must log-in using your UCID to access. You will need to have your research proposal ready to upload for final submission. Please save it as a pdf in the following format - Lastname_PhaseX_Title.The X should be replaced with a 1 or 2. Finalists selected for the URI workshop presentation will be announced in early November 2025. Finalists are required to present their project with a PowerPoint presentation to the External Advisory Board following the presentation format posted on the website at the URI Workshop on November 19, 2025 at the Campus Center Ballroom B from 2:00 PM to 4:30 PM. Presentation templates can be found here URI Board Members Brian Kiernan, Angel Investor, Executive VP and Chief Scientist (ret), InterDigital Communications Corp. ( https://www.linkedin.com/in/brian-kiernan-a5636b11/ ) Govi Rao, CEO, Phase Change Solutions, Co-Founder, Carbon Group Global ( https://www.linkedin.com/in/govirao/ ) Daniel Henderson, Serial Innovator and Entrepreneur, NJIT Board of Overseers, Joint Chief Executive Officer, Volobocce, LLC ( https://www.linkedin.com/in/daniel-a-henderson/ ) Marc Long, PhD, Vice President, Research & Development, MTF Biologics ( https://www.linkedin.com/in/marc-long-3bbb833/ ) Pallavi Madakasira, Managing Consultant, Eunomia Research & Consulting ( https://www.linkedin.com/in/pallavi-madakasira-3418aa/ ) Alfredo Matos, President and CEO, A Z Matos, LLC ( https://www.linkedin.com/in/alfredo-al-matos-bs-msee-mba-47abb627/ ) Peggy McHale, Principal, Pandi LLC ( https://www.linkedin.com/in/peggymchale/ ) Pete Mendonez, Jr., President & COO, PearlX ( https://www.linkedin.com/in/pete-mendonez-jr-26a11a13/ ) Liz Miller, President, Summit Place Financial Advisors, LLC ( https://www.linkedin.com/in/liz-miller-cfa-cfp-5100096/ ) Harry Moore, Jr., President, Gray Beard Solutions LLC graybeardsolutionsllc@gmail.com Manish Patel, CEO, TrickyWater LLC ( www.trickywater.com ) ( https://www.linkedin.com/in/manish-patel-innovate/ ) Sabbir Rangwala, President, Patience Consulting ( https://www.linkedin.com/in/sabbir-rangwala/ ) Shashi Patel, Manager – Engineering, PSEG ( https://www.linkedin.com/in/shashikant-patel-1073161b/ ) URI programs provide students opportunities to learn necessary and important skills to research and innovate to take a leadership role in the society. These programs are designed to help student develop vision and strategic planning skills to address current and forthcoming global challenges. As STEM initiative is now appropriately complemented with arts (called as STEAM) to effectively develop an engaging perspective in design and also understanding the socio-economic impact, the URI programs are interdisciplinary and available to students from all majors encouraging them to network and learn skills to understand diversity and teamwork through peer interactions. URI programs also allow students to understand current and future needs and challenges of high societal impact to find solutions to address them with new products, design or services in the global market. Ideas to find a plausible solution are naturally generated by human beings. However, the skills to develop a vision to transform those ideas into innovation for implementation in the real-world is learned and nurtured though carefully designed academic and research programs. URI programs provide students an environment to explore and research their ideas and to interact with real-world experts to understand roadmaps associated with research and design future technologies. Student can also learn how to understand market trends so that they can re-think their solutions and learn pathways towards developing a successful product, design or service. With innovative research, they can lead to new discoveries and enhancement of knowledge towards developing a productive foundation for future technologies."
  },
  {
    "id": "https://www.njit.edu/counseling/services",
    "title": "Services Available to Students | Counseling Center",
    "url": "https://www.njit.edu/counseling/services",
    "source": "www.njit.edu",
    "description": "Admissions Undergraduate Admissions Freshmen Transfers Admission Requirements High School Counselors How to Apply Admitted Students Graduate Admissions How to Apply Graduate FAQs Admitted Graduate Students International Students How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financia",
    "published": null,
    "tags": [],
    "text": "Admissions Undergraduate Admissions Freshmen Transfers Admission Requirements High School Counselors How to Apply Admitted Students Graduate Admissions How to Apply Graduate FAQs Admitted Graduate Students International Students How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Visiting/Non-Matriculated Students Dates and Deadlines Apply Now Contact Admissions Undergraduate Admissions Freshmen Transfers Admission Requirements High School Counselors How to Apply Admitted Students Freshmen Transfers Admission Requirements High School Counselors How to Apply Admitted Students Graduate Admissions How to Apply Graduate FAQs Admitted Graduate Students How to Apply Graduate FAQs Admitted Graduate Students International Students How to Apply Applying for a Visa How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Tuition & Costs Financial Aid Visiting/Non-Matriculated Students Dates and Deadlines Apply Now Contact Admissions Academics Degree Programs Undergraduate Studies Academic Support & Advising Graduate Studies Office of Graduate Studies Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional Development and Executive Education Pre-College Programs Degree Programs Undergraduate Studies Academic Support & Advising Academic Support & Advising Graduate Studies Office of Graduate Studies Online Graduate Studies Office of Graduate Studies Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional Development and Executive Education Pre-College Programs Research Office of the Senior Vice Provost for Research About Us Faculty Research Committees NJIT Strategic Research Plan Research Data and Publications For Researchers Courtesy Appointments Funding Opportunities Proposal Preparation Forms and Guide Pre-Award Services Post-Award and Closing Requirements Grant Management Research Compliance Grant and Contract Accounting For Students K-12 Resources For Industry and Collaborators Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPTLO FAQs Commercial Enterprise Development Contact IPTLO Undergraduate Research and Innovation Program NJIT Research Centers and Laboratories Research News Research FAQs Proposal Preparation and Submission FAQs Grant and Contract Award Set Up FAQs Subcontractor/Consulting Agreement FAQs Grant and Contract Accounting FAQs Purchase Requisition FAQs Personnel Requisition FAQs Research Compliance FAQ Responsible Conduct FAQs Institutional Review Board FAQs Institutional Biosafety Committee (IBC) FAQs Institutional Animal Care and Use FAQs Export Control FAQs Conflict of Interest/Financial Conflict of Interest FAQs Streamlyne FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Office of the Senior Vice Provost for Research About Us Faculty Research Committees NJIT Strategic Research Plan Research Data and Publications About Us Faculty Research Committees NJIT Strategic Research Plan Research Data and Publications For Researchers Courtesy Appointments Funding Opportunities Proposal Preparation Forms and Guide Pre-Award Services Post-Award and Closing Requirements Grant Management Research Compliance Grant and Contract Accounting Courtesy Appointments Funding Opportunities Proposal Preparation Forms and Guide Pre-Award Services Post-Award and Closing Requirements Grant Management Research Compliance Grant and Contract Accounting For Students K-12 Resources K-12 Resources For Industry and Collaborators Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPTLO FAQs Commercial Enterprise Development Contact IPTLO Available Technologies For Inventors For Industry IPTLO FAQs Commercial Enterprise Development Contact IPTLO Undergraduate Research and Innovation Program NJIT Research Centers and Laboratories Research News Research FAQs Proposal Preparation and Submission FAQs Grant and Contract Award Set Up FAQs Subcontractor/Consulting Agreement FAQs Grant and Contract Accounting FAQs Purchase Requisition FAQs Personnel Requisition FAQs Research Compliance FAQ Responsible Conduct FAQs Institutional Review Board FAQs Institutional Biosafety Committee (IBC) FAQs Institutional Animal Care and Use FAQs Export Control FAQs Conflict of Interest/Financial Conflict of Interest FAQs Streamlyne FAQs Proposal Preparation and Submission FAQs Grant and Contract Award Set Up FAQs Subcontractor/Consulting Agreement FAQs Grant and Contract Accounting FAQs Purchase Requisition FAQs Personnel Requisition FAQs Research Compliance FAQ Responsible Conduct FAQs Institutional Review Board FAQs Institutional Biosafety Committee (IBC) FAQs Institutional Animal Care and Use FAQs Export Control FAQs Conflict of Interest/Financial Conflict of Interest FAQs Streamlyne FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Research Staff Assignments Feedback/Comments Research/Technology Inquiries About NJIT Key Facts Rankings and Recognition Administration Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Visiting NJIT Campus & Parking Maps Maps & Directions Virtual Tour Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Key Facts Rankings and Recognition Rankings and Recognition Administration Senior Administration Administrative Departments Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Our Mission and Values Alma Maters Visiting NJIT Campus & Parking Maps Maps & Directions Virtual Tour Public Transportation to Campus Local Accommodations About Newark and New York City Campus & Parking Maps Maps & Directions Virtual Tour Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Life at NJIT Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Office of Student Life Health & Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Office of Student Life Health & Safety Student Health Services Counseling and Psychological Services Public Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Athletics NJIT Highlanders NJIT Highlanders Apply now Undergraduate Students Transfer Students Graduate Students Continuing Education Undergraduate Students Transfer Students Graduate Students Continuing Education Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Canvas Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Canvas Jobs @ NJIT Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Canvas Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Canvas Jobs @ NJIT Admissions Academics Research About Life at NJIT Athletics I am a... Apply now Home Services Available to Students Home About Us Appointments Our Services Group Therapy and Support Groups Group Therapy and Support Groups Mantra Health-Mental Health & Wellness Uwill-Teletherapy Peer Wellness Coaching Our Staff Get Help 24/7 Coping with Tragedy Sexual Assault Response Counseling and Mental Health Related Information Psychological Counseling Confidential psychological counseling, short-term psychotherapy, and crisis intervention assist students with emotional, social, or family concerns, developmental transitions, or other stresses that can occur during their college years. Counseling services can also assist you if you are concerned about these issues for a family member or friend. Many students benefit from counseling services at some time during their undergraduate and graduate college careers. Under some circumstances, for the small number of students needing medication to supplement counseling or psychotherapy, a part-time psychiatrist may also be available. Mantra Health NJIT has partnered with digital mental health provider Mantra Health to bring students access to free, high-quality mental health support. The Care Hub is an all-in-one platform where students can access free virtual services including self care, therapy, in-the-moment emotional wellness support, 24/7 crisis and more. Visit Mantra Health's Care Hub and use your school email address to set up your account. It's free, easy, and includes care navigation support. Sign up today Uwill With the generous support of the New Jersey Office of the Secretary of Higher Education, NJIT is pleased to partner with Uwill to offer all currently enrolled NJIT students free and unlimited teletherapy with a licensed mental health professional. This program is funded through Spring 2025. Students can register here and book their first session in just minutes using your NJIT email address. Academic Support Academic support counseling can help students set priorities, organize their time, manage stress, develop study and test-taking skills, and other coping strategies to meet their academic goals. Addiction Counseling Services and Referral For every person coping with, experiencing, or dealing with an addiction- whether it is dependency on drugs, alcohol, food, compulsive spending, gambling, sex, or an Internet addiction- at least six (6) other people in their lives can be directly affected. Without treatment intervention, substance, and behavioral addictions can persist even with the knowledge of negative health, academic, and social consequences. The addiction specialist can assist you in sorting out any questions or concerns that you may have about your addictive behaviors or someone else's. Confidential services include assessment, individual counseling, education, and referral to off-campus services when needed. Cross-Cultural/Multicultural Counseling NJIT is a university rich in cultural diversity and ranked 10th among national universities for campus diversity by U.S.News. The student body includes individuals from countries throughout the world as well as US citizens and permanent residents from a large number of racial, ethnic, religious, and cultural groups. C-CAPS staff is sensitive to cultural differences and any concerns that may arise. We strive to work sensitively with you and provide culturally appropriate treatment and services. LGBTQIA+ Services College is a time that many students begin to openly explore their sexual identity and discover and challenge their own beliefs and attitudes around sexual orientation and gender. For students searching for a safe, confidential place to explore questions, concerns, and traditional beliefs around sexual orientation sensitive and highly trained professionals will help you to address and examine these issues. Referral Services For more comprehensive or longer-term care, off-campus services may be needed. Students may also need information about off-campus resources for family or friends. We assist with referrals for psychotherapy, couple or family therapy, psychiatric services, alcohol/drug rehabilitation, etc. Most off-campus providers charge a fee, but some have low-fee options for those who lack insurance or have limited income. Also, self-help programs may be recommended to supplement C-CAPS services. Self-help programs are usually free."
  },
  {
    "id": "https://www.njit.edu/tlc/facilities",
    "title": "Additional Tutoring Centers | The Learning Center",
    "url": "https://www.njit.edu/tlc/facilities",
    "source": "www.njit.edu",
    "description": "Admissions Undergraduate Admissions Freshmen Transfers Admission Requirements High School Counselors How to Apply Admitted Students Graduate Admissions How to Apply Graduate FAQs Admitted Graduate Students International Students How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financia",
    "published": null,
    "tags": [],
    "text": "Admissions Undergraduate Admissions Freshmen Transfers Admission Requirements High School Counselors How to Apply Admitted Students Graduate Admissions How to Apply Graduate FAQs Admitted Graduate Students International Students How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Visiting/Non-Matriculated Students Dates and Deadlines Apply Now Contact Admissions Undergraduate Admissions Freshmen Transfers Admission Requirements High School Counselors How to Apply Admitted Students Freshmen Transfers Admission Requirements High School Counselors How to Apply Admitted Students Graduate Admissions How to Apply Graduate FAQs Admitted Graduate Students How to Apply Graduate FAQs Admitted Graduate Students International Students How to Apply Applying for a Visa How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Tuition & Costs Financial Aid Visiting/Non-Matriculated Students Dates and Deadlines Apply Now Contact Admissions Academics Degree Programs Undergraduate Studies Academic Support & Advising Graduate Studies Office of Graduate Studies Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional Development and Executive Education Pre-College Programs Degree Programs Undergraduate Studies Academic Support & Advising Academic Support & Advising Graduate Studies Office of Graduate Studies Online Graduate Studies Office of Graduate Studies Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional Development and Executive Education Pre-College Programs Research Office of the Senior Vice Provost for Research About Us Faculty Research Committees NJIT Strategic Research Plan Research Data and Publications For Researchers Courtesy Appointments Funding Opportunities Proposal Preparation Forms and Guide Pre-Award Services Post-Award and Closing Requirements Grant Management Research Compliance Grant and Contract Accounting For Students K-12 Resources For Industry and Collaborators Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPTLO FAQs Commercial Enterprise Development Contact IPTLO Undergraduate Research and Innovation Program NJIT Research Centers and Laboratories Research News Research FAQs Proposal Preparation and Submission FAQs Grant and Contract Award Set Up FAQs Subcontractor/Consulting Agreement FAQs Grant and Contract Accounting FAQs Purchase Requisition FAQs Personnel Requisition FAQs Research Compliance FAQ Responsible Conduct FAQs Institutional Review Board FAQs Institutional Biosafety Committee (IBC) FAQs Institutional Animal Care and Use FAQs Export Control FAQs Conflict of Interest/Financial Conflict of Interest FAQs Streamlyne FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Office of the Senior Vice Provost for Research About Us Faculty Research Committees NJIT Strategic Research Plan Research Data and Publications About Us Faculty Research Committees NJIT Strategic Research Plan Research Data and Publications For Researchers Courtesy Appointments Funding Opportunities Proposal Preparation Forms and Guide Pre-Award Services Post-Award and Closing Requirements Grant Management Research Compliance Grant and Contract Accounting Courtesy Appointments Funding Opportunities Proposal Preparation Forms and Guide Pre-Award Services Post-Award and Closing Requirements Grant Management Research Compliance Grant and Contract Accounting For Students K-12 Resources K-12 Resources For Industry and Collaborators Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPTLO FAQs Commercial Enterprise Development Contact IPTLO Available Technologies For Inventors For Industry IPTLO FAQs Commercial Enterprise Development Contact IPTLO Undergraduate Research and Innovation Program NJIT Research Centers and Laboratories Research News Research FAQs Proposal Preparation and Submission FAQs Grant and Contract Award Set Up FAQs Subcontractor/Consulting Agreement FAQs Grant and Contract Accounting FAQs Purchase Requisition FAQs Personnel Requisition FAQs Research Compliance FAQ Responsible Conduct FAQs Institutional Review Board FAQs Institutional Biosafety Committee (IBC) FAQs Institutional Animal Care and Use FAQs Export Control FAQs Conflict of Interest/Financial Conflict of Interest FAQs Streamlyne FAQs Proposal Preparation and Submission FAQs Grant and Contract Award Set Up FAQs Subcontractor/Consulting Agreement FAQs Grant and Contract Accounting FAQs Purchase Requisition FAQs Personnel Requisition FAQs Research Compliance FAQ Responsible Conduct FAQs Institutional Review Board FAQs Institutional Biosafety Committee (IBC) FAQs Institutional Animal Care and Use FAQs Export Control FAQs Conflict of Interest/Financial Conflict of Interest FAQs Streamlyne FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Research Staff Assignments Feedback/Comments Research/Technology Inquiries About NJIT Key Facts Rankings and Recognition Administration Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Visiting NJIT Campus & Parking Maps Maps & Directions Virtual Tour Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Key Facts Rankings and Recognition Rankings and Recognition Administration Senior Administration Administrative Departments Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Our Mission and Values Alma Maters Visiting NJIT Campus & Parking Maps Maps & Directions Virtual Tour Public Transportation to Campus Local Accommodations About Newark and New York City Campus & Parking Maps Maps & Directions Virtual Tour Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Life at NJIT Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Office of Student Life Health & Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Office of Student Life Health & Safety Student Health Services Counseling and Psychological Services Public Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Athletics NJIT Highlanders NJIT Highlanders Apply now Undergraduate Students Transfer Students Graduate Students Continuing Education Undergraduate Students Transfer Students Graduate Students Continuing Education Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Canvas Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Canvas Jobs @ NJIT Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Canvas Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Canvas Jobs @ NJIT Admissions Academics Research About Life at NJIT Athletics I am a... Apply now Home Additional Tutoring Centers Home Services Meet the Staff Tutoring Information Workshops Additional Tutoring Centers Information for Student Athletes FAQs Student Employment Contact Us Located in CKB G11 For more information and schedule, click here Located in CKB G12 For more information and schedule, click here Located in CKB G17 For more information and schedule, click here. Located in GITC 3700 For more information and schedule, click here Located in CKB G12 For more information and schedule, click here Located in CAB 3028 For more information and a link to schedule, click here For other resources:"
  }
]