[
  {
    "id": "",
    "title": "New Jersey Institute of Technology |",
    "url": "https://www.njit.edu/",
    "source": "www.njit.edu",
    "description": "New Jersey Institute of Technology is the state's public polytechnic university and a leader in STEM education, research, economic development, and service.",
    "retrieved": null,
    "tags": [
      "research",
      "academic",
      "professional",
      "job",
      "study abroad",
      "international",
      "financial",
      "grant",
      "funding",
      "health",
      "study",
      "education",
      "career",
      "lab",
      "science",
      "computer",
      "internship",
      "visa",
      "tuition",
      "counseling",
      "fitness",
      "sports",
      "recreation",
      "community",
      "housing",
      "engineering",
      "technology",
      "innovation",
      "design"
    ],
    "text": "Close Nav Admissions Undergraduate Admissions Freshmen Transfers Admission Requirements High School Counselors How to Apply Admitted Students Graduate Admissions How to Apply Graduate FAQs Admitted Graduate Students International Students How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Visiting/Non-Matriculated Students Dates and Deadlines Apply Now Contact Admissions Undergraduate Admissions Freshmen Transfers Admission Requirements High School Counselors How to Apply Admitted Students Freshmen Transfers Admission Requirements High School Counselors How to Apply Admitted Students Graduate Admissions How to Apply Graduate FAQs Admitted Graduate Students How to Apply Graduate FAQs Admitted Graduate Students International Students How to Apply Applying for a Visa How to Apply Applying for a Visa Tuition & Aid Tuition & Costs Financial Aid Tuition & Costs Financial Aid Visiting/Non-Matriculated Students Dates and Deadlines Apply Now Contact Admissions Academics Degree Programs Undergraduate Studies Academic Support & Advising Graduate Studies Office of Graduate Studies Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional Development and Executive Education Pre-College Programs Degree Programs Undergraduate Studies Academic Support & Advising Academic Support & Advising Graduate Studies Office of Graduate Studies Online Graduate Studies Office of Graduate Studies Online Graduate Studies Colleges and Departments Beyond the Classroom Study Abroad Research Internships & Co-ops Community Service Student Leadership Study Abroad Research Internships & Co-ops Community Service Student Leadership Van Houten Library Architecture Library Professional Development and Executive Education Pre-College Programs Research Office of the Senior Vice Provost for Research About Us Faculty Research Committees NJIT Strategic Research Plan Research Data and Publications For Researchers Courtesy Appointments Funding Opportunities Proposal Preparation Forms and Guide Pre-Award Services Post-Award and Closing Requirements Grant Management Research Compliance Grant and Contract Accounting For Students K-12 Resources For Industry and Collaborators Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPTLO FAQs Commercial Enterprise Development Contact IPTLO Undergraduate Research and Innovation Program NJIT Research Centers and Laboratories Research News Research FAQs Proposal Preparation and Submission FAQs Grant and Contract Award Set Up FAQs Subcontractor/Consulting Agreement FAQs Grant and Contract Accounting FAQs Purchase Requisition FAQs Personnel Requisition FAQs Research Compliance FAQ Responsible Conduct FAQs Institutional Review Board FAQs Institutional Biosafety Committee (IBC) FAQs Institutional Animal Care and Use FAQs Export Control FAQs Conflict of Interest/Financial Conflict of Interest FAQs Streamlyne FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Office of the Senior Vice Provost for Research About Us Faculty Research Committees NJIT Strategic Research Plan Research Data and Publications About Us Faculty Research Committees NJIT Strategic Research Plan Research Data and Publications For Researchers Courtesy Appointments Funding Opportunities Proposal Preparation Forms and Guide Pre-Award Services Post-Award and Closing Requirements Grant Management Research Compliance Grant and Contract Accounting Courtesy Appointments Funding Opportunities Proposal Preparation Forms and Guide Pre-Award Services Post-Award and Closing Requirements Grant Management Research Compliance Grant and Contract Accounting For Students K-12 Resources K-12 Resources For Industry and Collaborators Intellectual Property and Commercialization Available Technologies For Inventors For Industry IPTLO FAQs Commercial Enterprise Development Contact IPTLO Available Technologies For Inventors For Industry IPTLO FAQs Commercial Enterprise Development Contact IPTLO Undergraduate Research and Innovation Program NJIT Research Centers and Laboratories Research News Research FAQs Proposal Preparation and Submission FAQs Grant and Contract Award Set Up FAQs Subcontractor/Consulting Agreement FAQs Grant and Contract Accounting FAQs Purchase Requisition FAQs Personnel Requisition FAQs Research Compliance FAQ Responsible Conduct FAQs Institutional Review Board FAQs Institutional Biosafety Committee (IBC) FAQs Institutional Animal Care and Use FAQs Export Control FAQs Conflict of Interest/Financial Conflict of Interest FAQs Streamlyne FAQs Proposal Preparation and Submission FAQs Grant and Contract Award Set Up FAQs Subcontractor/Consulting Agreement FAQs Grant and Contract Accounting FAQs Purchase Requisition FAQs Personnel Requisition FAQs Research Compliance FAQ Responsible Conduct FAQs Institutional Review Board FAQs Institutional Biosafety Committee (IBC) FAQs Institutional Animal Care and Use FAQs Export Control FAQs Conflict of Interest/Financial Conflict of Interest FAQs Streamlyne FAQs Contact Us Research Staff Assignments Feedback/Comments Research/Technology Inquiries Research Staff Assignments Feedback/Comments Research/Technology Inquiries About NJIT Key Facts Rankings and Recognition Administration Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Visiting NJIT Campus & Parking Maps Maps & Directions Virtual Tour Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Key Facts Rankings and Recognition Rankings and Recognition Administration Senior Administration Administrative Departments Senior Administration Administrative Departments History of NJIT Our Mission and Values Alma Maters Our Mission and Values Alma Maters Visiting NJIT Campus & Parking Maps Maps & Directions Virtual Tour Public Transportation to Campus Local Accommodations About Newark and New York City Campus & Parking Maps Maps & Directions Virtual Tour Public Transportation to Campus Local Accommodations About Newark and New York City News Contact Us Life at NJIT Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Office of Student Life Health & Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Activities & Organizations Hispanic and Latinx Leadership Council Inclusive Excellence Career Center Campus Center Housing & Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining On-Campus Housing On-Campus Dining Off-Campus Housing Off-Campus Dining Office of Student Life Health & Safety Student Health Services Counseling and Psychological Services Public Safety Student Health Services Counseling and Psychological Services Public Safety Recreation & Fitness Gyms & Facilities Intramural Sports Gyms & Facilities Intramural Sports Transportation & Parking On & Around Campus Athletics NJIT Highlanders NJIT Highlanders Apply now Undergraduate Students Transfer Students Graduate Students Continuing Education Undergraduate Students Transfer Students Graduate Students Continuing Education Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Canvas Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Canvas Jobs @ NJIT Search Alumni Giving MyNJIT Login Tools Calendars Campus Directory A-Z Site Index Webmail Canvas Jobs @ NJIT Calendars Campus Directory A-Z Site Index Webmail Canvas Jobs @ NJIT Admissions Academics Research About Life at NJIT Athletics I am a... Apply now Play video Play video Close 5 Star The only 5-star (top rating) public university in New Jersey. Top 50 Public National University #1 Public University for Alumni Earnings, Economic Mobility, and Academic Profile Visit NJIT at Fall Open House on October 12! #1 Public University for Alumni Earnings, Economic Mobility, and Academic Profile Top 50 Public National University Visit NJIT at Fall Open House on October 12! Top 50 NATIONALLY for Entrepreneurial Programs Top 50 Public National University Visit NJIT at Fall Open House on October 12! #1 Public University for Alumni Earnings, Economic Mobility, and Academic Profile Top 50 Public National University Visit NJIT at Fall Open House on October 12! #1 Public University for Alumni Earnings, Economic Mobility, and Academic Profile Top 50 Public National University Visit NJIT at Fall Open House on October 12! #1 Public University for Alumni Earnings, Economic Mobility, and Academic Profile Top 50 Public National University Visit NJIT at Fall Open House on October 12! #1 Public University for Alumni Earnings, Economic Mobility, and Academic Profile Top 50 Public National University Visit NJIT at Fall Open House on October 12! Meet our Students NJIT is a top 10 school for return on investment “ When I first came to NJIT I enjoyed the Student Activities Council because I wanted to make college fun! NJIT is really a great college. Enjoy your time here. ” Sagar Solank, Class of 2019 “I could have never imagined the opportunities that have come my way without NJIT.” Catrina Alexandre, Class of 2019 “NJIT is the place that helped to develop the foundation upon which I stand today.” Carla Jones, Class of 1994 Meet our Architecture & Design Students NJIT is a top 10 school for return on investment “At NJIT I've had the pleasure to study and work among commendable faculty and students.” Albina Gode, Class of 2015 “Hillier College has taught me the essence of interior design.” Alexandra DePalo “Hiller College has provided me with so many opportunities to better myself and learn more about Interior Design.” Victoria Lynn Birritteri Meet our Computing Students NJIT is a top 10 school for return on investment “If you ever need advice or help, I would be willing to bet you could find it at NJIT.” Angela Vitaletti, Class of 2018 “I love this major. Merging biology with computer science will help me become a doctor.” Chandani Patel, Class of 2019 “The computer science program offers a great value.” Zhe He, Class of 2014 Meet our Engineering Students NJIT is a top 10 school for return on investment “I’m really grateful to the Honors College for giving me the chance to do research.” Margaret Christian, Class of 2014 “Living on campus has really allowed me to develop a cool community of friends.” Jeremy Bedient, Class of 2021 “I credit my NJIT degree and connections with helping me land three job offers within two weeks of graduating.” Bodhi Chaudhuri, Class of 2000 Meet our Humanities & Liberal Arts Students NJIT is a top 10 school for return on investment “NJIT's high-quality education is preparing me for the challenges that I will face in the future.” Victor Pujades, Class of 2020 “My MSPTC degree made a huge impact on the opportunities I've received after starting my own online business.” Michelle Saeia, Class of 2016 “Being in such a flexible major gave me the opportunity to explore my interests.” Waydon Destin, Class of 2015 Meet our Math & Science Students NJIT is a top 10 school for return on investment “The Biochemistry program at NJIT has thoroughly prepared me for my STEM career.” Helene Brochon, Class of 2020 “As a biology major, NJIT has opened up a world of possibilities and opportunities for me to pursue my goal of becoming a pharmacist. ” Ines Nzameyo, Class of 2019 “I decided to come to NJIT as it has one of only a few accredited programs in New Jersey for actuarial science. ” Daniel Newton, Class of 2020 Meet our Business Students NJIT is a top 10 school for return on investment “Martin Tuchman School of Management provides a continuous support system that extends beyond a degree program and prioritizes close relationships, making each student a Highlander.” Anousha Raina, Class of 2023 “Pursuing a BS in Business Management and my MBA at MTSM has prepared me for a thriving career in a tech-savvy world.” Travis Forbes, Class of 2024 “The MSM-BA program provided the perfect blend of management and analytical courses, enhancing my profile for success in the industry.” Divya Tekani, Class of 2023 Learn about NJIT... MAJORS & DEGREES COST VISIT HOW TO APPLY REQUEST INFO MAP Join the Conversation: #NJIT Subscribe to our YouTube channel today. youtube.com/njit Like us on Facebook! @NewJerseyInstituteOf Technology Featured Events Sustainability Fair 2025 Fall Open House I 2025 Homecoming 2025 Fall Open House II 2025 Fill out an online application today! Download a brochure and learn about NJIT Schedule a visit to campus"
  },
  {
    "id": "campuslabs-11704042",
    "title": "It' time for GiveAway",
    "url": "https://njit.campuslabs.com/engage/event/11704042",
    "source": "njit.campuslabs.com",
    "description": "stop by the BME department on Fenster Hall 6 floor for a chance to win. All you need to do is enter your name to win",
    "retrieved": "2025-09-28T12:00:00+00:00",
    "tags": [
      "biomedical engineering department",
      "campuslabs",
      "events",
      "social"
    ],
    "text": "It' time for GiveAway | Biomedical Engineering Department | FENSTER HALL 6 FLOOR, right outside elevator | Starts: 2025-09-28T12:00:00+00:00 | Ends: 2025-09-29T03:45:00+00:00 | stop by the BME department on Fenster Hall 6 floor for a chance to win. All you need to do is enter your name to win",
    "image": "https://se-images.campuslabs.com/clink/images/d818cd88-4f36-4d1f-865f-924ce42f2ac2538eb7a6-96ad-4f2d-ab53-307034a146af.png",
    "organization": "Biomedical Engineering Department",
    "location": "FENSTER HALL 6 FLOOR, right outside elevator",
    "startsOn": "2025-09-28T12:00:00+00:00",
    "endsOn": "2025-09-29T03:45:00+00:00"
  },
  {
    "id": "campuslabs-11696943",
    "title": "IGDA Fall Game Jam Work Day 2",
    "url": "https://njit.campuslabs.com/engage/event/11696943",
    "source": "njit.campuslabs.com",
    "description": "Work on your Game Jam with us!",
    "retrieved": "2025-09-28T16:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "general",
      "international game developers association",
      "meeting",
      "recreational",
      "social"
    ],
    "text": "IGDA Fall Game Jam Work Day 2 | International Game Developers Association | GITC 3700 | Starts: 2025-09-28T16:00:00+00:00 | Ends: 2025-09-28T22:00:00+00:00 | Work on your Game Jam with us!",
    "image": "https://se-images.campuslabs.com/clink/images/af3dabc7-9d9a-42f1-9e58-f3dc9da653e843cce535-695f-4fc5-8b9d-35a4058bc56c.png",
    "organization": "International Game Developers Association",
    "location": "GITC 3700",
    "startsOn": "2025-09-28T16:00:00+00:00",
    "endsOn": "2025-09-28T22:00:00+00:00"
  },
  {
    "id": "campuslabs-11701103",
    "title": "Women's Soccer vs UAlbany",
    "url": "https://njit.campuslabs.com/engage/event/11701103",
    "source": "njit.campuslabs.com",
    "description": "Women's Soccer faces UAlbany in some Sunday action!",
    "retrieved": "2025-09-28T17:00:00+00:00",
    "tags": [
      "athletics",
      "campuslabs",
      "events"
    ],
    "text": "Women's Soccer vs UAlbany | Athletics | Lubetkin Field at Mal Simon Stadium | Starts: 2025-09-28T17:00:00+00:00 | Ends: 2025-09-28T19:00:00+00:00 | Women's Soccer faces UAlbany in some Sunday action!",
    "image": "https://se-images.campuslabs.com/clink/images/57510788-f50d-4aeb-8f8c-8d9888bb995b45003acf-39bb-4e17-b773-908888358286.png",
    "organization": "Athletics",
    "location": "Lubetkin Field at Mal Simon Stadium",
    "startsOn": "2025-09-28T17:00:00+00:00",
    "endsOn": "2025-09-28T19:00:00+00:00"
  },
  {
    "id": "campuslabs-11654935",
    "title": "Ready@20 ",
    "url": "https://njit.campuslabs.com/engage/event/11654935",
    "source": "njit.campuslabs.com",
    "description": "Ready@20 Sunday Service A campus church service made for YOU. Come experience powerful worship, real talk, and a community that feels like family. Whether you’re strong in faith or just curious, this is the place to recharge and get inspired for the week ahead. On campus | Sundays @ 3PM",
    "retrieved": "2025-09-28T19:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "first love njit",
      "general",
      "spirituality"
    ],
    "text": "Ready@20 | First Love NJIT | Atrium | Starts: 2025-09-28T19:00:00+00:00 | Ends: 2025-09-28T21:00:00+00:00 | Ready@20 Sunday Service A campus church service made for YOU. Come experience powerful worship, real talk, and a community that feels like family. Whether you’re strong in faith or just curious, this is the place to recharge and get inspired for the week ahead. On campus | Sundays @ 3PM",
    "image": "https://se-images.campuslabs.com/clink/images/525b77b8-be7f-4e87-b404-ea70f2c3db3f7f257c06-e494-4aad-b21f-931257f67278.png",
    "organization": "First Love NJIT",
    "location": "Atrium ",
    "startsOn": "2025-09-28T19:00:00+00:00",
    "endsOn": "2025-09-28T21:00:00+00:00"
  },
  {
    "id": "campuslabs-11689493",
    "title": "John 3:16",
    "url": "https://njit.campuslabs.com/engage/event/11689493",
    "source": "njit.campuslabs.com",
    "description": "✨ John 3:16 – Sunday Service✨ This Sunday, join us for John 3:16, a powerful youth service centered on God’s love for us. Together, we’ll dive into the meaning of one of the most well-known verses in the Bible—reminding us that His love is personal, unconditional, and life-changing. Expect uplifting",
    "retrieved": "2025-09-28T19:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "first love njit",
      "general",
      "meeting",
      "spirituality"
    ],
    "text": "John 3:16 | First Love NJIT | NJIT Campus Center Atrium | Starts: 2025-09-28T19:00:00+00:00 | Ends: 2025-09-28T21:00:00+00:00 | ✨ John 3:16 – Sunday Service✨ This Sunday, join us for John 3:16, a powerful youth service centered on God’s love for us. Together, we’ll dive into the meaning of one of the most well-known verses in the Bible—reminding us that His love is personal, unconditional, and life-changing. Expect uplifting worship, real conversations, and a message that speaks directly to your journey as a student . Whether you’re new to church or already part of the family, this is the perfect space to connect, grow, and be inspired. 📖 “For God so loved the world that He gave His one and only Son…”",
    "image": "https://se-images.campuslabs.com/clink/images/43cd9cbb-a655-42e0-bede-cf76e6e77aa2753ebf92-2b3c-4891-91fc-47a22b09cb02.png",
    "organization": "First Love NJIT",
    "location": "NJIT Campus Center Atrium ",
    "startsOn": "2025-09-28T19:00:00+00:00",
    "endsOn": "2025-09-28T21:00:00+00:00"
  },
  {
    "id": "campuslabs-11701055",
    "title": "Women's Volleyball vs New Hampshire",
    "url": "https://njit.campuslabs.com/engage/event/11701055",
    "source": "njit.campuslabs.com",
    "description": "Women's Volleyball ends their four-game homestand when they face New Hampshire.",
    "retrieved": "2025-09-28T19:30:00+00:00",
    "tags": [
      "athletics",
      "campuslabs",
      "events"
    ],
    "text": "Women's Volleyball vs New Hampshire | Athletics | Joel and Diane Bloom Wellness and Events Center | Starts: 2025-09-28T19:30:00+00:00 | Ends: 2025-10-05T21:30:00+00:00 | Women's Volleyball ends their four-game homestand when they face New Hampshire.",
    "image": "https://se-images.campuslabs.com/clink/images/ca88cb8b-969d-4e61-b438-6e4abd579c6dabffbec4-fc71-4825-b224-a18ae6843b50.png",
    "organization": "Athletics",
    "location": "Joel and Diane Bloom Wellness and Events Center",
    "startsOn": "2025-09-28T19:30:00+00:00",
    "endsOn": "2025-10-05T21:30:00+00:00"
  },
  {
    "id": "campuslabs-11660689",
    "title": "Study Sync",
    "url": "https://njit.campuslabs.com/engage/event/11660689",
    "source": "njit.campuslabs.com",
    "description": "Need somewhere to study alone? Need somewhere to study with friends? Need late-night tutoring in Math, Chemistry, Physics, and CS? HEAD ON OVER TO STUDY SYNC! (Open to both residents and commuters) Location: Redwood Hall - Glass Lounge When?: Every Sunday, Monday, and Tuesday night from 7pm - 10pm",
    "retrieved": "2025-09-28T23:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "general",
      "student senate",
      "thoughtfullearning"
    ],
    "text": "Study Sync | Student Senate | Redwood Hall - Glass Lounge | Starts: 2025-09-28T23:00:00+00:00 | Ends: 2025-09-29T02:00:00+00:00 | Need somewhere to study alone? Need somewhere to study with friends? Need late-night tutoring in Math, Chemistry, Physics, and CS? HEAD ON OVER TO STUDY SYNC! (Open to both residents and commuters) Location: Redwood Hall - Glass Lounge When?: Every Sunday, Monday, and Tuesday night from 7pm - 10pm",
    "image": "https://se-images.campuslabs.com/clink/images/4d320805-aa9a-4314-b0f8-96e3318f642a1329b20c-9778-4177-a689-e88600bbd61a.png",
    "organization": "Student Senate",
    "location": "Redwood Hall - Glass Lounge",
    "startsOn": "2025-09-28T23:00:00+00:00",
    "endsOn": "2025-09-29T02:00:00+00:00"
  },
  {
    "id": "campuslabs-11634458",
    "title": "Ramen Night!",
    "url": "https://njit.campuslabs.com/engage/event/11634458",
    "source": "njit.campuslabs.com",
    "description": "Residents can cook up their ramen by choosing from a variety of ramen flavors, prepare their bowls, and then relax in the lounge to enjoy food, games, and conversation",
    "retrieved": "2025-09-29T01:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "laurel hall",
      "social"
    ],
    "text": "Ramen Night! | Laurel Hall | Laurel Hall Game Room Lounge | Starts: 2025-09-29T01:00:00+00:00 | Ends: 2025-09-29T02:00:00+00:00 | Residents can cook up their ramen by choosing from a variety of ramen flavors, prepare their bowls, and then relax in the lounge to enjoy food, games, and conversation",
    "image": "https://se-images.campuslabs.com/clink/images/43977387-63bb-45e5-a51f-2002a2540a3619eb88ce-360e-40b1-80b0-ea6eb9c64b52.png",
    "organization": "Laurel Hall",
    "location": "Laurel Hall Game Room Lounge",
    "startsOn": "2025-09-29T01:00:00+00:00",
    "endsOn": "2025-09-29T02:00:00+00:00"
  },
  {
    "id": "campuslabs-11625956",
    "title": "Women's Bible Study - FA25",
    "url": "https://njit.campuslabs.com/engage/event/11625956",
    "source": "njit.campuslabs.com",
    "description": "Join the girls for a time of fellowship and reading about the women of the Bible!",
    "retrieved": "2025-09-29T14:15:00+00:00",
    "tags": [
      "campuslabs",
      "cru",
      "events",
      "spirituality"
    ],
    "text": "Women's Bible Study - FA25 | Cru | CC 215 | Starts: 2025-09-29T14:15:00+00:00 | Ends: 2025-09-29T15:45:00+00:00 | Join the girls for a time of fellowship and reading about the women of the Bible!",
    "image": "https://se-images.campuslabs.com/clink/images/8508706b-3ec0-47aa-82d2-5c734521dbcc09603476-f2f1-427a-b13c-482f2030f880.png",
    "organization": "Cru",
    "location": "CC 215",
    "startsOn": "2025-09-29T14:15:00+00:00",
    "endsOn": "2025-09-29T15:45:00+00:00"
  },
  {
    "id": "campuslabs-11667378",
    "title": "IIDA September Lunch & Learn",
    "url": "https://njit.campuslabs.com/engage/event/11667378",
    "source": "njit.campuslabs.com",
    "description": "Join us for a Lunch and Learn with Office Works and Teknion!",
    "retrieved": "2025-09-29T15:30:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "international interior design association",
      "thoughtfullearning"
    ],
    "text": "IIDA September Lunch & Learn | International Interior Design Association | Studio 651 (Sunroom), Weston Hall | Starts: 2025-09-29T15:30:00+00:00 | Ends: 2025-09-29T17:00:00+00:00 | Join us for a Lunch and Learn with Office Works and Teknion!",
    "image": "https://se-images.campuslabs.com/clink/images/fec6ab22-cdde-45fd-a91a-eed845e0063e728a6b7e-2682-4adc-b68f-53aaca5f54ac.png",
    "organization": "International Interior Design Association",
    "location": "Studio 651 (Sunroom), Weston Hall",
    "startsOn": "2025-09-29T15:30:00+00:00",
    "endsOn": "2025-09-29T17:00:00+00:00"
  },
  {
    "id": "campuslabs-11619021",
    "title": "Brews & Brains",
    "url": "https://njit.campuslabs.com/engage/event/11619021",
    "source": "njit.campuslabs.com",
    "description": "Spend a cozy afternoon filled with coffee, sandwiches, and tasty treats while you enjoy fun trivia sessions and games across different categories. Free food and drinks will be provided WHILE SUPPLIES LAST! Don't miss out on the perfect way to relax, connect with friends, and make memories!",
    "retrieved": "2025-09-29T17:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "social",
      "student activities council"
    ],
    "text": "Brews & Brains | Student Activities Council | Campus Center Atrium | Starts: 2025-09-29T17:00:00+00:00 | Ends: 2025-09-29T20:00:00+00:00 | Spend a cozy afternoon filled with coffee, sandwiches, and tasty treats while you enjoy fun trivia sessions and games across different categories. Free food and drinks will be provided WHILE SUPPLIES LAST! Don't miss out on the perfect way to relax, connect with friends, and make memories!",
    "image": "https://se-images.campuslabs.com/clink/images/065d8990-3f70-40fe-8b7b-c9a84a501677bf68b1f1-42c1-464f-a71f-1e0d7393040f.png",
    "organization": "Student Activities Council",
    "location": "Campus Center Atrium",
    "startsOn": "2025-09-29T17:00:00+00:00",
    "endsOn": "2025-09-29T20:00:00+00:00"
  },
  {
    "id": "campuslabs-11707454",
    "title": "Just Dance In Rhythm",
    "url": "https://njit.campuslabs.com/engage/event/11707454",
    "source": "njit.campuslabs.com",
    "description": "Play your favorite childhood dancing game with the Rhythm GMs.",
    "retrieved": "2025-09-29T18:30:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "njit esports",
      "recreational",
      "social"
    ],
    "text": "Just Dance In Rhythm | NJIT Esports | GITC 3600 | Starts: 2025-09-29T18:30:00+00:00 | Ends: 2025-09-29T20:00:00+00:00 | Play your favorite childhood dancing game with the Rhythm GMs.",
    "image": "https://se-images.campuslabs.com/clink/images/ddc78782-cbfb-4652-9a3c-4f0a488bd3c62e344981-8815-4eb6-80ef-6c443d42b828.png",
    "organization": "NJIT Esports",
    "location": "GITC 3600",
    "startsOn": "2025-09-29T18:30:00+00:00",
    "endsOn": "2025-09-29T20:00:00+00:00"
  },
  {
    "id": "campuslabs-11693673",
    "title": "IEEE - PCB Design Meeting",
    "url": "https://njit.campuslabs.com/engage/event/11693673",
    "source": "njit.campuslabs.com",
    "description": "Students will learn how to use various softwares to build and design printed circuit boards.",
    "retrieved": "2025-09-29T18:30:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "general",
      "institute of electrical and electronics engineers",
      "meeting",
      "thoughtfullearning"
    ],
    "text": "IEEE - PCB Design Meeting | Institute of Electrical and Electronics Engineers | KUPF 118 | Starts: 2025-09-29T18:30:00+00:00 | Ends: 2025-09-29T19:30:00+00:00 | Students will learn how to use various softwares to build and design printed circuit boards.",
    "image": "https://se-images.campuslabs.com/clink/images/23b69579-ced8-41a4-8fb2-003a9b802425ea5822d3-f0b7-4f02-a561-6e7da2c3e71b.png",
    "organization": "Institute of Electrical and Electronics Engineers",
    "location": "KUPF 118",
    "startsOn": "2025-09-29T18:30:00+00:00",
    "endsOn": "2025-09-29T19:30:00+00:00"
  },
  {
    "id": "campuslabs-11678896",
    "title": "MPTC High School Volunteering",
    "url": "https://njit.campuslabs.com/engage/event/11678896",
    "source": "njit.campuslabs.com",
    "description": "Volunteer with Robotics Club and Kids Who Code at MPTC High School! We do both math tutoring and robotics mentorship! Meet up before hand is in the Martinson Hall lobby.",
    "retrieved": "2025-09-29T19:30:00+00:00",
    "tags": [
      "campuslabs",
      "communityservice",
      "events",
      "local experiences",
      "robotics club",
      "volunteering"
    ],
    "text": "MPTC High School Volunteering | Robotics Club | MPTC High School | Starts: 2025-09-29T19:30:00+00:00 | Ends: 2025-09-29T20:45:00+00:00 | Volunteer with Robotics Club and Kids Who Code at MPTC High School! We do both math tutoring and robotics mentorship! Meet up before hand is in the Martinson Hall lobby.",
    "image": "https://se-images.campuslabs.com/clink/images/acec63e2-02b3-4949-93f0-eaad59c1db51c2ad62ba-5fdc-4e64-a3d7-137deb3be4b4.png",
    "organization": "Robotics Club",
    "location": "MPTC High School",
    "startsOn": "2025-09-29T19:30:00+00:00",
    "endsOn": "2025-09-29T20:45:00+00:00"
  },
  {
    "id": "campuslabs-11678919",
    "title": "MPTC School Steam Academy Volunteering: Robotics Club & Kids Who Code",
    "url": "https://njit.campuslabs.com/engage/event/11678919",
    "source": "njit.campuslabs.com",
    "description": "Volunteer with Robotics Club and Kids Who Code at Marion P Thomas Charter School STEAM Academy! We do both math tutoring and robotics mentorship! Meet up before hand is in the Martinson Hall lobby.",
    "retrieved": "2025-09-29T19:30:00+00:00",
    "tags": [
      "campuslabs",
      "communityservice",
      "events",
      "local experiences",
      "robotics club",
      "volunteering"
    ],
    "text": "MPTC School Steam Academy Volunteering: Robotics Club & Kids Who Code | Robotics Club | MPTC STEAM Academy | Starts: 2025-09-29T19:30:00+00:00 | Ends: 2025-09-29T20:45:00+00:00 | Volunteer with Robotics Club and Kids Who Code at Marion P Thomas Charter School STEAM Academy! We do both math tutoring and robotics mentorship! Meet up before hand is in the Martinson Hall lobby.",
    "image": "https://se-images.campuslabs.com/clink/images/9860e93f-1bc0-433a-9d35-4fa82b51c2328dd87ab7-7a17-4977-8e82-f12195ce89c2.png",
    "organization": "Robotics Club",
    "location": "MPTC STEAM Academy ",
    "startsOn": "2025-09-29T19:30:00+00:00",
    "endsOn": "2025-09-29T20:45:00+00:00"
  },
  {
    "id": "campuslabs-11613309",
    "title": "Heat and Mass Transfer OXE Study Session",
    "url": "https://njit.campuslabs.com/engage/event/11613309",
    "source": "njit.campuslabs.com",
    "description": "Come study with OXE tutor for your Heat and Mass exam!",
    "retrieved": "2025-09-29T20:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "meeting",
      "omega chi epsilon",
      "thoughtfullearning"
    ],
    "text": "Heat and Mass Transfer OXE Study Session | Omega Chi Epsilon | Tiernan Hall Room 106 | Starts: 2025-09-29T20:00:00+00:00 | Ends: 2025-09-29T22:00:00+00:00 | Come study with OXE tutor for your Heat and Mass exam!",
    "image": "https://se-images.campuslabs.com/clink/images/818dbad3-6c13-4591-a83b-e3d47b1a436ab46cf52c-4e9a-475f-a611-ff66a098b64a.png",
    "organization": "Omega Chi Epsilon",
    "location": "Tiernan Hall Room 106",
    "startsOn": "2025-09-29T20:00:00+00:00",
    "endsOn": "2025-09-29T22:00:00+00:00"
  },
  {
    "id": "campuslabs-11660690",
    "title": "Study Sync",
    "url": "https://njit.campuslabs.com/engage/event/11660690",
    "source": "njit.campuslabs.com",
    "description": "Need somewhere to study alone? Need somewhere to study with friends? Need late-night tutoring in Math, Chemistry, Physics, and CS? HEAD ON OVER TO STUDY SYNC! (Open to both residents and commuters) Location: Redwood Hall - Glass Lounge When?: Every Sunday, Monday, and Tuesday night from 7pm - 10pm",
    "retrieved": "2025-09-29T23:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "general",
      "student senate",
      "thoughtfullearning"
    ],
    "text": "Study Sync | Student Senate | Redwood Hall - Glass Lounge | Starts: 2025-09-29T23:00:00+00:00 | Ends: 2025-09-30T02:00:00+00:00 | Need somewhere to study alone? Need somewhere to study with friends? Need late-night tutoring in Math, Chemistry, Physics, and CS? HEAD ON OVER TO STUDY SYNC! (Open to both residents and commuters) Location: Redwood Hall - Glass Lounge When?: Every Sunday, Monday, and Tuesday night from 7pm - 10pm",
    "image": "https://se-images.campuslabs.com/clink/images/4d320805-aa9a-4314-b0f8-96e3318f642a1329b20c-9778-4177-a689-e88600bbd61a.png",
    "organization": "Student Senate",
    "location": "Redwood Hall - Glass Lounge",
    "startsOn": "2025-09-29T23:00:00+00:00",
    "endsOn": "2025-09-30T02:00:00+00:00"
  },
  {
    "id": "campuslabs-11677947",
    "title": "2nd Floor Meeting | October",
    "url": "https://njit.campuslabs.com/engage/event/11677947",
    "source": "njit.campuslabs.com",
    "description": "All second floor residents please join for a floor meeting for October!!",
    "retrieved": "2025-09-30T00:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "redwood hall",
      "thoughtfullearning"
    ],
    "text": "2nd Floor Meeting | October | Redwood Hall | Redwood 2nd Floor Elevator Lounge | Starts: 2025-09-30T00:00:00+00:00 | Ends: 2025-09-30T00:30:00+00:00 | All second floor residents please join for a floor meeting for October!!",
    "image": "https://se-images.campuslabs.com/clink/images/37a4f1c7-34fe-4f88-afbc-535abd1520d21257dd35-a775-4fba-9c53-b2792b1b2ba0.png",
    "organization": "Redwood Hall",
    "location": "Redwood 2nd Floor Elevator Lounge",
    "startsOn": "2025-09-30T00:00:00+00:00",
    "endsOn": "2025-09-30T00:30:00+00:00"
  },
  {
    "id": "campuslabs-11641154",
    "title": "Redwood 6th Floor October Meeting",
    "url": "https://njit.campuslabs.com/engage/event/11641154",
    "source": "njit.campuslabs.com",
    "description": "See you at our monthly mandatory floor meeting where we will be briefly following up on community standards, discussing floor issues, and addressing concerns and questions!",
    "retrieved": "2025-09-30T01:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "redwood hall",
      "social"
    ],
    "text": "Redwood 6th Floor October Meeting | Redwood Hall | Redwood Hall 6th Floor Elevator Lounge | Starts: 2025-09-30T01:00:00+00:00 | Ends: 2025-09-30T01:30:00+00:00 | See you at our monthly mandatory floor meeting where we will be briefly following up on community standards, discussing floor issues, and addressing concerns and questions!",
    "image": "https://se-images.campuslabs.com/clink/images/1f3ebbb2-d415-4034-9303-9f91ccd56706abe93835-37ab-47e9-a8ee-80cf330f358c.png",
    "organization": "Redwood Hall",
    "location": "Redwood Hall 6th Floor Elevator Lounge",
    "startsOn": "2025-09-30T01:00:00+00:00",
    "endsOn": "2025-09-30T01:30:00+00:00"
  },
  {
    "id": "campuslabs-11641540",
    "title": "3rd-Floor October Floor Meeting",
    "url": "https://njit.campuslabs.com/engage/event/11641540",
    "source": "njit.campuslabs.com",
    "description": "October floor meeting for Redwood Hall 3rd-floor residents. Catch up with floormates, review ResLife policies/procedures, and continue to discuss community standards.",
    "retrieved": "2025-09-30T01:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "meeting",
      "redwood hall",
      "social"
    ],
    "text": "3rd-Floor October Floor Meeting | Redwood Hall | Redwood Hall 3rd-floor Elevator Lounge | Starts: 2025-09-30T01:00:00+00:00 | Ends: 2025-09-30T01:30:00+00:00 | October floor meeting for Redwood Hall 3rd-floor residents. Catch up with floormates, review ResLife policies/procedures, and continue to discuss community standards.",
    "image": "https://se-images.campuslabs.com/clink/images/4490674a-c8b6-485e-9662-ac16136f7a6e329ec2e3-2b4c-4c5d-91e1-8541de6c6cf2.png",
    "organization": "Redwood Hall",
    "location": "Redwood Hall 3rd-floor Elevator Lounge",
    "startsOn": "2025-09-30T01:00:00+00:00",
    "endsOn": "2025-09-30T01:30:00+00:00"
  },
  {
    "id": "campuslabs-11690859",
    "title": "4th Floor October Meeting",
    "url": "https://njit.campuslabs.com/engage/event/11690859",
    "source": "njit.campuslabs.com",
    "description": "Mandatory 4th-floor October meeting to check in with residents and reinforce community standards",
    "retrieved": "2025-09-30T01:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "redwood hall",
      "social"
    ],
    "text": "4th Floor October Meeting | Redwood Hall | Redwood Hall, 4th floor elevator lounge | Starts: 2025-09-30T01:00:00+00:00 | Ends: 2025-09-30T01:30:00+00:00 | Mandatory 4th-floor October meeting to check in with residents and reinforce community standards",
    "image": "https://se-images.campuslabs.com/clink/images/eb06a323-24bf-43f3-b5b2-67c66a5f216bc3c6bf27-ced2-4d11-8ba6-d6dd963b3588.png",
    "organization": "Redwood Hall",
    "location": "Redwood Hall, 4th floor elevator lounge",
    "startsOn": "2025-09-30T01:00:00+00:00",
    "endsOn": "2025-09-30T01:30:00+00:00"
  },
  {
    "id": "campuslabs-11666970",
    "title": "6th Floor Meeting",
    "url": "https://njit.campuslabs.com/engage/event/11666970",
    "source": "njit.campuslabs.com",
    "description": "Discuss with the residents their whereabouts and address recent incidents and concerns.",
    "retrieved": "2025-09-30T01:00:00+00:00",
    "tags": [
      "campuslabs",
      "cypress hall",
      "events",
      "meeting",
      "social"
    ],
    "text": "6th Floor Meeting | Cypress Hall | Cypress 114 | Starts: 2025-09-30T01:00:00+00:00 | Ends: 2025-09-30T01:30:00+00:00 | Discuss with the residents their whereabouts and address recent incidents and concerns.",
    "image": "https://se-images.campuslabs.com/clink/images/8d7382d5-2a28-42f0-8cf4-1da55a23977068473ba0-4bd7-4905-b564-224e616bbb77.png",
    "organization": "Cypress Hall",
    "location": "Cypress 114",
    "startsOn": "2025-09-30T01:00:00+00:00",
    "endsOn": "2025-09-30T01:30:00+00:00"
  },
  {
    "id": "campuslabs-11641382",
    "title": "3rd Floor Meeting",
    "url": "https://njit.campuslabs.com/engage/event/11641382",
    "source": "njit.campuslabs.com",
    "description": "Come down to RA Sameer's and RA Jonessa's 3rd floor meeting to learn about happenings and important information at Cypress Hall and NJIT! All Cypress Hall 3rd floor residents are required to attend.",
    "retrieved": "2025-09-30T01:15:00+00:00",
    "tags": [
      "campuslabs",
      "cypress hall",
      "events",
      "general",
      "social"
    ],
    "text": "3rd Floor Meeting | Cypress Hall | Cypress 3rd Floor Elevators | Starts: 2025-09-30T01:15:00+00:00 | Ends: 2025-09-30T01:45:00+00:00 | Come down to RA Sameer's and RA Jonessa's 3rd floor meeting to learn about happenings and important information at Cypress Hall and NJIT! All Cypress Hall 3rd floor residents are required to attend.",
    "image": "https://se-images.campuslabs.com/clink/images/c6540a82-9278-45d6-b70a-ae7ada064f597a082db6-2b5e-4057-ac55-aa403f75137f.png",
    "organization": "Cypress Hall",
    "location": "Cypress 3rd Floor Elevators",
    "startsOn": "2025-09-30T01:15:00+00:00",
    "endsOn": "2025-09-30T01:45:00+00:00"
  },
  {
    "id": "campuslabs-11704043",
    "title": "It' time for GiveAway",
    "url": "https://njit.campuslabs.com/engage/event/11704043",
    "source": "njit.campuslabs.com",
    "description": "stop by the BME department on Fenster Hall 6 floor for a chance to win. All you need to do is enter your name to win",
    "retrieved": "2025-09-30T12:00:00+00:00",
    "tags": [
      "biomedical engineering department",
      "campuslabs",
      "events",
      "social"
    ],
    "text": "It' time for GiveAway | Biomedical Engineering Department | FENSTER HALL 6 FLOOR, right outside elevator | Starts: 2025-09-30T12:00:00+00:00 | Ends: 2025-10-01T03:45:00+00:00 | stop by the BME department on Fenster Hall 6 floor for a chance to win. All you need to do is enter your name to win",
    "image": "https://se-images.campuslabs.com/clink/images/d818cd88-4f36-4d1f-865f-924ce42f2ac2538eb7a6-96ad-4f2d-ab53-307034a146af.png",
    "organization": "Biomedical Engineering Department",
    "location": "FENSTER HALL 6 FLOOR, right outside elevator",
    "startsOn": "2025-09-30T12:00:00+00:00",
    "endsOn": "2025-10-01T03:45:00+00:00"
  },
  {
    "id": "campuslabs-11694683",
    "title": "Phi Delta Theta Tabling Event",
    "url": "https://njit.campuslabs.com/engage/event/11694683",
    "source": "njit.campuslabs.com",
    "description": "Phi Delta Theta Tabling Event",
    "retrieved": "2025-09-30T14:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "fundraising",
      "phi delta theta",
      "tabling"
    ],
    "text": "Phi Delta Theta Tabling Event | Phi Delta Theta | Campus Center Lobby | Starts: 2025-09-30T14:00:00+00:00 | Ends: 2025-09-30T21:00:00+00:00 | Phi Delta Theta Tabling Event",
    "image": "https://se-images.campuslabs.com/clink/images/a7f99623-4df4-479d-9f5b-c7e59cdf51ee4090f51a-c8d7-4af8-b47c-f6072d8bff3b.png",
    "organization": "Phi Delta Theta",
    "location": "Campus Center Lobby",
    "startsOn": "2025-09-30T14:00:00+00:00",
    "endsOn": "2025-09-30T21:00:00+00:00"
  },
  {
    "id": "campuslabs-11660828",
    "title": "Student Peer Wellness Coaching",
    "url": "https://njit.campuslabs.com/engage/event/11660828",
    "source": "njit.campuslabs.com",
    "description": "Meet with a Peer Wellness Coach individually for about 20 minutes to focus on maximizing your own wellbeing, or with a group of your peers to discuss wellbeing for about an hour.",
    "retrieved": "2025-09-30T14:30:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "health & wellness",
      "peer wellness coaching",
      "social"
    ],
    "text": "Student Peer Wellness Coaching | Peer Wellness Coaching | Center for Peer Wellness Coaching (behind NJIT's Smashburger) | Starts: 2025-09-30T14:30:00+00:00 | Ends: 2025-09-30T17:00:00+00:00 | Meet with a Peer Wellness Coach individually for about 20 minutes to focus on maximizing your own wellbeing, or with a group of your peers to discuss wellbeing for about an hour.",
    "image": "https://se-images.campuslabs.com/clink/images/b58e2efa-24bc-4756-a828-a06220becab408865e7e-5fa6-4a54-88d6-ddd2826df861.png",
    "organization": "Peer Wellness Coaching",
    "location": "Center for Peer Wellness Coaching (behind NJIT's Smashburger)",
    "startsOn": "2025-09-30T14:30:00+00:00",
    "endsOn": "2025-09-30T17:00:00+00:00"
  },
  {
    "id": "campuslabs-11634439",
    "title": "Sticky Note Positivity",
    "url": "https://njit.campuslabs.com/engage/event/11634439",
    "source": "njit.campuslabs.com",
    "description": "Residents will receive sticky notes to write positive words or uplifting remarks, which they can place on other residents’ doors to spread encouragement and build a supportive community.",
    "retrieved": "2025-09-30T15:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "laurel hall",
      "local experiences",
      "spirituality"
    ],
    "text": "Sticky Note Positivity | Laurel Hall | Laurel Hall 4th floor dorms | Starts: 2025-09-30T15:00:00+00:00 | Ends: 2025-10-01T03:45:00+00:00 | Residents will receive sticky notes to write positive words or uplifting remarks, which they can place on other residents’ doors to spread encouragement and build a supportive community.",
    "image": "https://se-images.campuslabs.com/clink/images/06077d34-2c76-41df-b92b-4f949c4635ab0893328e-520c-45af-b0a7-c680764c3375.png",
    "organization": "Laurel Hall",
    "location": "Laurel Hall 4th floor dorms",
    "startsOn": "2025-09-30T15:00:00+00:00",
    "endsOn": "2025-10-01T03:45:00+00:00"
  },
  {
    "id": "campuslabs-11697047",
    "title": "NSC Open Field Day",
    "url": "https://njit.campuslabs.com/engage/event/11697047",
    "source": "njit.campuslabs.com",
    "description": "The NJIT Soccer Club has secured Lubetkin Field every Tuesday and Thursday. Tuesday: 2:00 PM to 4:00 PM Thursday: 4:00 PM to 6 PM Join us for games, the opportunity to meet new friends, and a chance to showcase your soccer skills. We will also host tournaments, watch parties, and competitions includ",
    "retrieved": "2025-09-30T18:00:00+00:00",
    "tags": [
      "athletics",
      "campuslabs",
      "events",
      "new jersey institute of technology soccer club"
    ],
    "text": "NSC Open Field Day | New Jersey Institute of Technology Soccer Club | Lubetkin Field | Starts: 2025-09-30T18:00:00+00:00 | Ends: 2025-09-30T20:00:00+00:00 | The NJIT Soccer Club has secured Lubetkin Field every Tuesday and Thursday. Tuesday: 2:00 PM to 4:00 PM Thursday: 4:00 PM to 6 PM Join us for games, the opportunity to meet new friends, and a chance to showcase your soccer skills. We will also host tournaments, watch parties, and competitions including 1v1 matches and more.",
    "image": "https://se-images.campuslabs.com/clink/images/a197e740-8383-497c-9cb6-48f5b117c1e2065279bc-296f-4ec0-aab6-05e61765df7b.png",
    "organization": "New Jersey Institute of Technology Soccer Club",
    "location": "Lubetkin Field",
    "startsOn": "2025-09-30T18:00:00+00:00",
    "endsOn": "2025-09-30T20:00:00+00:00"
  },
  {
    "id": "campuslabs-11693255",
    "title": "Fingerprint Workshop - FSSA",
    "url": "https://njit.campuslabs.com/engage/event/11693255",
    "source": "njit.campuslabs.com",
    "description": "Come get your prints dusted and discover the science behind unique fingerprint patterns with the FSSA on Friday, Sept 30 from 2:30 AM–4:00 PM in the Campus Center Lobby . Learn how forensic scientists use fingerprints to solve cases during this National Forensic Science Week event!",
    "retrieved": "2025-09-30T18:30:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "forensic science student association",
      "social"
    ],
    "text": "Fingerprint Workshop - FSSA | Forensic Science Student Association | Campus Center Lobby | Starts: 2025-09-30T18:30:00+00:00 | Ends: 2025-09-30T20:00:00+00:00 | Come get your prints dusted and discover the science behind unique fingerprint patterns with the FSSA on Friday, Sept 30 from 2:30 AM–4:00 PM in the Campus Center Lobby . Learn how forensic scientists use fingerprints to solve cases during this National Forensic Science Week event!",
    "image": "https://se-images.campuslabs.com/clink/images/43c82078-d626-4a6e-af04-91cef5800d362ed24efd-1ef6-43e5-999f-b2701e595dae.png",
    "organization": "Forensic Science Student Association",
    "location": "Campus Center Lobby",
    "startsOn": "2025-09-30T18:30:00+00:00",
    "endsOn": "2025-09-30T20:00:00+00:00"
  },
  {
    "id": "campuslabs-11633883",
    "title": "Flylanders™ General Body Meeting",
    "url": "https://njit.campuslabs.com/engage/event/11633883",
    "source": "njit.campuslabs.com",
    "description": "Flylanders™ General Body Meeting",
    "retrieved": "2025-09-30T20:30:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "general body meeting",
      "nj sae aero ",
      "thoughtfullearning"
    ],
    "text": "Flylanders™ General Body Meeting | NJ SAE Aero | GITC2305 | Starts: 2025-09-30T20:30:00+00:00 | Ends: 2025-09-30T22:00:00+00:00 | Flylanders™ General Body Meeting",
    "image": "https://se-images.campuslabs.com/clink/images/3634dd16-2fc8-46e5-8fa6-be4ffa18108df6086e3a-0404-4300-ba21-7c20bd934b23.png",
    "organization": "NJ SAE Aero ",
    "location": "GITC2305",
    "startsOn": "2025-09-30T20:30:00+00:00",
    "endsOn": "2025-09-30T22:00:00+00:00"
  },
  {
    "id": "campuslabs-11655933",
    "title": "WISH GBM #1",
    "url": "https://njit.campuslabs.com/engage/event/11655933",
    "source": "njit.campuslabs.com",
    "description": "Come join WISH for our first GBM of the semester! We will be discussing our plans for the semester and introduce the new executive board!",
    "retrieved": "2025-09-30T21:30:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "general body meeting",
      "social",
      "women’s initiative for supportive healthcare"
    ],
    "text": "WISH GBM #1 | Women’s Initiative for Supportive Healthcare | Campus Center room 240 | Starts: 2025-09-30T21:30:00+00:00 | Ends: 2025-09-30T22:00:00+00:00 | Come join WISH for our first GBM of the semester! We will be discussing our plans for the semester and introduce the new executive board!",
    "image": "https://se-images.campuslabs.com/clink/images/f20c4e71-9ebc-4339-a5a2-948ea11212dbf33b0278-436e-4d33-a734-4ab0f3786891.png",
    "organization": "Women’s Initiative for Supportive Healthcare",
    "location": "Campus Center room 240",
    "startsOn": "2025-09-30T21:30:00+00:00",
    "endsOn": "2025-09-30T22:00:00+00:00"
  },
  {
    "id": "campuslabs-11695903",
    "title": "Open Play Night ",
    "url": "https://njit.campuslabs.com/engage/event/11695903",
    "source": "njit.campuslabs.com",
    "description": "Racquetball Open Play Night; whether you're unfamiliar with the game of racquetball or a seasoned professional, come to the WEC Courts for a night of electric energy and great fun!",
    "retrieved": "2025-09-30T22:00:00+00:00",
    "tags": [
      "athletics",
      "campuslabs",
      "competition",
      "events",
      "racquetball club",
      "recreational"
    ],
    "text": "Open Play Night | Racquetball Club | Racquetball Courts (WEC) | Starts: 2025-09-30T22:00:00+00:00 | Ends: 2025-10-01T00:00:00+00:00 | Racquetball Open Play Night; whether you're unfamiliar with the game of racquetball or a seasoned professional, come to the WEC Courts for a night of electric energy and great fun!",
    "image": "https://se-images.campuslabs.com/clink/images/10ffffd3-1e4a-4e41-9453-8ab8e0bf49abe30fbf58-553c-4f0d-bca3-55807fa5aace.png",
    "organization": "Racquetball Club",
    "location": "Racquetball Courts (WEC)",
    "startsOn": "2025-09-30T22:00:00+00:00",
    "endsOn": "2025-10-01T00:00:00+00:00"
  },
  {
    "id": "campuslabs-11707500",
    "title": "Mario Kart Casual Races",
    "url": "https://njit.campuslabs.com/engage/event/11707500",
    "source": "njit.campuslabs.com",
    "description": "An online get-together for the people who are active in NJIT's Mario Kart community to meet and get to know each other a bit better.",
    "retrieved": "2025-09-30T22:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "njit esports",
      "recreational",
      "social"
    ],
    "text": "Mario Kart Casual Races | NJIT Esports | Online | Starts: 2025-09-30T22:00:00+00:00 | Ends: 2025-09-30T23:00:00+00:00 | An online get-together for the people who are active in NJIT's Mario Kart community to meet and get to know each other a bit better.",
    "image": "https://se-images.campuslabs.com/clink/images/88290746-3a72-41b6-aceb-2838e72b7950df80166d-68a9-48eb-9b28-5103d0e2cb2f.png",
    "organization": "NJIT Esports",
    "location": "Online",
    "startsOn": "2025-09-30T22:00:00+00:00",
    "endsOn": "2025-09-30T23:00:00+00:00"
  },
  {
    "id": "campuslabs-11702562",
    "title": "Exam Study Session",
    "url": "https://njit.campuslabs.com/engage/event/11702562",
    "source": "njit.campuslabs.com",
    "description": "A fun way to study for upcoming common exams with tutors, snacks, and games!",
    "retrieved": "2025-09-30T22:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "general",
      "learning communities",
      "thoughtfullearning"
    ],
    "text": "Exam Study Session | Learning Communities | CKB 205 (LC Lounge) | Starts: 2025-09-30T22:00:00+00:00 | Ends: 2025-10-01T01:00:00+00:00 | A fun way to study for upcoming common exams with tutors, snacks, and games!",
    "image": "https://se-images.campuslabs.com/clink/images/d221adc1-4f0c-4595-8681-6641bcac86390346e096-4ba3-4ab6-966a-728e1ccaead8.png",
    "organization": "Learning Communities",
    "location": "CKB 205 (LC Lounge)",
    "startsOn": "2025-09-30T22:00:00+00:00",
    "endsOn": "2025-10-01T01:00:00+00:00"
  },
  {
    "id": "campuslabs-11660691",
    "title": "Study Sync",
    "url": "https://njit.campuslabs.com/engage/event/11660691",
    "source": "njit.campuslabs.com",
    "description": "Need somewhere to study alone? Need somewhere to study with friends? Need late-night tutoring in Math, Chemistry, Physics, and CS? HEAD ON OVER TO STUDY SYNC! (Open to both residents and commuters) Location: Redwood Hall - Glass Lounge When?: Every Sunday, Monday, and Tuesday night from 7pm - 10pm",
    "retrieved": "2025-09-30T23:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "general",
      "student senate",
      "thoughtfullearning"
    ],
    "text": "Study Sync | Student Senate | Redwood Hall - Glass Lounge | Starts: 2025-09-30T23:00:00+00:00 | Ends: 2025-10-01T02:00:00+00:00 | Need somewhere to study alone? Need somewhere to study with friends? Need late-night tutoring in Math, Chemistry, Physics, and CS? HEAD ON OVER TO STUDY SYNC! (Open to both residents and commuters) Location: Redwood Hall - Glass Lounge When?: Every Sunday, Monday, and Tuesday night from 7pm - 10pm",
    "image": "https://se-images.campuslabs.com/clink/images/4d320805-aa9a-4314-b0f8-96e3318f642a1329b20c-9778-4177-a689-e88600bbd61a.png",
    "organization": "Student Senate",
    "location": "Redwood Hall - Glass Lounge",
    "startsOn": "2025-09-30T23:00:00+00:00",
    "endsOn": "2025-10-01T02:00:00+00:00"
  },
  {
    "id": "campuslabs-11704044",
    "title": "It' time for GiveAway",
    "url": "https://njit.campuslabs.com/engage/event/11704044",
    "source": "njit.campuslabs.com",
    "description": "stop by the BME department on Fenster Hall 6 floor for a chance to win. All you need to do is enter your name to win",
    "retrieved": "2025-10-01T12:00:00+00:00",
    "tags": [
      "biomedical engineering department",
      "campuslabs",
      "events",
      "social"
    ],
    "text": "It' time for GiveAway | Biomedical Engineering Department | FENSTER HALL 6 FLOOR, right outside elevator | Starts: 2025-10-01T12:00:00+00:00 | Ends: 2025-10-03T03:45:00+00:00 | stop by the BME department on Fenster Hall 6 floor for a chance to win. All you need to do is enter your name to win",
    "image": "https://se-images.campuslabs.com/clink/images/d818cd88-4f36-4d1f-865f-924ce42f2ac2538eb7a6-96ad-4f2d-ab53-307034a146af.png",
    "organization": "Biomedical Engineering Department",
    "location": "FENSTER HALL 6 FLOOR, right outside elevator",
    "startsOn": "2025-10-01T12:00:00+00:00",
    "endsOn": "2025-10-03T03:45:00+00:00"
  },
  {
    "id": "campuslabs-11691651",
    "title": "Academic Avenues",
    "url": "https://njit.campuslabs.com/engage/event/11691651",
    "source": "njit.campuslabs.com",
    "description": "Quick access to study resources around campus and in Redwood.",
    "retrieved": "2025-10-01T12:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "redwood hall",
      "thoughtfullearning"
    ],
    "text": "Academic Avenues | Redwood Hall | Online | Starts: 2025-10-01T12:00:00+00:00 | Ends: 2025-11-01T03:00:00+00:00 | Quick access to study resources around campus and in Redwood.",
    "image": "https://se-images.campuslabs.com/clink/images/59c4018b-7be7-44c3-bd72-bb0938110bff73da5831-9166-405b-8bc1-18a7a93e2803.png",
    "organization": "Redwood Hall",
    "location": "Online",
    "startsOn": "2025-10-01T12:00:00+00:00",
    "endsOn": "2025-11-01T03:00:00+00:00"
  },
  {
    "id": "campuslabs-11691480",
    "title": "10 Tips to Safely Use AI In College",
    "url": "https://njit.campuslabs.com/engage/event/11691480",
    "source": "njit.campuslabs.com",
    "description": "Check out these tips to safely and effectively use Artificial Intelligence as you journey through NJIT!",
    "retrieved": "2025-10-01T16:00:00+00:00",
    "tags": [
      "campuslabs",
      "cypress hall",
      "events",
      "general",
      "thoughtfullearning"
    ],
    "text": "10 Tips to Safely Use AI In College | Cypress Hall | Online | Starts: 2025-10-01T16:00:00+00:00 | Ends: 2025-10-31T17:00:00+00:00 | Check out these tips to safely and effectively use Artificial Intelligence as you journey through NJIT!",
    "image": "https://se-images.campuslabs.com/clink/images/44473940-573e-4cc1-9dea-cbe49811952d8ff6a4af-49bb-4221-99f2-75cd577be95b.png",
    "organization": "Cypress Hall",
    "location": "Online",
    "startsOn": "2025-10-01T16:00:00+00:00",
    "endsOn": "2025-10-31T17:00:00+00:00"
  },
  {
    "id": "campuslabs-11690938",
    "title": "How to use the Cypress Kitchen!",
    "url": "https://njit.campuslabs.com/engage/event/11690938",
    "source": "njit.campuslabs.com",
    "description": "Want to bake brownies or cook some yummy soup? Here's a guide to using the kitchen safely! https://www.canva.com/design/DAGyvdDJvgw/Fz3CIXVw0cIgufkG4rrWew/view?utm_content=DAGyvdDJvgw&utm_campaign=designshare&utm_medium=link2&utm_source=uniquelinks&utlId=hc250e6d9d1 --> Presentation Link!",
    "retrieved": "2025-10-01T16:00:00+00:00",
    "tags": [
      "campuslabs",
      "cypress hall",
      "events",
      "general",
      "thoughtfullearning"
    ],
    "text": "How to use the Cypress Kitchen! | Cypress Hall | Online | Starts: 2025-10-01T16:00:00+00:00 | Ends: 2025-10-31T17:00:00+00:00 | Want to bake brownies or cook some yummy soup? Here's a guide to using the kitchen safely! https://www.canva.com/design/DAGyvdDJvgw/Fz3CIXVw0cIgufkG4rrWew/view?utm_content=DAGyvdDJvgw&utm_campaign=designshare&utm_medium=link2&utm_source=uniquelinks&utlId=hc250e6d9d1 --> Presentation Link!",
    "image": "https://se-images.campuslabs.com/clink/images/dc89fea3-ba95-4542-840f-397ec96976bc650c7485-20b8-4169-ba89-0df3543fc779.png",
    "organization": "Cypress Hall",
    "location": "Online",
    "startsOn": "2025-10-01T16:00:00+00:00",
    "endsOn": "2025-10-31T17:00:00+00:00"
  },
  {
    "id": "campuslabs-11587901",
    "title": "The Great Cypress Stain-Off",
    "url": "https://njit.campuslabs.com/engage/event/11587901",
    "source": "njit.campuslabs.com",
    "description": "Learn how to treat various stains to better preserve your clothes!",
    "retrieved": "2025-10-01T16:00:00+00:00",
    "tags": [
      "campuslabs",
      "cypress hall",
      "events",
      "thoughtfullearning"
    ],
    "text": "The Great Cypress Stain-Off | Cypress Hall | Online | Starts: 2025-10-01T16:00:00+00:00 | Ends: 2025-10-31T17:00:00+00:00 | Learn how to treat various stains to better preserve your clothes!",
    "image": "https://se-images.campuslabs.com/clink/images/f4e8b9fc-0e93-4af1-8b4f-abadc95995664e424aa7-b50e-40ef-b830-4e63bedbbb7d.png",
    "organization": "Cypress Hall",
    "location": "Online",
    "startsOn": "2025-10-01T16:00:00+00:00",
    "endsOn": "2025-10-31T17:00:00+00:00"
  },
  {
    "id": "campuslabs-11691321",
    "title": "Halloween Movie Tier Lists!",
    "url": "https://njit.campuslabs.com/engage/event/11691321",
    "source": "njit.campuslabs.com",
    "description": "Come all my scary movie connoisseurs! Debate on what you think the best horror movies are during this spooky season! Share your lists here on Highlander Hub to check out everyones tier's and debate on who actually is a halloween master. (A mixture of classics, scary comedy, and actually scary movies",
    "retrieved": "2025-10-01T16:00:00+00:00",
    "tags": [
      "campuslabs",
      "cypress hall",
      "events",
      "recreational",
      "social"
    ],
    "text": "Halloween Movie Tier Lists! | Cypress Hall | Online | Starts: 2025-10-01T16:00:00+00:00 | Ends: 2025-10-31T17:00:00+00:00 | Come all my scary movie connoisseurs! Debate on what you think the best horror movies are during this spooky season! Share your lists here on Highlander Hub to check out everyones tier's and debate on who actually is a halloween master. (A mixture of classics, scary comedy, and actually scary movies are in the list for variety!) If you don't know a movie then check it out and broaden your horizons!",
    "image": "https://se-images.campuslabs.com/clink/images/1abc635d-eb30-4052-a9a1-5d49579d179c3f88b7fc-1e83-46d0-ae80-c9aefe209e25.png",
    "organization": "Cypress Hall",
    "location": "Online",
    "startsOn": "2025-10-01T16:00:00+00:00",
    "endsOn": "2025-10-31T17:00:00+00:00"
  },
  {
    "id": "campuslabs-11691759",
    "title": "Cooking up Community",
    "url": "https://njit.campuslabs.com/engage/event/11691759",
    "source": "njit.campuslabs.com",
    "description": "Discover the benefits of using the community kitchen and scan to find easy, budget-friendly recipes that can be prepared in the Redwood Kitchen!",
    "retrieved": "2025-10-01T16:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "recreational",
      "redwood hall",
      "thoughtfullearning"
    ],
    "text": "Cooking up Community | Redwood Hall | Redwood Kitchen | Starts: 2025-10-01T16:00:00+00:00 | Ends: 2025-10-31T17:00:00+00:00 | Discover the benefits of using the community kitchen and scan to find easy, budget-friendly recipes that can be prepared in the Redwood Kitchen!",
    "image": "https://se-images.campuslabs.com/clink/images/bfd1c33c-b199-4138-94fe-1fb68d2bd3d8f872c4cd-407f-4715-9e6e-3f2a7f66c68a.png",
    "organization": "Redwood Hall",
    "location": "Redwood Kitchen",
    "startsOn": "2025-10-01T16:00:00+00:00",
    "endsOn": "2025-10-31T17:00:00+00:00"
  },
  {
    "id": "campuslabs-11700432",
    "title": "Commuter's Chill and Game",
    "url": "https://njit.campuslabs.com/engage/event/11700432",
    "source": "njit.campuslabs.com",
    "description": "Stop by the Campus Center Lobby from 12 PM to 4 PM to play games with your fellow students and to learn more about Dice & Decks, OCCA, and various commuter resources!",
    "retrieved": "2025-10-01T16:00:00+00:00",
    "tags": [
      "campuslabs",
      "dice and decks",
      "events",
      "social",
      "tabling"
    ],
    "text": "Commuter's Chill and Game | Dice and Decks | Campus Center Lobby | Starts: 2025-10-01T16:00:00+00:00 | Ends: 2025-10-01T20:00:00+00:00 | Stop by the Campus Center Lobby from 12 PM to 4 PM to play games with your fellow students and to learn more about Dice & Decks, OCCA, and various commuter resources!",
    "image": "https://se-images.campuslabs.com/clink/images/43b47407-19b6-49ed-96c5-e09d3e97a320777bcde3-d2fc-4dd9-b170-2f415184bf6a.png",
    "organization": "Dice and Decks",
    "location": "Campus Center Lobby",
    "startsOn": "2025-10-01T16:00:00+00:00",
    "endsOn": "2025-10-01T20:00:00+00:00"
  },
  {
    "id": "campuslabs-11711244",
    "title": "Canon Event Jar",
    "url": "https://njit.campuslabs.com/engage/event/11711244",
    "source": "njit.campuslabs.com",
    "description": "Ever had something weird, funny, or unforgettable happen on campus? Now’s your chance to share it! A jar will be waiting near the entrance with sticky notes and pens. Write down your funniest or oddest campus memory and drop it inside. Later, we’ll reveal some of the funniest stories on the board fo",
    "retrieved": "2025-10-01T16:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "social",
      "talbott apartments"
    ],
    "text": "Canon Event Jar | Talbott Apartments | Talbott Hall | Starts: 2025-10-01T16:00:00+00:00 | Ends: 2025-10-15T17:00:00+00:00 | Ever had something weird, funny, or unforgettable happen on campus? Now’s your chance to share it! A jar will be waiting near the entrance with sticky notes and pens. Write down your funniest or oddest campus memory and drop it inside. Later, we’ll reveal some of the funniest stories on the board for everyone to enjoy!",
    "image": "https://se-images.campuslabs.com/clink/images/77c57045-8898-43ad-848f-8ae4889158051ebbdb6c-2d46-4aec-a7a3-ac58166a360f.png",
    "organization": "Talbott Apartments",
    "location": "Talbott Hall",
    "startsOn": "2025-10-01T16:00:00+00:00",
    "endsOn": "2025-10-15T17:00:00+00:00"
  },
  {
    "id": "campuslabs-11707620",
    "title": "Maple Hall 6th Floor's October Treat Drop 🎃",
    "url": "https://njit.campuslabs.com/engage/event/11707620",
    "source": "njit.campuslabs.com",
    "description": "Get ready for a month of sweet surprises! To celebrate the lead-up to Halloween, we're ensuring a continuous supply of treats is available right here on the 6th floor of Maple Hall all throughout October. Starting October 1st, look for the designated \"Treat Drop\" outside the RA's door. It will be re",
    "retrieved": "2025-10-01T16:00:00+00:00",
    "tags": [
      "campuslabs",
      "events",
      "maple hall",
      "social"
    ],
    "text": "Maple Hall 6th Floor's October Treat Drop 🎃 | Maple Hall | Maple Hall 6th Floor | Starts: 2025-10-01T16:00:00+00:00 | Ends: 2025-10-31T17:00:00+00:00 | Get ready for a month of sweet surprises! To celebrate the lead-up to Halloween, we're ensuring a continuous supply of treats is available right here on the 6th floor of Maple Hall all throughout October. Starting October 1st, look for the designated \"Treat Drop\" outside the RA's door. It will be refilled regularly with a variety of Halloween candy and snacks, perfect for a quick pick-me-up between classes or a late-night study snack. The Rules are Simple: Take a Treat: Grab one or two when you walk by. Be Considerate: Leave plenty for your neighbors. Enjoy the Month! It's our way of making sure you get to enjoy the best part of the season all month long! Happy haunting (and snacking)! 👻🍬",
    "image": "https://se-images.campuslabs.com/clink/images/a87ce924-3b0e-4354-a7ad-7b0aad4d043ffc46a73e-bc01-4a3e-b8e9-d2a4c45f62e0.png",
    "organization": "Maple Hall",
    "location": "Maple Hall 6th Floor",
    "startsOn": "2025-10-01T16:00:00+00:00",
    "endsOn": "2025-10-31T17:00:00+00:00"
  },
  {
    "id": "campuslabs-11690945",
    "title": "Best NJIT Study Spot Guide",
    "url": "https://njit.campuslabs.com/engage/event/11690945",
    "source": "njit.campuslabs.com",
    "description": "Discover the best study spots on campus! Use this guide to see what works best for you and find the environments and methods that help you focus and succeed!",
    "retrieved": "2025-10-01T16:00:00+00:00",
    "tags": [
      "campuslabs",
      "cypress hall",
      "events",
      "local experiences",
      "professional development",
      "thoughtfullearning"
    ],
    "text": "Best NJIT Study Spot Guide | Cypress Hall | Online | Starts: 2025-10-01T16:00:00+00:00 | Ends: 2025-10-31T17:00:00+00:00 | Discover the best study spots on campus! Use this guide to see what works best for you and find the environments and methods that help you focus and succeed!",
    "image": "https://se-images.campuslabs.com/clink/images/d84b8be5-d1d7-457e-a353-cc436ece7f894635f65c-488f-4058-94a0-4d420dca0d49.png",
    "organization": "Cypress Hall",
    "location": "Online",
    "startsOn": "2025-10-01T16:00:00+00:00",
    "endsOn": "2025-10-31T17:00:00+00:00"
  },
  {
    "id": "campuslabs-11690881",
    "title": "Talking Made EASY",
    "url": "https://njit.campuslabs.com/engage/event/11690881",
    "source": "njit.campuslabs.com",
    "description": "A pamphlet with links to LinkedIN Learning courses about communication and conflict.",
    "retrieved": "2025-10-01T16:00:00+00:00",
    "tags": [
      "campuslabs",
      "cypress hall",
      "events",
      "leadership development",
      "professional development",
      "thoughtfullearning"
    ],
    "text": "Talking Made EASY | Cypress Hall | 6th Floor Cypress Hall | Starts: 2025-10-01T16:00:00+00:00 | Ends: 2025-10-31T17:00:00+00:00 | A pamphlet with links to LinkedIN Learning courses about communication and conflict.",
    "image": "https://se-images.campuslabs.com/clink/images/deca0529-fcc0-4b30-99a0-edac077a4177c35a94f6-5798-4dc8-9f88-8852d819cc81.png",
    "organization": "Cypress Hall",
    "location": "6th Floor Cypress Hall",
    "startsOn": "2025-10-01T16:00:00+00:00",
    "endsOn": "2025-10-31T17:00:00+00:00"
  },
  {
    "id": "campuslabs-11667244",
    "title": "TKE  Philanthropy",
    "url": "https://njit.campuslabs.com/engage/event/11667244",
    "source": "njit.campuslabs.com",
    "description": "TKE Philanthropy",
    "retrieved": "2025-10-01T18:30:00+00:00",
    "tags": [
      "athletics",
      "campuslabs",
      "events",
      "fraternity and sorority life",
      "philanthropy",
      "tabling",
      "tau kappa epsilon",
      "volunteering"
    ],
    "text": "TKE Philanthropy | Tau Kappa Epsilon | Green outside Campus Center | Starts: 2025-10-01T18:30:00+00:00 | Ends: 2025-10-01T20:00:00+00:00 | TKE Philanthropy",
    "image": "https://se-images.campuslabs.com/clink/images/78791bc5-97dc-4175-a21f-2bc03f2a1171feb3e4a9-d428-4698-b0fc-bc61ed099064.png",
    "organization": "Tau Kappa Epsilon",
    "location": "Green outside Campus Center",
    "startsOn": "2025-10-01T18:30:00+00:00",
    "endsOn": "2025-10-01T20:00:00+00:00"
  },
  {
    "id": "campuslabs-11667243",
    "title": "TKE  Philanthropy",
    "url": "https://njit.campuslabs.com/engage/event/11667243",
    "source": "njit.campuslabs.com",
    "description": "TKE Philanthropy",
    "retrieved": "2025-10-01T18:30:00+00:00",
    "tags": [
      "athletics",
      "campuslabs",
      "events",
      "fraternity and sorority life",
      "philanthropy",
      "tabling",
      "tau kappa epsilon",
      "volunteering"
    ],
    "text": "TKE Philanthropy | Tau Kappa Epsilon | Green outside Campus Center | Starts: 2025-10-01T18:30:00+00:00 | Ends: 2025-10-01T20:00:00+00:00 | TKE Philanthropy",
    "image": "https://se-images.campuslabs.com/clink/images/78791bc5-97dc-4175-a21f-2bc03f2a1171feb3e4a9-d428-4698-b0fc-bc61ed099064.png",
    "organization": "Tau Kappa Epsilon",
    "location": "Green outside Campus Center",
    "startsOn": "2025-10-01T18:30:00+00:00",
    "endsOn": "2025-10-01T20:00:00+00:00"
  },
  {
    "id": "campuslabs-11707459",
    "title": "Shpetina",
    "url": "https://njit.campuslabs.com/engage/event/11707459",
    "source": "njit.campuslabs.com",
    "description": "Attend our networking event in collaboration with industry professionals who will share their experience in the field. Expect a great group of panelists and conversations that spark interest and unlock a myriad of possibilities. Sponsored by: SWE, AIChE, and SHPE",
    "retrieved": "2025-10-01T18:30:00+00:00",
    "tags": [
      "american institute of chemical engineers",
      "campuslabs",
      "events",
      "thoughtfullearning"
    ],
    "text": "Shpetina | American Institute of Chemical Engineers | CKB 106 | Starts: 2025-10-01T18:30:00+00:00 | Ends: 2025-10-01T20:00:00+00:00 | Attend our networking event in collaboration with industry professionals who will share their experience in the field. Expect a great group of panelists and conversations that spark interest and unlock a myriad of possibilities. Sponsored by: SWE, AIChE, and SHPE",
    "image": "https://se-images.campuslabs.com/clink/images/016c357f-337e-43f8-b20d-d22b472b507696eff437-be7b-407f-b372-f990cc9d39fd.png",
    "organization": "American Institute of Chemical Engineers",
    "location": "CKB 106",
    "startsOn": "2025-10-01T18:30:00+00:00",
    "endsOn": "2025-10-01T20:00:00+00:00"
  },
  {
    "id": "merit-based-scholarships",
    "title": "Merit-Based Scholarships | Financial Aid",
    "url": "https://www.njit.edu/financialaid/merit-based-scholarships",
    "source": "www.njit.edu",
    "description": "NJIT Launches ScholarshipUniverse : A Scholarship-Matching Tool for Students It's time for your hard work to start paying off your school bills. As an NJIT student, you'll be eligible for dozens—or even hundreds—of merit-based scholarships from the university, the state of New Jersey, and other sour",
    "retrieved": null,
    "tags": [
      "academic",
      "professional",
      "job",
      "scholarship",
      "financial",
      "finance",
      "grant",
      "study",
      "education",
      "career",
      "lab",
      "science",
      "resume",
      "culture",
      "visa",
      "tuition",
      "sports",
      "community",
      "housing",
      "resident",
      "engineering",
      "technology",
      "design"
    ],
    "text": "NJIT Launches ScholarshipUniverse : A Scholarship-Matching Tool for Students It's time for your hard work to start paying off your school bills. As an NJIT student, you'll be eligible for dozens—or even hundreds—of merit-based scholarships from the university, the state of New Jersey, and other sources such as corporations and private donors. Plus, we make it easy on you by automatically considering you for all awards for which you are eligible. Each year, your academic records will be reviewed to determine your eligibility. Most merit-based scholarship programs require that you be enrolled full time and maintain a minimum GPA of 3.0. Freshmen who are offered scholarships must acknowledge acceptance by submitting their tuition deposits by May 1. If you continue to meet the criteria for your scholarships, you will get a renewable award letter beginning in June. Please be advised that your scholarships may be reduced if total grants and scholarships exceed actual charges on your student bill. Student bills are delivered early August for the upcoming Fall semester. New Jersey Residents Out-of-State Residents All Students Outside Scholarships Scholarship Profile Template can be found here . New Jersey Residents Governor's Urban Scholarship ($1,000) The New Jersey Higher Education Student Assistance Authority awards this scholarship to high-achieving students who reside in high-need communities. You must be a New Jersey resident to be eligible. Contact Student Financial Aid Services at finaid@njit.edu or the New Jersey Higher Education Assistance Authority at 609-584-4480. New Jersey World Trade Center Scholarship The New Jersey Higher Education Student Assistance Authority awards this scholarship to dependent children and surviving spouses of New Jersey residents who were killed in or who died as a result of the terrorist attacks against the United States on September 11, 2001 or who died as a result of illness caused by exposure to the attack sites. Contact Student Financial Aid Services at finaid@njit.edu or the New Jersey Higher Education Assistance Authority at 609-584-4480. Law Enforcement Officer Memorial Scholarship The New Jersey Higher Education Student Assistance Authority awards this scholarship to dependent children of New Jersey law enforcement officers killed in the line of duty. Contact Student Financial Aid Services at finaid@njit.edu or the New Jersey Higher Education Assistance Authority at 609-584-4480. Out-of-State Students NJIT awards are available to academically talented non–New Jersey residents who enter the university as freshmen. You must be a U.S. citizen or a permanent resident to be eligible. Contact Student Financial Aid Services at finaid@njit.edu or Admissions at admissions@njit.edu . Scholarships for Veterans The AFCEA Educational Foundation offers academic support to U.S. military personnel through merit-based scholarships of varying amounts. These include the AFCEA Afghanistan and Iraq War Veterans Scholarship and the Disabled War Veterans Scholarship. The scholarships are open to active-duty uniformed military service members; honorably discharged U.S. military veterans, including reservists and National Guardsmen; and disabled veterans. Applicants must be U.S. citizens and sophomores or juniors enrolled in an eligible degree program and have at least a 3.0 GPA.\" To apply go to: https://www.afcea.org/war-veterans All Students National Merit Scholarship ( tuition & fees ) This is a four-year scholarship awarded to students who have been selected by the National Merit Scholarship Corporation (NMSC) as finalists in the National Merit Scholarship Academic Program, an academic competition for recognition and scholarships. To enter the competition, a student must be either a U.S. citizen or a U.S. lawful permanent resident (intending to become a U.S. citizen at the earliest opportunity allowed by law); take the PSAT/NMSQT® in the specified year of the high-school program; and be enrolled full time in high school and planning to enroll full time in college immediately upon graduation. To maintain eligibility, you must be enrolled full time and maintain a minimum GPA of 3.0. The purpose of this scholarship is to cover tuition and fees minus other tuition based awards.. Contact Student Financial Aid Services at finaid@njit.edu or Admissions at admissions@njit.edu . Honors Merit Awards ( up to tuition & fees ) You must be accepted into the Albert Dorman Honors College to be eligible for this award. Contact the Albert Dorman Honors College at honors@njit.edu . Honors Residential Scholarship ( from $500 up to full housing & food ) You must be accepted into the Albert Dorman Honors College and reside on campus to be eligible for this award. Contact the Albert Dorman Honors College at honors@njit.edu . Faculty Scholarships (up to tuition minus other tuition-based award) These are NJIT scholarships awarded to freshmen on behalf of the NJIT faculty. You must apply for Admission to be considered for this scholarship. To remain eligible for this scholarship, you must be continuously enrolled as a full-time student, earn a minimum GPA of 3.0 (3.2 for Honors students), and be making Satisfactory Academic Progress (SAP). This award is a four 4 year scholarship (three-year for accelerated students; five-year for Architecture students) to fund your first undergraduate degree. Please be advised that, in the future, this scholarship may be replaced with funds of equal value from an NJIT scholarship donor or reduced by other sources of aid. When a combination of your scholarships and other awards exceed your charges on your student bill the package may be reduced to correct an over award. Bills will be released early August for the Fall semester and December for the Spring semester. Dean's Scholarship (fund a prescribed amount of tuition and fees) The Dean's Scholarship has been awarded to you based upon your academic achievements. To remain eligible for this scholarship, you must maintain continuous full time enrollment, have a minimum GPA of 3.0, maintain Satisfactory Academic Progress (SAP), and adhere to University Code on Academic Integrity. You are also required to complete a Free Application for Federal Student Aid (FAFSA). This award is a four-year scholarship. Please be advised that, in the future, this scholarship may be replaced with funds of equal value from an NJIT scholarship donor or reduced by other sources of aid when applicable. The purpose of this award is to help reduce tuition and fee costs. If you do not meet the scholarship criteria for renewal, you will only have one chance to appeal. Athletics Scholarships ( variable ) These scholarships are awarded to qualified students who participate in NJIT's intercollegiate sports. You can obtain information about athletic scholarships by contacting the NJIT Athletic Department at 973-596-5730. Academic Department Scholarships ( variable ) These scholarships are awarded by departmental scholarship committees to students with outstanding academic records. Contact Student Financial Aid Services at finaid@njit.edu . Architecture Design Competition Scholarships ( half- to full-tuition awards ) This is a five-year scholarship for freshmen, sponsored by the New Jersey School of Architecture . Annual Scholarships from Other Sources ( variable ) Several dozen of private scholarships have been made available to students on an annual basis by companies and individuals. Eligibility varies according to the donor's wishes, and not all scholarships are renewable. To find out more about these scholarships, contact Student Financial Aid Services at finaid@njit.edu . Merit Awards from Other Sources ( variable ) Endowed by NJIT alumni, these scholarships provide financial assistance on the basis of academic performance, leadership, choice of major, or other specific criteria determined by the donor. To find out more about these scholarships, contact Student Financial Aid Services at finaid@njit.edu . Endowments & Memorial Scholarships from Other Sources ( variable ) Hundreds of grants and scholarships have been endowed by a company or individual or are awarded in memory of a family member. Eligibility varies according to each donor's wishes. To find out more about these scholarships, contact Student Financial Aid Services at finaid@njit.edu . NJ Chapter of Professional Women in Construction Scholarship DEADLINE TO APPLY: THURSDAY, MARCH 23, 2023 The purpose of this scholarship is to support the next generation of women pursuing degrees in STEM, architecture, engineering, and construction-related industries., and who meet the below qualifications: Applicant must be a female high school senior or a full-time college or trade school student. College student eligibility requirement: one completed semester at an accredited college. Applicant must be enrolled to earn a degree or certificate in a STEM, architecture, engineering, or construction-related field. Applicant must be a New Jersey resident or be sponsored by a PWCNJ member or member firm. To apply complete the application click here PWC-NJ Scholarship Application or view their flyer . Harold B. and Dorothy A. Snyder Foundation Scholarship DEADLINE TO APPLY: Friday, March 14th, 2025 The purpose of this scholarship is to provide financial assistance to undergraduate students in their junior or senior year who are majoring in Construction Management Technology or Construction Engineering Technology, or graduate students who are pursuing a Master’s Degree in Civil Engineering or Architecture with a specialization in Construction Engineering, and who meet the below qualifications: Must be a full-time junior or senior majoring in CMT, CET, CE, or a graduate student pursuing a masters in either Civil Engineering or Architecture with a specialization in Construction Engineering. Must demonstrate financial need Must be an exceptional student, maintaining a minimum GPA of 3.0 Preference given to students who are likely to reciprocate and give back once they have established successful careers Must be a United States citizen or the holder of a visa or green card who can demonstrate their plan to eventually attain U.S. citizenship Must be a person of exemplary character, honesty, integrity, and possess a serious sense of purpose and a sense of personal accountability and responsibility to others. To apply complete the application click here Snyder Foundation Scholarship Application Once you complete the application, forward a completed application plus accompanying materials to Pat Zappone, Donor Relations Coordinator, at pat.zappone@njit.edu William S Guttenberg '44 Endowed Scholarship Purpose: To provide a $2500 scholarship to be used toward tuition, books, course materials, supplies, & equipment, fees and/or housing for each qualified student. The scholarship will be renewable for 4 years as long as the student meets the academic requirements of the scholarship. Qualifications Pertaining to Recipients: The primary recipients of the scholarships should be students from New Jersey who are physically challenged. Secondary recipients are to be from Paterson New Jersey, preferably from Eastside or Kennedy High School or another inner-city high school. Tertiary recipients are students who lost a parent in the September 11 terrorist attack. If no eligible student is found who meets the first three initial requirements, students from inner-city high schools who participate in the Educational Opportunity Program or the Honor's College may be considered. How to apply: Contact the EOP or Honor's College department and indicate your interest in the scholarship. Construction Roundtable Annual Scholarship Qualifications: Enrolled at a County or Community College or other college and accepted as a first-semester junior standing or equivalent credit hours in a New Jersey four-year college or university OR already attending a four-year college or university in New Jersey as a rising junior. Pursuing a degree in a construction-related field (engineering, architecture, construction management, and/or design). Possess a minimum 3.00 cumulative grade point average on a 4.0 scale. Be enrolled as a full-time student. Be interested in pursuing a career in the construction industry. U.S. citizen or eligible to work in the U.S. Scholarship recipients will be required to submit progress reports at the end of each academic year indicating that their grades have been maintained. Requirements: Submit to : Pat Zappone, Donor Relations Coordinator Application Form : Construction Roundtable Annual Scholarship Application Application Deadline: June 30, 2025 Please note that for your application to be considered complete, you must include the following materials: Application form Candidate statement (250 words or less) Recommendation letter from a faculty member Transcripts (unofficial transcripts are acceptable) Resume or summary of work history (1 page) NOTE: Pat Zappone's Email address is: pat.zappone@njit.edu ; Phone number: (973) 596 - 2660 NEW JERSEY ASSOCIATION OF CONSERVATION DISTRICTS MEMORIAL CONSERVATION SCHOLARSHIP Purpose of Scholarship: To encourage and support qualified students to pursue a career in a field related to the conservation and management of natural resources. Qualifications Pertaining to Recipient(s): Must be a New Jersey Resident Must be a full time student in good standing at an accredited college (not necessarily in NJ) Must have successfully completed, or will complete by the scholarship award date, at least four full semesters of study Must be an undergraduate enrolled in a curriculum major of agriculture or natural resource conservation, including agronomy, soil science, plant science, forestry, geography, agricultural education, environmental science, wildlife or fisheries management, environmental engineering, agricultural/resource economics or other major related to conservation. Application Form: NJACD Memorial Conservation Scholarship Deadline: May 6, 2019 The Peter A. Jensen Endowed Memorial Scholarship Purpose of Scholarship: To provide financial assistance (tuition and fees) to two students who are active in Greek Life and campus activities. Qualifications Pertaining to Recipient(s): Must be active in Greek Life. Must be active in additional campus activities. Financial need will be taken into consideration. Understandings Pertaining to the Administration of Scholarship (for internal control and administration use): The recipient will be selected by a committee of Pi Kappa Phi Alumni selected by the Chapter. The Director of Financial Aid must concur. Qualified candidates may submit an email of interest with attached resume to: Kkline@njit.edu Port Authority Hispanic Society 2022 Book Award Application​ Scholarship Purpose of Scholarship: 2022 Elizabeth Reyes - Book Award Scholarship is to help students pay for college textbooks Qualifications Pertaining to Recipient(s): Enrollment in a full-time accredited university or college for the 2022-2023 academic year. Demonstrate outstanding academic performance by submitting a copy of an unofficial transcript with a GPA average of a B or 3.0 (on a 4.0 scale). Theme Essay- Please submit an essay (up to 250 words) about someone you admire and why. Personal Essay- Please submit an essay (500 words) about your professional aspirations and goals, such as where you would expect to be in five years, how your degree(s) can impact your future, and/or what your dream job is. Provide two professional letters of recommendation from an academic, employment and/or volunteer reference. Resume Signed Agreement Application Form: Port Authority Hispanic Society 2022 Book Award Application​ Deadline: August 31, 2022 SOCIETY OF AMERICAN MILITARY ENGINEERS: NJ SAME Scholarship Opportunity Purpose of Scholarship: To encourage and support qualified students to pursue a career in a field related to the conservation and management of natural resources. Qualifications Pertaining to Recipient(s): Must be a New Jersey Resident Must be a U.S Citizen Must be a full time student in good standing Must be an undergraduate enrolled in a major associated with STEM Must have a minimum 2.50 cumulative grade point average on a 4.0 scale Must be a sophomore or higher Application Form: NJ SAME Scholarship Opportunity Deadline: March 14, 2025 Aid for Physically Handicapped Students: William S Guttenberg '44 Endowed Scholarship Purpose: To provide a $2500 scholarship to be used toward tuition, books, course materials, supplies, & equipment, fees and/or housing for each qualified student. The scholarship will be renewable for 4 years as long as the student meets the academic requirements of the scholarship. Scholarship Criteria: NJ Students who are physically handicapped between the ages of 16-20 years old. How to apply: Please complete the Guttenberg Scholarship Application and submit to the Admissions Office. Aid for Special Circumstances: William S Guttenberg /44 Endowed Scholarship Purpose: To provide a $2500 scholarship to be used toward tuition, books, course materials, supplies, & equipment, fees and/or housing for each qualified student. The scholarship will be renewable for 4 years as long as the student meets the academic requirements of the scholarship. Scholarship Criteria: Student who lost a parent on the September 11, 2011 terrorist attack. How to apply: Please complete the Undergraduate Scholarship Application and submit it to the Financial Aid Office. Levendusky Alumni Scholarship: How to apply: Complete the application here Outside Scholarships We encourage all of our students to seek additional outside scholarship opportunities to finance there education at NJIT. To search for outside scholarship opportunities, you can look to your community organizations and foundations or access these search engines for additional scholarship resources: Bestcolleges.com (Hispanics and Latino/a Students) CareerOneStop.org CBCF.org CollegeBoard.org CollegeExpress.com CollegeNet.com CollegeScholarships.org Federal Employee Education & Assistance Fund FastWeb.com FinAid.org HSF.net LatinoCollegeDollars.org Scholarships.com StudentScholarshipSearch.com SuperCollege.com UNCF.org​"
  },
  {
    "id": "scholarship-universe-njit",
    "title": "Scholarship Universe | Financial Aid",
    "url": "https://www.njit.edu/financialaid/scholarship-universe-njit",
    "source": "www.njit.edu",
    "description": "All Scholarship opportunities in one place!",
    "retrieved": null,
    "tags": [
      "scholarship",
      "financial",
      "education",
      "software"
    ],
    "text": "In an effort to improve educational accessibility and affordability, Student Financial Aid Services began the process of providing relevant, trusted external scholarship opportunities to you using new software, Scholarship Universe. This is an initiative that will allow you to maximize your scholarship award opportunities while allowing you to continue your goal of achieving an NJIT degree. About Scholarship Universe Scholarship Universe is an online portal intended to reduce “scholarship search fatigue” by bridging students to vetted scholarship opportunities through an adaptive matching engine, which identifies relevant scholarships based on individual student's personal information, needs, and eligibility. Based on information submitted to build the student's personalized Scholarship Universe profile, students will be able to review a customized list of scholarship opportunities that they qualify for, learn the dollar value of matched opportunities, and directly connect and submit online applications with organizations offering those scholarships. Steps to apply for External Scholarships: Log in to the platform from this link: https://njit.scholarshipuniverse.com (Use UCID and Password to log in to the system. If you have not already claimed your UCID, we urge you to create your University Computing Identification (UCID) as soon as possible so that you will be able to access NJIT's Scholarship Universe portal. For details on how to set up your UCID, please go to: http://ist.njit.edu/ucid ) Upon answering some profile questions at the dashboard, the system will match your profile with the criteria from the external scholarship opportunities. Review the vetted list of external scholarship opportunities and total dollar value for each scholarship opportunity. Go to the Scholarship Tile from the options on the left of the screen View Eligible Scholarships to apply in the Matches section Click on Apply to begin the Scholarship application process You will be directed to the specific external scholarship page to apply for the scholarship External scholarship agency will contact you directly if selected Students should take care of the following: Be sure to update your profile frequently (such as GPA, Major, etc.) to get matched to all the eligible scholarships in a better way. Be sure to answer ALL the questions in order to build your profile which would match you to the most relevant scholarships. Make sure to complete the outstanding tasks to be considered without any delays. If you still have any questions, please go through our FAQs or contact Student Financial Aid Services at finaid@njit.edu or 973-596-3479."
  },
  {
    "id": "research",
    "title": "Research | Research",
    "url": "https://research.njit.edu/research",
    "source": "research.njit.edu",
    "description": "Research at NJIT is at the very center of university life. It is integrated into everything we do, from recruitment of new faculty to proliferation of research opportunities for our students.",
    "retrieved": null,
    "tags": [
      "research",
      "academic",
      "professional",
      "international",
      "scholarship",
      "funding",
      "education",
      "lab",
      "data science",
      "science",
      "computer",
      "resident",
      "engineering",
      "data science",
      "cybersecurity",
      "technology",
      "innovation"
    ],
    "text": "The Office of Research provides institutional support and services, as well as fosters new opportunities to enhance NJIT research and scholarship enterprise engaging faculty, staff, students, external collaborators and partners for developing strong leadership and synergy. We are committed to providing interdisciplinary research and scholarship with the utmost professional integrity. Foundation Board of Directors Excellence in Research Prize and Medal The Excellence in Research Prize and Medal is awarded in recognition of a sustained record of contributions that have enhanced the reputation of NJIT. The NJIT Foundation Board of Directors is proud to award Bharat Biswal , distinguished professor of biomedical engineering. Previous Prize and Medal Recipients Highest NJIT Earns Highest Research Rating (R1) $167M total research expenditures in FY2023 Through our many funding opportunities, we're enhancing NJIT's research enterprise. NJIT Research: Linking Laboratories to Lives Resources Funding Opportunities For Researchers Intellectual Property & Commercialization York Center for Environmental Engineering and Science Center for Translational Research Quick Links Office of the Senior Vice Provost for Research Research Compliance Research Policies Undergraduate Research and Innovation Faculty Awards Initiative Research Funding Opportunity: Pivot-RP Contacts NJIT Research Magazine An overview of our growing materials science and engineering cluster, where engineers, physicists, mathematicians and chemists collaborate on projects that blur the borders of all of these disciplines. Read the magazine | View our research publications | Research News Research is an integral part of a strong academic experience and a critical priority in NJIT’s 2025 Strategic Plan. The university aims for national and international prominence in research through new discoveries in areas ranging from medical sensors and devices to robotics, to nanotechnology, to cybersecurity, to next-generation materials, among other topics of vital importance in basic, applied and translational research. Our research enterprise is comprised of core and transdisciplinary basic, applied and translational research interests through five research clusters: Bioscience and Bioengineering Bioscience and Bioengineering Learn More Data Science and Management Data Science and Management Learn More Environment and Sustainability Environment and Sustainability Learn More Material Science and Engineering Material Science and Engineering Learn More Robotics and Machine Intelligence Robotics and Machine Intelligence Learn More National Academy of Inventors Chapter at NJIT National Academy of Inventors Chapter at NJIT celebrates the outstanding innovation and invention contributions of faculty, staff, and students. To quote NAI President Dr. Paul Sanberg, “NAI is proud to have NJIT, a true innovation powerhouse, as part of our membership. [NJIT has] created an environment where research and innovation flourish in such diverse fields as bioengineering, chemistry, medicine, computer science, and much more.” As a Member Institution of the NAI, NJIT has the exclusive opportunity to recognize active researchers and faculty with success in patents, licensing and commercialization at the national level through the Fellows and Senior Members Program. Research with NJIT Research with NJIT is a collaborative effort by the New Jersey Economic Development Authority (NJEDA) and the Office of the Secretary of Higher Education (OSHE) to forge stronger connections between New Jersey’s research universities and industry. What Our Students Say We provide exceptional academic, research and innovation experience to students at all levels. “I was able to get research experience during my freshmen year, which is really cool.” Madhusan Duwadi Class of 2022 “I knew NJIT has a good reputation for research and knew it would be a worthwhile investment in myself to get a degree from NJIT. ” Carmel Rafalowsky Class of 2020 “I am gaining an excellent research experience at NJIT that is preparing me for my goal, which is to be a general surgeon.” Tinghan Zhao"
  },
  {
    "id": "bioscience-and-bioengineering",
    "title": "Bioscience and Bioengineering | Research",
    "url": "https://research.njit.edu/bioscience-and-bioengineering",
    "source": "research.njit.edu",
    "description": "This research cluster includes multidisciplinary research in the areas of biomedical devices, sensors and instrumentation, brain health & neuroscience, tissue engineering, biological sciences & behavior, molecular biology, evolutionary sciences, and gene therapy and phenotype related research.",
    "retrieved": null,
    "tags": [
      "research",
      "health",
      "data science",
      "science",
      "computer",
      "engineering",
      "data science"
    ],
    "text": "Researchers at NJIT are advancing our understanding of the functions of the brain and spinal cord under normal, injured and diseased states at molecular, cellular and functional levels through experimental, theoretical and computational methods. Imaging experts, computer scientists and biomedical engineers are working together, for example, to devise therapies and devices that will improve motor, cognitive and organ functions. To this end, our tissue engineers focus on replacing dysfunctional cells with regenerating cells and tissues. The Bioscience and Bioengineering cluster intersects with other research clusters including Material Science and Engineering, Robotics and Machine Intelligence and Data Science and Management in developing healthcare technologies and systems such as point-of-care medical sensors, devices and rehabilitation systems as well as healthcare information systems and management involving primary care, hospitals and emergency care resources and protocols. The scope of the proposed cluster includes areas that are aligned with the NSF’s 10 Big Ideas, and the National Academy of Engineering (NAE) and the National Academy of Sciences (NAS) Grand Challenges in “Reverse Engineering of the Brain,” “Tools for Scientific Discovery,” “Understanding the Rules of Life: Predicting Phenotype” and “Engineering Better Medicine.”"
  },
  {
    "id": "data-science-and-management",
    "title": "Data Science and Management | Research",
    "url": "https://research.njit.edu/data-science-and-management",
    "source": "research.njit.edu",
    "description": "This research cluster includes the study and practice of data science and analytics, and extracting information and knowledge from data that can be used for medical, financial, business management scientific and engineering applications. These groups conduct research on bioinformatics, medical informatics, image processing, data mining, solar-terrestrial physics,",
    "retrieved": null,
    "tags": [
      "research",
      "finance",
      "health",
      "data science",
      "science",
      "global",
      "software",
      "engineering",
      "data science",
      "cybersecurity",
      "technology",
      "design"
    ],
    "text": "The cybersecurity group designs secure cyber systems and improves cyber information and communications technology (ICT). ICT is shaping many aspects of society as the economy evolves rapidly, providing access to unprecedented amounts of information, anytime and anywhere, from any type of device. By 2025, the number of global IoT (internet of Things) connections will increase from 12 billion in 2020 to more than 30 billion according to an estimate by IoT Analytics. Global spending on security hardware, software and services is estimated to almost reaching $175 billion by 2024, according to Statista. This cluster with a broader transdisciplinary scope with diverse applications also includes multidisciplinary research centers focused on mathematical sciences, transportation systems, additive manufacturing and wireless communications technology and industry and business management, as well as on the societal impacts of science and technology. The Data Science and Management cluster spans over all other research clusters including Bioscience and Bioengineering, Environment and Sustainability, Material Science and Engineering and Robotics and Machine Intelligence for developing data driven approaches in almost all applications from healthcare information systems to industry automation, and to finance and business management. NAE and NAS Grand Challenges and NSF Big Ideas within the scope of this cluster include “Secure Cyberspace”, “Advance Personalized Learning”, “Enhance Virtual Reality” “Restore and Improve Urban Infrastructure”, “Engineer the Tools of Scientific Discovery”, and “The Future of Work at the Human-Technology Frontier”, “Harnessing the Data Revolution”, “Growing Convergence Research” and “The Quantum Leap: Leading the Next Quantum Revolution”."
  },
  {
    "id": "environment-and-sustainability",
    "title": "Environment and Sustainability | Research",
    "url": "https://research.njit.edu/environment-and-sustainability",
    "source": "research.njit.edu",
    "description": "The Environment and Sustainability cluster intersects with other research clusters including Material Science and Engineering, Robotics and Machine Intelligence and Data Science and Management in developing smart and green buildings and sustainable communities, understanding space weather and climate changes.",
    "retrieved": null,
    "tags": [
      "research",
      "data science",
      "science",
      "global",
      "engineering",
      "data science",
      "technology"
    ],
    "text": "This cluster represents interdisciplinary research areas in urban ecology, space weather, solar terrestrial, environmental sensors, sustainable infrastructure, intelligent transportation systems, global climate change, biodiversity and conservation, clean water, waste management, renewable energy, and smart grid systems. The urban ecology and sustainability area emphasizes sustainable infrastructure, smart transportation, ecological communities, and urban modeling and simulation. Space weather sciences and impact of evolutionary changes in the solar system impacts directly our environmental ecosystem and global climate changes. This area also focuses on the water-energy nexus and the impact of ocean levels on the environment, as well as the development of technologies to clean water and to provide green energy, such as biofuel cells and powerful, long-lasting batteries. The Environment and Sustainability cluster intersects with other research clusters including Material Science and Engineering, Robotics and Machine Intelligence and Data Science and Management in developing smart and green buildings and sustainable communities, understanding space weather and climate changes. NAE and NAS Grand Challenges and NSF Big Ideas within the scope of this cluster include “Solar Energy”, “Restore and Improve Urban Infrastructure”, “Access to Clean Water”, “Provide Energy from Fusion”, “Develop Carbon Sequestration Methods”, and “The Future of Work at the Human-Technology Frontier”, “Navigating the New Arctic” and “Windows on the Universe”."
  },
  {
    "id": "robotics-and-machine-intelligence",
    "title": "Robotics and Machine Intelligence | Research",
    "url": "https://research.njit.edu/robotics-and-machine-intelligence",
    "source": "research.njit.edu",
    "description": "This research cluster includes human machine interface, cyber-human systems, robotics: bioinspired, medical, social and industrial autonomous systems, intelligent infrastructure, artificial intelligence, machine learning, and augmented and virtual reality. Robotics and bioinspired autonomous systems are making a significant impact in the society in many areas including",
    "retrieved": null,
    "tags": [
      "research",
      "finance",
      "health",
      "education",
      "data science",
      "science",
      "networking",
      "engineering",
      "data science",
      "technology"
    ],
    "text": "The artificial intelligence and augmented/virtual reality applications have been evolving rapidly with the futuristic vision for new modes of automation, discoveries, social networking and even co-evolution of machine and human intelligence making important decisions in our daily life from finance to healthcare. The Robotics and Machine Intelligence cluster also interacts with other research clusters including Bioscience and Bioengineering, Environment and Sustainability, Material Science and Engineering and Data Science and Management in developing smart automation and navigation systems, smart healthcare information systems, intelligent adaptative and data-driven automations in additive manufacturing systems, and intelligent systems for almost every application from education and learning to smart cities and living-assist systems. NAE and NAS Grand Challenges and NSF Big Ideas within the scope of this cluster include “Advance Personalized Learning”, “Enhance Virtual Reality” “Restore and Improve Urban Infrastructure”, “Engineer the Tools of Scientific Discovery”, and “The Future of Work at the Human-Technology Frontier”, “Harnessing the Data Revolution”, “Growing Convergence Research” and “The Quantum Leap: Leading the Next Quantum Revolution”."
  },
  {
    "id": "undergraduate-research-and-innovation-uri-program",
    "title": "Undergraduate Research and Innovation (URI) Program | Undergraduate Research and Innovation",
    "url": "https://research.njit.edu/uri/undergraduate-research-and-innovation-uri-program",
    "source": "research.njit.edu",
    "description": "We encourage all undergraduate students to review various URI programs and opportunities to enhance their skills to become the future innovative leaders in our global society.",
    "retrieved": null,
    "tags": [
      "research",
      "academic",
      "financial",
      "grant",
      "education",
      "workshop",
      "lab",
      "linkedin",
      "global",
      "skills",
      "peer",
      "resident",
      "engineering",
      "technology",
      "innovation",
      "design"
    ],
    "text": "Call for Proposals Undergraduate Research and Innovation (URI) Student Seed Grants Program: Fall 2025 URI Phase-1 Student Seed Grants: $500 per project URI Phase-2 Student Seed Grants: $3,000 per project URI Student Seed Grant Program Tracks: Track-1 Technology/Product Development and Innovation Track-2: Application Based Research Information Session Hosted by URI External Advisory Board Members (Information Session on Proposal Writing, Review Criterion and Submission) September 24, 2025; 2.30 PM to 4.00 PM; Campus Center Ballroom A (Light refreshments will be served) RSVP Here Proposal Online Submission Deadline: October 22, 2025 Apply here: https://njit.infoready4.com/#research (Please log in using NJIT UCID) NJIT 2030 Strategic Plan emphasizes providing undergraduate students an outstanding education integrated with research and innovation experience to enable them to succeed and take leadership roles in the society. The Undergraduate Research and Innovation (URI) program has evolved as a significant part of the education and research experience at NJIT. The URI website http://centers.njit.edu/uri/ summarizes undergraduate research and innovation opportunities with information about resources and competitions. We are pleased to announce the Undergraduate Research and Innovation (URI) Student Seed Grant program. URI Phase-1 Student Seed Grants provide $500 per project to pursue preliminary research or demonstrate an initial proof-of-concept/prototypes. URI Phase-2 Student Seed Grants provide up to $3,000 per project to further pursue application-based research or develop a complete technology development prototype. Phase-2 proposals may be submitted by former Phase-1 Student Seed Grant winners who have completed Phase-1 work, as well as new students who have a research or product idea that has shown the preliminary proof of concept, market assessment or application-based research to establish the need, significance and basic approach. The student should prepare URI Student Phase-1 or Phase-2 Seed Grant proposals following the templates with format and guidelines. Funds can only be used to order project supplies and prototyping. They cannot be combined with any other indices. There will be a deadline to order. Any items not received and approved by the deadline will not be purchased. Shipping costs must be included in the total amount. All orders must be received by February 15, 2026. Any order not received by then will be canceled. All project proposals must be submitted by October 22, 2025. Awardees will have access to funds to start the project as early as early December and will formally present a progress report at the subsequent URI workshops. Each student team awardee is required to take a lab safety training (and a biosafety training, if applicable) if awarded a seed grant, you will be asked to upload documentation before receiving funds. Proposal Submission Deadlines Students working with an NJIT tenure / tenure track faculty member may submit Track-1 Technology/Product Development and Innovation or Track-2: Application Based Research proposals in the required format by October 22, 2025. Proposal Format Guidelines information are here and on the URI website. Submit the application via InfoReady using the link above by October 22, 2025. You must log-in using your UCID to access. You will need to have your research proposal ready to upload for final submission. Please save it as a pdf in the following format - Lastname_PhaseX_Title.The X should be replaced with a 1 or 2. Finalists selected for the URI workshop presentation will be announced in early November 2025. Finalists are required to present their project with a PowerPoint presentation to the External Advisory Board following the presentation format posted on the website at the URI Workshop on November 19, 2025 at the Campus Center Ballroom B from 2:00 PM to 4:30 PM. Presentation templates can be found here URI Board Members Brian Kiernan, Angel Investor, Executive VP and Chief Scientist (ret), InterDigital Communications Corp. ( https://www.linkedin.com/in/brian-kiernan-a5636b11/ ) Govi Rao, CEO, Phase Change Solutions, Co-Founder, Carbon Group Global ( https://www.linkedin.com/in/govirao/ ) Daniel Henderson, Serial Innovator and Entrepreneur, NJIT Board of Overseers, Joint Chief Executive Officer, Volobocce, LLC ( https://www.linkedin.com/in/daniel-a-henderson/ ) Marc Long, PhD, Vice President, Research & Development, MTF Biologics ( https://www.linkedin.com/in/marc-long-3bbb833/ ) Pallavi Madakasira, Managing Consultant, Eunomia Research & Consulting ( https://www.linkedin.com/in/pallavi-madakasira-3418aa/ ) Alfredo Matos, President and CEO, A Z Matos, LLC ( https://www.linkedin.com/in/alfredo-al-matos-bs-msee-mba-47abb627/ ) Peggy McHale, Principal, Pandi LLC ( https://www.linkedin.com/in/peggymchale/ ) Pete Mendonez, Jr., President & COO, PearlX ( https://www.linkedin.com/in/pete-mendonez-jr-26a11a13/ ) Liz Miller, President, Summit Place Financial Advisors, LLC ( https://www.linkedin.com/in/liz-miller-cfa-cfp-5100096/ ) Harry Moore, Jr., President, Gray Beard Solutions LLC graybeardsolutionsllc@gmail.com Manish Patel, CEO, TrickyWater LLC ( www.trickywater.com ) ( https://www.linkedin.com/in/manish-patel-innovate/ ) Sabbir Rangwala, President, Patience Consulting ( https://www.linkedin.com/in/sabbir-rangwala/ ) Shashi Patel, Manager – Engineering, PSEG ( https://www.linkedin.com/in/shashikant-patel-1073161b/ ) URI programs provide students opportunities to learn necessary and important skills to research and innovate to take a leadership role in the society. These programs are designed to help student develop vision and strategic planning skills to address current and forthcoming global challenges. As STEM initiative is now appropriately complemented with arts (called as STEAM) to effectively develop an engaging perspective in design and also understanding the socio-economic impact, the URI programs are interdisciplinary and available to students from all majors encouraging them to network and learn skills to understand diversity and teamwork through peer interactions. URI programs also allow students to understand current and future needs and challenges of high societal impact to find solutions to address them with new products, design or services in the global market. Ideas to find a plausible solution are naturally generated by human beings. However, the skills to develop a vision to transform those ideas into innovation for implementation in the real-world is learned and nurtured though carefully designed academic and research programs. URI programs provide students an environment to explore and research their ideas and to interact with real-world experts to understand roadmaps associated with research and design future technologies. Student can also learn how to understand market trends so that they can re-think their solutions and learn pathways towards developing a successful product, design or service. With innovative research, they can lead to new discoveries and enhancement of knowledge towards developing a productive foundation for future technologies."
  },
  {
    "id": "services",
    "title": "Services Available to Students | Counseling Center",
    "url": "https://www.njit.edu/counseling/services",
    "source": "www.njit.edu",
    "description": "Psychological Counseling Confidential psychological counseling, short-term psychotherapy, and crisis intervention assist students with emotional, social, or family concerns, developmental transitions, or other stresses that can occur during their college years. Counseling services can also assist yo",
    "retrieved": null,
    "tags": [
      "academic",
      "professional",
      "health",
      "wellness",
      "mental health",
      "study",
      "education",
      "career",
      "lab",
      "skills",
      "counseling",
      "therapy",
      "stress",
      "resident",
      "mantra health",
      "uwill"
    ],
    "text": "Psychological Counseling Confidential psychological counseling, short-term psychotherapy, and crisis intervention assist students with emotional, social, or family concerns, developmental transitions, or other stresses that can occur during their college years. Counseling services can also assist you if you are concerned about these issues for a family member or friend. Many students benefit from counseling services at some time during their undergraduate and graduate college careers. Under some circumstances, for the small number of students needing medication to supplement counseling or psychotherapy, a part-time psychiatrist may also be available. Mantra Health NJIT has partnered with digital mental health provider Mantra Health to bring students access to free, high-quality mental health support. The Care Hub is an all-in-one platform where students can access free virtual services including self care, therapy, in-the-moment emotional wellness support, 24/7 crisis and more. Visit Mantra Health's Care Hub and use your school email address to set up your account. It's free, easy, and includes care navigation support. Sign up today Uwill With the generous support of the New Jersey Office of the Secretary of Higher Education, NJIT is pleased to partner with Uwill to offer all currently enrolled NJIT students free and unlimited teletherapy with a licensed mental health professional. This program is funded through Spring 2025. Students can register here and book their first session in just minutes using your NJIT email address. Academic Support Academic support counseling can help students set priorities, organize their time, manage stress, develop study and test-taking skills, and other coping strategies to meet their academic goals. Addiction Counseling Services and Referral For every person coping with, experiencing, or dealing with an addiction- whether it is dependency on drugs, alcohol, food, compulsive spending, gambling, sex, or an Internet addiction- at least six (6) other people in their lives can be directly affected. Without treatment intervention, substance, and behavioral addictions can persist even with the knowledge of negative health, academic, and social consequences. The addiction specialist can assist you in sorting out any questions or concerns that you may have about your addictive behaviors or someone else's. Confidential services include assessment, individual counseling, education, and referral to off-campus services when needed. Cross-Cultural/Multicultural Counseling NJIT is a university rich in cultural diversity and ranked 10th among national universities for campus diversity by U.S.News. The student body includes individuals from countries throughout the world as well as US citizens and permanent residents from a large number of racial, ethnic, religious, and cultural groups. C-CAPS staff is sensitive to cultural differences and any concerns that may arise. We strive to work sensitively with you and provide culturally appropriate treatment and services. LGBTQIA+ Services College is a time that many students begin to openly explore their sexual identity and discover and challenge their own beliefs and attitudes around sexual orientation and gender. For students searching for a safe, confidential place to explore questions, concerns, and traditional beliefs around sexual orientation sensitive and highly trained professionals will help you to address and examine these issues. Referral Services For more comprehensive or longer-term care, off-campus services may be needed. Students may also need information about off-campus resources for family or friends. We assist with referrals for psychotherapy, couple or family therapy, psychiatric services, alcohol/drug rehabilitation, etc. Most off-campus providers charge a fee, but some have low-fee options for those who lack insurance or have limited income. Also, self-help programs may be recommended to supplement C-CAPS services. Self-help programs are usually free."
  },
  {
    "id": "mantra-health-mental-health-wellness",
    "title": "Mantra Health-Mental Health & Wellness | Counseling Center",
    "url": "https://www.njit.edu/counseling/mantra-health-mental-health-wellness",
    "source": "www.njit.edu",
    "description": "Virtual student mental health and wellness services with Mantra Health",
    "retrieved": null,
    "tags": [
      "professional",
      "health",
      "wellness",
      "mental health",
      "lab",
      "skills",
      "therapy",
      "stress",
      "peer support",
      "self-care",
      "community",
      "peer",
      "mantra health"
    ],
    "text": "We’re thrilled to partner with digital mental health provider Mantra Health to bring NJIT students diverse, high-quality mental health support via the Care Hub. This all-in-one platform gives students access to the following free virtual services:* Self-Care These short, self-guided wellness courses can be accessed anytime, anywhere. Learn to reduce stress, regulate emotions, build healthier relationships, and endure difficult situations. Emotional Wellness Coaching This short-term, goal-oriented intervention is best for students wanting self-management strategies. You’ll get matched with a dedicated and experienced coach who will teach you key skills and work with you through 8-12 weeks of sessions. Peer-to-Peer Support with Togetherall Join a judgment-free, inclusive, confidential community of student peers powered by Togetherall. Therapy Enjoy one-on-one sessions with a dedicated, highly trained, culturally-informed provider who understands your unique experience and can help you assess and manage your mental health concerns. ConnectNow Support and problem-solving with a mental health professional. This service is available via video between 12 a.m. and 12 p.m. ET for students who are in distress or experiencing immediate mental health challenges. 24/7 Crisis Support Crisis support staff is available via phone to help students through challenging situations. However, if you or someone you know is having a mental health emergency and is putting themselves or others in danger, please call 911. Ready to get your care journey started? Visit Mantra Health’s Care Hub or download the app on Apple or Android . Use your school email address to set up an account. It’s free, easy, and includes care navigation support. If you have questions about the services or trouble accessing your account, contact Mantra Health at hi@mantrahealth.com or call 800-464-2083."
  },
  {
    "id": "uwill-mental-health-and-wellness-service",
    "title": "Uwill-Mental Health and Wellness Service | Counseling Center",
    "url": "https://www.njit.edu/counseling/uwill-mental-health-and-wellness-service",
    "source": "www.njit.edu",
    "description": "NJIT is pleased to announce an expansion of mental health services through a partnership with Uwill.",
    "retrieved": null,
    "tags": [
      "academic",
      "professional",
      "funding",
      "health",
      "wellness",
      "mental health",
      "education",
      "lab",
      "technical",
      "skills",
      "counseling",
      "therapy",
      "stress",
      "anxiety",
      "programming",
      "uwill"
    ],
    "text": "Through generous funding from the State of New Jersey Office of the Secretary of Higher Education, Uwill will offer all currently enrolled NJIT students free, immediate access to teletherapy and wellness programming through its easy to use online platform. Uwill also provides a direct connection for crisis services 24/7/365 by calling 833-646-1526. Uwill provides Telehealth counseling Counseling services at no cost for students A secure and convenient path to clinical services beyond C-CAPS's office hours, including evenings and weekends To schedule teletherapy Students can register here and book your first session in just minutes using your NJIT email address Choose a therapist based on your preferences including availability, issue, gender, language, ethnicity. You can also choose a time that fits your schedule with day, night and weekend availability. Access is quick and easy. Uwill is Private. Secure. Confidential. If you’re experiencing a mental health crisis Call 833.646.1526 for help 24/7/365 If you are experiencing a medical emergency, call 911. If you need any assistance, you can refer to the Uwill FAQ, Student User Guide, or reach out directly to Uwill at support@uwill.com . Frequently Asked Questions What is Uwill? Uwill is a leading mental health and wellness solution for colleges and students. Uwill provides free immediate access to teletherapy and mental health crisis support for students. How does it work? With Uwill, you have the ability to choose a therapist based on your unique needs and preferences (focus area, gender, language, ethnicity), at a time that fits your schedule (day, night, weekend availability), and by the appointment type preferred (video, phone, chat, message). Who is eligible? All enrolled NJIT students have access to Uwill. Is it free? Yes, Uwill is available free of charge. How do I get started? You can access the Uwill platform by clicking here and completing your profile using your NJIT email address and current location. After completing your profile, you can immediately schedule an appointment with a therapist of your choosing. Many students have their first session within hours of profile completion. What can a Uwill therapist help me with? Uwill therapists have a range of specialties and have extensive experience working with students. Many students utilize Uwill to help with mood changes, anxiety, stress, relationship difficulties, poor body image, academic challenges, and loneliness, among many other things. Who are the counselors available on the platform? The counselors in the Uwill network are all licensed mental health professionals with extensive clinical experience. Which treatment approaches do the counselors utilize? Counselors available on the Uwill platform take a solutions-oriented, holistic approach to treatment. Our therapists aim to work collaboratively with you to help you accomplish your goals through teaching tangible skills. This means that counselors focus on providing specific tools, coping skills, and resources to address the issues you are facing. Can I choose between video, phone, chat and message-based support? Yes, you work with your counselor and select the format that best suits you. The first session must be video or phone and then you can choose the modality based on your schedule and needs. Is it really private and secure? Yes, Uwill is HIPAA and FERPA compliant which means we follow the strictest privacy guidelines. We never share your data – even on anonymized basis – to any third party – without consent. What browser is best to access Uwill? For best performance, we recommend you use Chrome browser to access Uwill here. Can I change counselors? Yes, you can change your counselor at any time. Who do I reach out to for technical assistance? Uwill provides 24×7 technical support by email support@uwill.com or phone 833.99.Uwill (833.998.9455)."
  },
  {
    "id": "login",
    "title": "Uwill",
    "url": "https://app.uwill.com/login",
    "source": "app.uwill.com",
    "description": "",
    "retrieved": null,
    "tags": [],
    "text": ""
  },
  {
    "id": "loginutm_content=70utm_source=schoolsitereferralutm_medium=digitalutm_campaign=schoolsitereferralto=%2F%3Futm_content%3D70%26utm_source%3Dschoolsitereferral%26utm_medium%3Ddigital%26utm_campaign%3Dschoolsitereferral",
    "title": "Hub | Mantra Health",
    "url": "https://hub.mantrahealth.com/login?utm_content=70&utm_source=schoolsitereferral&utm_medium=digital&utm_campaign=schoolsitereferral&to=%2F%3Futm_content%3D70%26utm_source%3Dschoolsitereferral%26utm_medium%3Ddigital%26utm_campaign%3Dschoolsitereferral",
    "source": "hub.mantrahealth.com",
    "description": "Oh no! It looks like JavaScript is not enabled in your browser. Reload",
    "retrieved": null,
    "tags": [],
    "text": "Oh no! It looks like JavaScript is not enabled in your browser. Reload"
  },
  {
    "id": "facilities",
    "title": "Additional Tutoring Centers | The Learning Center",
    "url": "https://www.njit.edu/tlc/facilities",
    "source": "www.njit.edu",
    "description": "Additional Tutoring Centers at NJIT Math Tutoring Center Located in CKB G11 For more information and schedule, click here Chemistry Learning Center Located in CKB G12 For more information and schedule, click here The Writing Center Located in CKB G17 For more information and schedule, click here. YW",
    "retrieved": null,
    "tags": [],
    "text": "Additional Tutoring Centers at NJIT Math Tutoring Center Located in CKB G11 For more information and schedule, click here Chemistry Learning Center Located in CKB G12 For more information and schedule, click here The Writing Center Located in CKB G17 For more information and schedule, click here. YWCC Tutoring Located in GITC 3700 For more information and schedule, click here Physics Tutoring Located in CKB G12 For more information and schedule, click here School of Management Tutoring Located in CAB 3028 For more information and a link to schedule, click here For other resources: Screenshot 2025-05-19 090255.png"
  },
  {
    "id": "indexphp",
    "title": "The Norma J. Clayton '81 Learning Center | The Learning Center",
    "url": "https://www.njit.edu/tlc/index.php",
    "source": "www.njit.edu",
    "description": "Welcome On behalf of the staff in The Norma J. Clayton '81 Learning Center at New Jersey Institute of Technology, I invite you to explore our website and visit our Clayton Learning Center located in the Central King Building (CKB) Room G-22. Our mission is to assist students both in the classroom an",
    "retrieved": null,
    "tags": [
      "academic",
      "tutorial",
      "workshop",
      "peer support",
      "peer",
      "technology"
    ],
    "text": "Welcome On behalf of the staff in The Norma J. Clayton '81 Learning Center at New Jersey Institute of Technology, I invite you to explore our website and visit our Clayton Learning Center located in the Central King Building (CKB) Room G-22. Our mission is to assist students both in the classroom and beyond by providing tutorial services, academic coaching, academic and personal enrichment workshops and staff and peer support so students can meet the demands of their coursework and are prepared for life after graduation. The Norma J. Clayton '81 Learning Center staff is committed to providing group and individual instruction which leads to student success. Thank you for checking out our website and we look forward to meeting you in person when you visit The Clayton Learning Center. If you have any questions or comments, please contact us at tlc@njit.edu. Sandra Taylor Director"
  },
  {
    "id": "78",
    "title": "Study Abroad | Study Abroad",
    "url": "https://www.njit.edu/studyabroad/node/78",
    "source": "www.njit.edu",
    "description": "The Office of Global Initiatives supports and promotes study abroad opportunities to undergraduate and graduate students at NJIT.",
    "retrieved": null,
    "tags": [
      "academic",
      "job",
      "study abroad",
      "international",
      "scholarship",
      "financial",
      "finance",
      "study",
      "science",
      "employer",
      "global",
      "skills",
      "tuition",
      "budget",
      "housing"
    ],
    "text": "There is so much to gain when you study abroad! An Erasmus Impact Study in 2018 showed that 65% of employers consider international experience important for recruitment, and over 90% are looking for transversal skills enhanced by study abroad. In a Social Psychological and Personality Science study , students with study abroad experience had developed the \"multicultural engagement\" skill, which predicted the number of job offers a student received. You can: Create a global network: make friends from all over the world Earn credits while living a life-changing experience Gain valuable soft skills: self-reliance, open-mindedness, and problem-solving How do I know which program is right for me? Many students are unsure of where they can study abroad, and what is right for them, because of factors like transferring credits or financial aid. Your Office of Global Initiatives has vetted and made agreements with the partners and providers to ensure that the institutions have courses and programs that closely align with NJIT's coursework. Part of the application process will be about asking these questions, and you have your academic advisors and financial aid advisors who can help you answer these questions. So, where do you rate transferring credits or graduating on time? Are finances a priority? Most students rank these are their top two priorities. NJIT Exchange Partners and Global E3 These two are great for students who want to pay NJIT tuition and have most or all financial aid and scholarships apply to their tuition. With the tuition-swap feature, studying abroad NJIT Exchange Partners and Global E3 will look mostly the same as your regular NJIT tuition bill. Only tuition is payable to NJIT, which means you will need to pay housing and for meals when you are abroad. Most financial aid and scholarships still apply but are program-dependent. Please ask your study abroad advisor about scholarships for this part. ISEP ISEP has the same tuition-swap feature as the Partners and Global E3, and in addition, students are charged NJIT housing and meal plan rates. If you already live on campus, and/or paying the NJIT housing and meal plan rates are within your budget, then this can work well for you. Study Abroad Providers & Independent Study Abroad These programs are great for students who want short-term programs, a wider variety of locations, and/or have budgeted for these programs. Students will typically pay out of pocket for these programs, sometimes having financial aid apply. How do I apply for a study abroad program when I know which program is right for me? Review the NJIT Study Abroad Application Meet with your Academic Advisor (we recommend bringing the courses with you) Meet with your Financial Aid Advisor Meet with the Dean of Students Complete the NJIT Application Submit to studyabroad@njit.edu with the additional documents on page 2 Receive the approval and nomination Apply to the program NJIT offers multiple programs year round (summer or winter terms, one semester or a full academic year). Many universities offer courses taught in English so language proficiency is not required. Learn more about study abroad programs Application Process Applying to study abroad is easy! Undergraduate students must have a sophomore, junior or senior standing and must have a grade point average of at least 2.75. Graduate students must have at least a 3.0 GPA. After applying to our office and being approved, students must apply directly to their school of choice. Complete the NJIT study abroad application . Submit the application with a copy of your passport, insurance card, and essay. Receive approval to study abroad via email. Apply to your desired program! Apply Now Deadlines: Check here to see how to plan for your study abroad experience and meet the program deadlines. Did you know that studying abroad does not have to cost more than a semester at NJIT? Costs will vary based on location and length of stay. Depending on the program, students can use all of their aid (federal, state, and institutional). There are many affordable programs and scholarships you can apply for. Learn more about scholarships"
  },
  {
    "id": "exchange-partners",
    "title": "NJIT Exchange Partners | Study Abroad",
    "url": "https://www.njit.edu/studyabroad/exchange-partners",
    "source": "www.njit.edu",
    "description": "NJIT has agreements with many universities around the world.",
    "retrieved": null,
    "tags": [
      "health",
      "study",
      "education",
      "culture",
      "tuition"
    ],
    "text": "As part of these agreements NJIT students can study at these partner universities with a tuition waiver from the host institution (only NJIT tuition will be charged for the semester or year abroad). Additional charges include room and board, flight and health insurance, among others. Costs will vary based on location. Partner Universities Austria German is Austria's official language and it's used in education, publications, announcements, and websites. German is Austria's official language and it's used in education, publications, announcements, and websites. Learn More Denmark Denmark is considered to be one of the most economically and socially progressive developed countries in the world. Denmark is considered to be one of the most economically and socially progressive developed countries in the world. Learn More France France is a highly urbanized country, and the largest cities are Paris, Lyon, and Marseille. France is a highly urbanized country, and the largest cities are Paris, Lyon, and Marseille. Learn More Germany Germany is well known for folk festival traditions such as Oktoberfest and Christmas, which include Advent wreaths and Stollen cakes. Germany is well known for folk festival traditions such as Oktoberfest and Christmas, which include Advent wreaths and Stollen cakes. Learn More Greece Greece is considered the cradle of Western civilization and the birthplace of: democracy, major scientific and math principles; and the Olympic Games. Greece is considered the cradle of Western civilization and the birthplace of: democracy, major scientific and math principles; and the Olympic Games. Learn More Italy Italy has a rich and ancient history, especially with food! Italian cuisine has developed through centuries of social and political changes with roots as far back as the 4th century BC. Italy has a rich and ancient history, especially with food! Italian cuisine has developed through centuries of social and political changes with roots as far back as the 4th century BC. Learn More Netherlands There are almost 18 million bikes in the Netherlands. The Dutch cycle an average distance of 5 miles per day and use bicycles for more than a quarter of all trips. There are almost 18 million bikes in the Netherlands. The Dutch cycle an average distance of 5 miles per day and use bicycles for more than a quarter of all trips. Learn More South Korea Korea is unique among Asian countries in its use of metal chopsticks, and now is well-known for its KPop. Korea is unique among Asian countries in its use of metal chopsticks, and now is well-known for its KPop. Learn More Spain Spanish cuisine consists of a great variety of dishes which stem from differences in geography, culture, and climate. Spanish cuisine consists of a great variety of dishes which stem from differences in geography, culture, and climate. Learn More Sweden Swedes are among the greatest consumers of newspapers in the world, and nearly every town is served by a local paper. Swedes are among the greatest consumers of newspapers in the world, and nearly every town is served by a local paper. Learn More Taiwan Taiwan has a variety of cultures with elements of traditional Chinese and Japanese culture, as well as traditional Confucianist beliefs. Taiwan has a variety of cultures with elements of traditional Chinese and Japanese culture, as well as traditional Confucianist beliefs. Learn More Thailand Thai culture has been shaped by many influences including Indian, Lao, Burmese, Cambodian, and Chinese cultures. Thai culture has been shaped by many influences including Indian, Lao, Burmese, Cambodian, and Chinese cultures. Learn More"
  },
  {
    "id": "studyabroadprograms",
    "title": "Study Abroad Programs | Study Abroad",
    "url": "https://www.njit.edu/studyabroad/studyabroadprograms",
    "source": "www.njit.edu",
    "description": "\"Studying abroad was probably the best five months of my life. 10 out of 10. I had so much fun and met so many great people.\" - Karl Giannoglou, Spain \"While I was abroad I was consistently engaged with exciting challenges, experiences and opportunities outside the classroom.\" -- Kevin Wheat, Spain",
    "retrieved": null,
    "tags": [
      "academic",
      "study abroad",
      "study",
      "lab",
      "global",
      "housing",
      "engineering"
    ],
    "text": "What are the differences among NJIT study abroad programs? The type of program that’s best for you will depend upon your academic needs and interests. Pay Housing and Meals Duration Semester Dates* Majors** NJIT Partners Yes To Host Institution Fall, Spring, sometimes Summer Institution Dependent All majors; programs vary by institution. Global E3 To Host Institution Semester-Long to Full Year Institution Dependent Engineering, CS, and IT majors. ISEP 1 To NJIT at NJIT Rates 3 Weeks to Full Year Institution Dependent All majors; programs vary by institution. Program Providers To Provider 3 Weeks to Full Year Institution Dependent All majors; programs vary by institution. Independent Study Abroad To Host Institution Depends on the chosen program Institution Dependent All majors; programs vary by institution. *Check the start/end dates for each program. **Some institutions specialize in a major. 1 \"Exchange\" options only. A complete list of exchange programs is available online. Global E3's website has for more information about its members. A complete list of recommended study abroad providers is available online. Students must submit NJIT's study abroad application before applying to their program of choice."
  },
  {
    "id": "https://www.youtube.com/@TheOrganicChemistryTutor",
    "title": "Organic Chemistry Tutor",
    "url": "https://www.youtube.com/@TheOrganicChemistryTutor",
    "source": "YouTube",
    "description": "Videos on chemistry, college math, stocks and bonds, personal finance.",
    "retrieved": null,
    "tags": [
      "academic help",
      "academic",
      "knowledge",
      "mathematics",
      "math",
      "finance",
      "stocks"
    ],
    "text": "Youtube videos with examples and problem solving for chemistry, science, math, finance, stocks, bonds, and more."
  },
  {
    "id": "khanacademy",
    "title": "Khan Academy",
    "url": "https://www.khanacademy.org/",
    "source": "Khan Academy",
    "description": "Free online courses, lessons, and practice in math, science, computing, economics, and more.",
    "retrieved": null,
    "tags": [
      "academic help",
      "academic",
      "knowledge",
      "math",
      "mathematics",
      "videos",
      "practice"
    ],
    "text": "Educational videos and exercises across math, physics, chemistry, computer science, finance, and test prep."
  },
  {
    "id": "geeksforgeeks",
    "title": "GeeksforGeeks",
    "url": "https://www.geeksforgeeks.org/",
    "source": "GeeksforGeeks",
    "description": "Computer science portal with tutorials, coding problems, interview preparation, and courses.",
    "retrieved": null,
    "tags": [
      "academic help",
      "coding",
      "knowledge",
      "career",
      "computer science"
    ],
    "text": "Articles, coding practice, and learning resources for programming, data structures, algorithms, and technical interview prep."
  },
  {
    "id": "alexlorenlee",
    "title": "Alex Loren Lee",
    "url": "https://www.youtube.com/@alexlorenlee",
    "source": "YouTube",
    "description": "Math educator sharing clear explanations and problem-solving strategies.",
    "retrieved": null,
    "tags": [
      "academic help",
      "math",
      "java",
      "knowledge",
      "mathematics"
    ],
    "text": "YouTube channel focused on mathematics with intuitive explanations and detailed walkthroughs of problem-solving methods."
  },
  {
    "id": "PhysicsNinja",
    "title": "Physics Ninja",
    "url": "https://www.youtube.com/@PhysicsNinja",
    "source": "YouTube",
    "description": "Physics tutorials covering mechanics, electromagnetism, and exam preparation.",
    "retrieved": null,
    "tags": [
      "academic help",
      "physics",
      "knowledge"
    ],
    "text": "YouTube channel with physics lectures, examples, and problem solving aimed at helping students succeed in physics courses."
  }
]